ABN      TITLE 'DMSABN     (CMS)       VM/370 - RELEASE 6'              00001000
         SPACE 2                                                        00002000
*.                                                                      00003000
*                                                                       00005000
*                                                                       00006000
*                                                                       00007000
*                                                                       00008000
*   MODULE NAME:                                                        00009000
*                                                                       00010000
*         DMSABN (ABEND RECOVERY)                                       00011000
*                                                                       00012000
*   FUNCTION:                                                           00013000
*                                                                       00014000
*         INTERCEPT ABENDS, AND PROVIDE FOR ABEND RECOVERY.             00015000
*                                                                       00016000
*   ATTRIBUTES:                                                         00017000
*                                                                       00018000
*         RE-ENTRANT, NUCLEUS RESIDENT                                  00019000
*                                                                       00020000
*   ENTRY POINTS:                                                       00021000
*                                                                       00022000
*         DMSABN -- ENTERED BY 'DMSABN TYPCALL=BALR' MACRO CALL.        00023000
*                                                                       00024000
*         DMSABNKX -- ENTERED BY 'KXCHK' MACRO, TO KILL EXECUTION,      00025000
*               AFTER 'KX' HAS BEEN TYPED IN AFTER ATTENTION.           00026000
*                                                                       00027000
*         DMSABNGO -- ENTERED BY ANY ROUTINE WHO SETS UP ABNPSW AND     00028000
*               ABNREGS IN THE WORK AREA BEFOREHAND.                    00029000
*                                                                       00030000
*         DMSABNSV -- ENTERED AS THE RESULT OF 'DMSABN TYPCALL=SVC'     00031000
*               MACRO CALL                                              00032000
*                                                                       00033000
*         DMSABNUA -- ENTERED FROM DMSSAB AFTER 'ABEND' MACRO IS        00034000
*               ISSUED.                                                 00035000
*                                                                       00036000
*         DMSABNRT -- RETURN ENTRY POINT FROM DEBUG                     00037000
*                                                                       00038000
*   ENTRY CONDITIONS                                                    00039000
*                                                                       00040000
*         DMSABN, DMSABNSV -- R0 CONTAINS ABEND CODE                    00041000
*                                                                       00042000
*         DMSABNUA -- R1 CONTAINS THE USER ABEND CODE                   00043000
*                                                                       00044000
*         DMSABNGO -- ABNPSW AND ABNREGS ARE SET UP IN DMSABW           00045000
*                                                                       00046000
*   EXIT CONDITIONS:                                                    00047000
*                                                                       00048000
*         EXITS TO DEBUG OR TO DMSINS TO PROCESS THE NEXT COMMAND.      00049000
*                                                                       00050000
*   EXTERNAL REFERENCES:                                                00051000
*                                                                       00052000
*         DMSERR -- TO TYPE OUT ERROR MESSAGES.                         00053000
*                                                                       00054000
*         DMSCITDB (DESBUF) -- TO CLEAR INPUT STACK                     00055000
*                                                                       00056000
*         DMSCRD (WAITRD) -- TO READ A LINE FROM THE CONSOLE.           00057000
*                                                                       00058000
*         DMSDBG (DEBUG) -- IF 'DEBUG' IS REQUESTED.                    00059000
*                                                                       00060000
*         DMSITSR -- INTSVC ABEND RECOVERY ROUTINE                      00061000
*                                                                       00062000
*         DMSEXCAB (EXEC ABEND RECOVERY ENTRY) -- FREES EXECTOR, IF THE 00063000
*               LATTER IS CURRENTLY ACTIVE.                             00064000
*               'XCTL' MACROS.                                          00065000
*                                                                       00066000
*         DMSFRES (DMSFRE SERVICE ROUTINE) -- TO INITIALIZE STORAGE     00067000
*                                                                       00068000
*         DMSLADN (ADTNXT) -- TO GET ADDRESS OF ACTIVE DISK TABLE       00069000
*                                                                       00070000
*         DMSINTAB (DMSINT ABEND RECOVERY ENTRY) -- EXIT POINT TO       00071000
*               PROCESS THE NEXT COMMAND                                00072000
*                                                                       00073000
*         DMSCAT (ATTN) -- TURN OFF 'KT' FLAG, IF IT IS ON              00074000
*                                                                       00075000
*         DMSCWT (CONWAIT) -- WAIT FOR TERMINAL OUTPUT TO COMPLETE.     00076000
*                                                                       00077000
*         DMSABW -- ADDRESS OF DMSABN WORKSPACE                         00078000
*                                                                       00079000
*   CALLS TO OTHER ROUTINES                                             00080000
*                                                                       00081000
*         SEE 'EXTERNAL REFERENCES'                                     00082000
*                                                                       00083000
*   TABLES, WORKAREAS:                                                  00084000
*                                                                       00085000
*         DMSABW -- DMSABN WORK AREA                                    00086000
*                                                                       00087000
*   REGISTER USAGE                                                      00088000
*                                                                       00089000
*         R12 = BASE REGISTER                                           00090000
*         R3 POINTS TO DMSABW WORK AREA                                 00091000
*         R4 = INTERNAL SUBROUTINE RETURN REGISTER                      00092000
*         R5 = POINTER TO ACTIVE DISK TABLE                             00093000
*         R6 = SCRATCH FOR COMPUTING SUM                                00094000
*         R7 = SCRATCH REGISTER                                         00095000
*                                                                       00096000
*   NOTES                                                               00097000
*                                                                       00098000
*         NONE                                                          00099000
*                                                                       00100000
*   OPERATION:                                                          00101000
*                                                                       00102000
*         WHEN THE ROUTINE IS ENTERED, THE ABEND PSW AND REGISTERS ARE  00103000
*         SET UP IN THE WORK AREA, DMSABW, DESCRIBED BY THE MACRO       00104000
*         ABWSECT.                                                      00105000
*                                                                       00106000
*         DMSABN THEN TYPES OUT AN ABEND MESSAGE AND THE LINE 'CMS', TO 00107000
*         INDICATE TO THE USER THAT HE MAY TYPE IN ANOTHER COMMAND.     00108000
*        IF HE TYPES IN THE 'DEBUG' COMMAND, THEN CONTROL PASSES THERE, 00109000
*         WITH DEBUG'S PSW AND REGISTERS SET AS OF THE TIME OF ABEND.   00110000
*                                                                       00111000
*         IF HE TYPES IN ANY OTHER COMMAND, THEN ABEND RECOVERY IS      00112000
*         INVOKED.  THIS CONSISTS OF CLOSING ALL FILES, FREEING ALL     00113000
*         USER STORAGE, FREEING WHATEVER NUCLEUS STORAGE BLOCKS ARE     00114000
*         KNOW TO EXIST, AND INITIALIZING THE SVC HANDLER.  AT THIS     00115000
*         POINT, THE AMOUNT OF CORE STORAGE BEING USED UP BY THE        00116000
*         USER FILE DIRECTORIES IS COMPUTED, AND THIS FIGURE IS         00117000
*         COMPARED WITH THE AMOUNT OF STORAGE ACTUALLY ALLOCATED. IF    00118000
*         THE TWO FIGURES ARE UNEQUAL, THEN A MESSAGE IS TYPED TO THE   00119000
*         USER.                                                         00120000
*                                                                       00121000
*         AFTER ABEND RECOVERY HAS BEEN COMPLETED, THEN CONTROL PASSES  00122000
*        TO DMSINT, AT ENTRY POINT DMSINTAB, TO PROCESS THE NEW COMMAND 00123000
*         WHICH WAS TYPED IN.                                           00124000
*                                                                       00125000
*.                                                                      00126000
DMSABN   CSECT                                                          00128000
         REGEQU                                                         00129000
         SPACE 3                                                        00130000
BR       EQU   R12                     BASE REGISTER                    00131000
WR       EQU   R3                      WORKSPACE (DMSABW) POINTER       00132000
RR       EQU   R4                      INTERNAL SUBROUTINE RETURN REG   00133000
ADR      EQU   R5                      POINTER TO ACTIVE DISK TABLE     00134000
SUM      EQU   R6                      SCRATCH FOR COMPUTING SUM        00135000
XR       EQU   R7                      SCRATCH REGISTER                 00136000
         SPACE                                                          00137000
         USING DMSABN,BR                                                00138000
         USING NUCON,R0                                                 00139000
         USING ADTSECT,ADR                                              00140000
         USING ABWSECT,WR                                               00141000
         ENTRY DMSABNKX,DMSABNGO,DMSABNRT                               00142000
         ENTRY DMSABNSV,DMSABNUA                                        00143000
         ENTRY KILLEX                  *********  REMOVE **********     00144000
* THIS ENTRY IS CALLED BY THE DMSABN MACRO, WITH 'TYPCALL=BALR'         00146000
DMSABN   CSECT                                                          00147000
         USING *,R15                                                    00148000
         STM   R14,R0,IPLPSW           SAVE REGS IN LOW CORE            00149000
         B     SETUP                   GO SET THINGS UP                 00150000
         EJECT                                                          00151000
* THIS ENTRY IS CALLED WHEN THE USER TYPES 'KX' AFTER TYPING AN         00152000
* ATTENTION, PROVIDED THAT THE 'KX' ACTION WAS HELD UP BECAUSE OF       00153000
* A USER FILE DIRECTORY BUSY (UFDBUSY) PROBLEM.                         00154000
* IN OTHER CASES ('KX' TAKEN FROM DMSITS OR DMSITI), ENTRY IS MADE      00155000
* DIRECTLY TO DMSABNGO.                                                 00156000
* WHEN CONTROL COMES HERE, REGISTERS 14 AND 15 ARE SET UP IN TERMS      00157000
* OF A BALR LINKAGE TO THIS ENTRY POINT.  THE VALUES OF                 00158100
* REGISTERS 14 AND 15 HAVE BEEN STORED IN LOCATION 0                    00158200
* (IPLPSW), BUT THE VALUES ARE MEANINGLESS.  THEREFORE,                 00158300
* REGISTER 0 IS SET UP TO REFLECT AN HX ABEND.                          00158400
DMSABNKX EQU   *                                                        00160000
KILLEX   EQU   *                                                        00161000
         USING *,R15                                                    00162000
         LA    R0,X222            GET HX ABEND CODE            @VA05051 00162500
         ST    R0,IPLPSW+8             R14-R0 ARE NOW IN LOW CORE       00163000
         TM    DOSFLAGS,DOSMODE   DOS ENVIRONMENT FLAG         @V305066 00164100
         BZ    SETUP              GO SET THINGS UP             @V305066 00164600
         OI    DOSFLAGS,DOSMODE+DOSSVC  TURN ON 2 DOS FLAGS    @V305066 00165100
*                                 CONTINUE TO "SETUP" ...               00165600
         EJECT                                                          00166000
* WE MUST INITIALIZE ABNREGS AND ABNPSW IN THE SAVE AREA TO THE         00167000
* REGISTERS AND PSW AT THE TIME OF THE ABEND.                           00168000
SETUP    EQU   *                                                        00169000
         BALR  R15,0                   ESTABLISH ADDRESSABILITY         00170000
         USING *,R15                                                    00171000
         L     R14,=V(DMSABW)          POINT TO WORK AREA               00172000
         USING ABWSECT,R14                                              00173000
         STM   R1,R13,ABNREGS+4*R1     SAVE REGISTERS R1 THRU R13       00174000
         L     BR,=A(DMSABN)           LOAD BASE REGISTER               00175000
         LR    WR,R14                  SAVE POINTER TO WORK AREA        00176000
         DROP  R14,R15                                                  00177000
         MVC   ABNREGS+4*R14(8),IPLPSW COPY REGS R14, R15 FROM LOW CORE 00178000
         MVC   ABNREGS+4*R0(4),IPLPSW+8 COPY REG 0 FROM LOW CORE        00179000
         LR    XR,R0                   SAVE ABEND CODE                  00180000
         SPACE 2                                                        00181000
* WE MUST NOW CONSTRUCT THE PSW AT THE TIME OF THE ABEND.               00182000
* THE SECOND WORD OF THE PSW WAS PASSED IN REG 14 (BY MEANS OF          00183000
* BALR 14,15).  WE FIND THE FIRST WORD, WHICH HAS NOT CHANGED SINCE     00184000
* ENTRY TO THIS ROUTINE, BY PROGRAM CHECKING, AFTER TEMPORARILY         00185000
* CHANGING THE PROGRAM NEW PSW IN LOW CORE.                             00186000
         LM    R0,R1,PGMNPSW           SAVE OLD VALUE OF PROGRAM NEW   *00187000
                                       PSW                              00188000
         MVC   PGMNPSW,=A(0,SETX)      POINT IT AT SETX BELOW           00189000
         DC    H'0'                    PROGRAM CHECK                    00190000
         SPACE                                                          00191000
* CONTROL COMES HERE ON THE PROGRAM CHECK                               00192000
SETX     EQU   *                                                        00193000
         STM   R0,R1,PGMNPSW           RESTORE OLD VALUE OF PGMNPSW     00194000
         SPACE                                                          00195000
* THE FIRST WORD OF PGMOPSW CONTAINS THE FIRST WORD OF THE PSW WE WANT. 00196000
         MVC   ABNPSW(4),PGMOPSW       COPY FIRST WORD OF NEW PSW       00197000
         ST    R14,ABNPSW+4            STORE SECOND HALF OF ABN PSW     00198000
         STH   XR,ABNPSW+2             USE ABEND CODE AS SECOND HALFWRD 00199000
         B     ABGO                    GO                               00200000
         EJECT                                                          00201000
* ENTER HERE FROM DMSSAB IF ABEND MACRO (SVC 13) HAS BEEN EXECUTED.     00202000
DMSABNUA EQU   *                                                        00203000
         USING *,R15                                                    00204000
         L     BR,=A(DMSABN)           SET BASE REG                     00205000
         DROP  R15                                                      00206000
         L     WR,=V(DMSABW)           POINT TO WORK AREA               00207000
         L     R13,CURRSAVE            POINT TO CURRENT SYSTEM         *00208000
                                       SAVE AREA                        00209000
         USING SSAVE,R13                                                00210000
         MVC   ABNREGS(4*16),EGPRS     COPY REGISTERS AT TIME OF SVC 13 00211000
         MVC   ABNPSW,OLDPSW           COPY PSW AT TIME OF SVC 13       00212000
         SPACE                                                          00213000
* WE NOW CLEAR THIS SAVE AREA, BY RETURNING TO THE SVC HANDLER.         00214000
* BUT FIRST, WE CHANGE THE PSW AND A COUPLE OF ADDRESS, SO THAT         00215000
* WE WILL COME BACK TO UABEND WITH THE BASE REGS SET.                   00216000
         ST    BR,EGPRS+4*BR           SET BASE REG                     00217000
         ST    WR,EGPRS+4*WR           STORE WORK AREA BASE REG         00218000
         MVC   OLDPSW,=A(0,UABEND)     RESET PSW                        00219000
         BR    R14                     RETURN TO SVC HANDLER            00220000
* NOTE:  DMSSAB SHOULD HAVE PASSED ME A CORRECT REG 14 POINTING TO      00221000
* THE SVC HANDLER.                                                      00222000
         SPACE                                                          00223000
* COME BACK HERE FROM THE SVC HANDLER.                                  00224000
UABEND   EQU   *                                                        00225000
         L     R8,ABNPSW+4    GET ABEND INSTRUCTION ADDRESS    @VA05120 00226100
         SRL   R8,4           LAST 4 BITS ..                   @VA05120 00226200
         SLL   R8,4           .. MUST BE ZERO                  @VA05120 00226300
         ISK   R8,R8          GET STORAGE KEY                  @VA05120 00226400
         LA    R9,240         'F0' COVERS ALL STORAGE KEYS     @VA05120 00226500
         NR    R8,R9          ELIMINATE THE REST               @VA05120 00226600
         CLM   R8,B'0001',USERKEY USER (KEY) ABEND ?           @VA05120 00226700
         BE    UABEND1        YES, TREAT AS USER ABEND         @VA05120 00226800
         STH   R1,ABNPSW+2             STORE ABEND CODE IN PSW    P3082 00230000
         B     ABGO                    SYSTEM ABEND               P3082 00231000
         SPACE 1                                                        00232000
UABEND1  EQU   *                                                  P3082 00233000
         BAL   RR,NOKX                 DON'T ALLOW KX                   00234000
         BAL   RR,CONWAIT              WAIT FOR TYPED OUTPUT            00235000
         BAL   RR,ATTN                 CLEAR INPUT BUFFER               00236000
         BAL   RR,AUXCLEAN        GO CHECK FOR AUX. DIRECTORY  @VA00985 00236500
         BAL   RR,CONSAVE       SAVE LAST CONSOLE MSG FOR IPCS @V67CBE4 00236700
         LA    R0,X'2FF'               SYSTEM ABEND CODE                00237000
         STH   R0,ABNPSW+2             AND STORE IN PSW                 00238000
         SPACE                                                          00239000
* THE OS 'ABEND' MACRO PUTS THE ABEND CODE INTO REG 1.                  00240000
         L     XR,ABNREGS+4*R1         GET ABEND CODE                   00241000
         LA    XR,0(,XR)               CLEAR DUMP CODE, IF ANY          00242000
         AH    XR,=H'10000'            FORCE LEADING ZEROS TO TYPE      00243000
         DMSERR NUM=155,LET=T,TYPCALL=BALR,                            *00244000
               MF=(E,ABNERLST),                                        *00245000
               TEXT='USER ABEND .... CALLED FROM ......',              *00246000
               SUB=(DEC,(XR),HEXA,ABNPSW+4)                             00247000
         B     WAIT                    GO WAIT FOR TYPEOUT              00248000
         EJECT                                                          00249000
* ENTER HERE ON A DMSABN MACRO CALL, WITH TYPCALL=SVC.                  00250000
DMSABNSV EQU   *                                                        00251000
         USING *,R15                                                    00252000
         L     BR,=A(DMSABN)           SET UP NORMAL BASE REGISTER      00253000
         DROP  R15                                                      00254000
         L     WR,=V(DMSABW)           POINT TO WORK AREA               00255000
         L     R13,CURRSAVE            POINT TO CURRENT SYSTEM SAVEAREA 00256000
         USING SSAVE,R13                                                00257000
         SPACE                                                          00258000
* THE CURRENT SYSTEM SAVE AREA CONTAINS THE REGISTERS AND PSW WHICH     00259000
* WERE IN EFFECT AT THE TIME OF THE DMSABN MACRO .  WE COPY ALL         00260000
* THIS INFORMATION INTO THE DMSABW WORK AREA.                           00261000
         MVC   ABNREGS(4*16),EGPRS     COPY REGISTERS                   00262000
         MVC   ABNPSW,OLDPSW           COPY PSW                         00263000
         STH   R0,ABNPSW+2             STORE ABEND CODE INTO PSW        00264000
         SPACE                                                          00265000
* WE ARE NOW GOING TO RETURN TO THE SVC HANDLER.  WE ALTER THE VALUE    00266000
* IN OLDPSW SO THAT CONTROL WILL GO TO DMSABNGO, RATHER THAN TO         00267000
* THE POINT WHERE THE SVC WAS INVOKED.                                  00268000
         MVC   OLDPSW,=A(0,DMSABNGO)   ALTER OLD PSW                    00269000
         MVC   NRMRET,=A(DMSABNGO)     ALTER NORMAL RETURN              00270000
         SR    R15,R15                                                  00271000
         BR    R14                     RETURN TO SVC HANDLER            00272000
         DROP  R13                                                      00273000
         EJECT                                                          00274000
* ENTER AT THIS POINT IF THE REGS AND PSW ARE ALREADY SET UP IN         00275000
* THE WORK AREA.                                                        00276000
DMSABNGO EQU   *                                                        00277000
         BALR  R15,0                   ESTABLISH ADDRESSABILITY         00278000
         USING *,R15                                                    00279000
         L     BR,=A(DMSABN)                                            00280000
         DROP  R15                                                      00281000
         L     WR,=V(DMSABW)           POINT TO WORK AREA               00282000
         SPACE 5                                                        00283000
* TYPE OUT MESSAGE TO USER                                              00284000
ABGO     EQU   *                                                        00285000
         BAL   RR,NOKX                 DON'T ALLOW KX                   00286000
         BAL   RR,CONWAIT              WAIT FOR TYPED OUTPUT            00287000
         BAL   RR,ATTN                                         @VM03203 00287990
         BAL   RR,AUXCLEAN        GO CHECK FOR AUX. DIRECTORY  @VM03203 00288000
         BAL   RR,CONSAVE       SAVE LAST CONSOLE MSG FOR IPCS @V67CBE4 00288005
         CLC   =XL2'0222',ABNPSW+2   IS THIS AN HX ABEND?               00288010
         BE    WAIT                  YES, NO MESSAGE.                   00288020
         CLC ABNPSW+2(1),=X'00'     ABEND CODE LESS THAN 100?           00288030
         BNE   MSGE                  NO, ISSUE MESSAGE.                 00288040
         LH    R8,ABNPSW+2           LOAD ABEND CODE.                   00288050
         SRL   R8,4                                                     00288060
         CH    R8,=H'12'             CHECK FOR 0C.                      00288070
         BE    WAIT                  YES, BYPASS MESSAGE.               00288080
         CH    R8,=H'15'             CHECK FOR 0F.                      00288090
         BE    WAIT                  YES, BYPASS MESSAGE.               00288100
MSGE     EQU   *                                                        00288110
         DMSERR NUM=148,LET=T,                                         *00288120
               MF=(E,ABNERLST),                                        *00288130
               TYPCALL=BALR,                                           *00288140
               TEXT='SYSTEM ABEND ... CALLED FROM ......',             *00288150
               SUB=(HEXA,ABNPSW,HEXA,ABNPSW+4)                          00288160
         EJECT                                                          00294000
* NEXT, WE MUST DETERMINE WHAT TO DO.                                   00295000
* WE WAIT FOR ALL TYPEOUT, CLEAR THE INPUT STACK, AND THEN GET          00296000
* A LINE BY CALLING WAITRD.                                             00297000
WAIT     EQU   *                                                        00298000
         BAL   RR,CONWAIT              WAIT FOR TYPED OUTPUT            00299000
         BAL   RR,ATTN                 RESTORE TYPING                   00300000
         SPACE                                                          00301000
* CLEAR INPUT BUFFER STACK                                              00302000
         L     R15,=V(DMSCITDB)        POINT TO DESBUF ROUTINE          00303000
         BAL   RR,NUCCALL              CALL DESBUF                      00304000
         TM    DBGFLAGS,DBGEXEC IS THIS FROM DEBUG?            @VA04318 00304100
         BNO   TCMS           NO,, THEN DO READ                @VA04318 00304200
         NI    DBGFLAGS,DBGSHR+DBGNSHR SAVE ONLY USEFUL FLAG   @VA04318 00304300
         SPACE                                                          00305000
* READ A LINE FROM THE TERMINAL.                                        00306000
TCMS     EQU   *                                                        00307000
         L     R1,ABNCOMND    ADDR ABEND COMMAND               HRC009DS 00307200
         LTR   R1,R1          ANYTHIN THERE?                   HRC009DS 00307400
         BNZ   TCMS1          YES, DONT TYPE THIS GARBAGE THEN HRC009DS 00307600
         LINEDIT TEXT='CMS',TYPCALL=BALR,DOT=NO                         00308000
TCMS1    EQU   *                                               HRC009DS 00308500
         BAL   RR,KXCHK                TEST FOR KX'S                    00309000
         TM    BATFLAGS,BATRUN+BATLOAD   BATCH MONITOR RUNNING?   V0742 00309100
         BC    11,NOTBAT           IF NOT, FORGET THIS...         V0742 00309110
         TM    BATFLAG2,BATSYSAB   RECURSIVE SYS ABEND CHEK    @VA05162 00309150
         BZ    BATABEND            FIRST TIME, GOTO BATCH      @VA05162 00309200
         BAL   R1,DIEDIAG          POINT TO MSG LINE           @VA05162 00309250
DIEMSG   DC    C'MSG OPERATOR CMSBATCH SYSTEM ABEND'           @VA05162 00309300
DIEMSGLN EQU   *-DIEMSG                                        @VA05162 00309350
DIEDIAG  LA    R2,DIEMSGLN         PROVIDE LENGTH OF DIE MSG   @VA05162 00309400
         DC    X'83120008'         DIAG MSG TO CP AND...       @VA05162 00309450
         LPSW  WAITPSW             DIE.                        @VA05162 00309500
         CNOP  0,8                ASSURE DOUBLE WORD ALIGN.    @VA05162 00309550
WAITPSW  DC    X'00020000',A(*-4)                              @VA05162 00309600
         SPACE 1                                                        00309650
BATABEND OI    BATFLAG2,BATSYSAB   SET RECURSION FLAG ...      @VA05162 00309700
         B     REC                 AND TRY TO RECOVER...       @VA05162 00309750
NOTBAT   EQU   *                                               @VA05162 00309800
         L     R1,ABNCOMND    ADDR ABEND COMMAND               HRC009DS 00309810
         LTR   R1,R1          SOMETHIN THERE                   HRC009DS 00309820
         BZ    READSTK        NO, DON'T STACK ABEND COMMAND    HRC009DS 00309830
         MVC   ABNPAS13(16),ATTNLIST   A SKELETON PLIST        HRC009DS 00309840
         MVC   ABNPAS13+12,0(R1)   LENGTH TO PLIST             HRC009DS 00309850
         LA    R1,1(,R1)      BUMP PAST LENGTH                 HRC009DS 00309860
         STCM  R1,B'0111',ABNPAS13+13  ADDRESS TO BUFFER       HRC009DS 00309870
         LA    R1,ABNPAS13    ADDR PLIST                       HRC009DS 00309880
         L     R15,=V(DMSCAT) ADDR STACK ROUTINE               HRC009DS 00309890
         BAL   RR,NUCCALL     CALL STACK                       HRC009DS 00309900
         L     R1,ABNCOMND    ADDR BUFFER AGAIN                HRC009DS 00309910
         LA    R0,17          NUMBER OF DWORDS                 HRC009DS 00309920
         DMSFRET DWORDS=(0),LOC=(1),TYPCALL=BALR               HRC009DS 00309930
         ST    R15,ABNCOMND   CKEAR IT NOW                     HRC009DS 00309940
READSTK  EQU  *                                                HRC009DS 00309950
         L     R1,AOPSECT              POINT TO OPSECT                  00310000
         USING OPSECT,R1                                                00311000
         MVI   CONRDCOD,C'U'           FORCE UPPERCASE CONVERSION       00312000
         LA    R1,CONREAD              POINT TO PLIST                   00313000
         DROP  R1                                                       00314000
         L     R15,=V(DMSCRD)          POINT TO WAITRD ROUTINE          00315000
         BAL   RR,NUCCALL              CALL WAITRD                      00316000
         CLC   CMNDLINE(8),=CL8' ' NULL LINE                      V0375 00317100
         BE    TCMS                                                     00318000
         CLC   CMNDLINE(3),=CL3'HX ' HX CMD ?                  @VA05889 00318250
         BE    TCMS                                            @VA05889 00318500
         CLC   CMNDLINE(3),DUMPPARM   VMDUMP COMMAND?          @V67CBE4 00318515
         BE    TAKEDMP              GO SCHEDULE THE DUMP CALL  @V67CBE4 00318530
         CLC   CMNDLINE(2),CPPARM    MAY BE VMDUMP PREFACED    @V67CBE4 00318545
         BNE   CLRSAVE      IF NOT GO CLEAR SAVED MESSAGE AREA @V67CBE4 00318560
         LA    R7,CMNDLINE+1   BETTER LOOK AT NEXT FIELD       @V67CBE4 00318575
VMDLOOP  EQU   *                                               @V67CBE4 00318590
         LA    R7,1(R7)        INCREMENT COMMAND LINE POINTER  @V67CBE4 00318605
         CLI   0(R7),C' '      AT NEXT FIELD                   @V67CBE4 00318620
         BNE   VMDLOOP         NO--LOOK AT NEXT CHARACTER      @V67CBE4 00318635
         CLC   0(3,R7),DUMPPARM       VMDUMP COMMAND?          @V67CBE4 00318650
         BNE   CLRSAVE         SKIP CP DIAGNOSE IF NOT         @V67CBE4 00318665
         SPACE 1                                               @V67CBE4 00318680
*   BUILD DIAGNOSE INTERFACE AND PASS VMDUMP COMMAND TO CP     @V67CBE4 00318695
TAKEDMP  EQU   *                                               @V67CBE4 00318710
         L     R1,AOPSECT         POINT TO OPSECT              @V67CBE4 00318725
         USING OPSECT,R1                                       @V67CBE4 00318740
         XR    R2,R2          CLEAR FOR INSERT                 @VA14612 00318755
         ICM   R2,B'0011',CONRDCNT  PICK UP COMMAND LENGTH     @VA14612 00318765
         DROP  R1                                              @V67CBE4 00318770
         LA    R1,CMNDLINE    POINT TO COMMAND                 @V67CBE4 00318785
         DC    X'83120008'    PASS COMMAND TO CP VIA DIAGNOSE  @V67CBE4 00318800
         B     TCMS           LETS GET NEXT USER INPUT LINE    @V67CBE4 00318815
CLRSAVE  EQU   *                                               @V67CBE4 00318830
         MVI   ABNCMSG,C' '   CLEAR IPCS MSG SAVE AREA         @V67CBE4 00318845
         MVC   ABNCMSG+1(95),ABNCMSG                           @V67CBE4 00318860
         CLC   =C'DEBUG ',CMNDLINE                                      00319000
         BE    GDEBUG                                                   00320000
         B     REC                                                      00321000
         SPACE 5                                                        00322000
GDEBUG   EQU   *                                                        00323000
         BAL   RR,KXOK                 KX IS NOW OK                     00324000
         OI    DBGFLAGS,DBGABN         TELL DEBUG WE'RE FROM DMSABN     00325000
         L     R15,=V(DMSDBG)                                           00326000
         BAL   RR,NUCCALL              CALL DEBUG                       00327000
         BAL   RR,NOKX                 KX NO LONGER ALLOWED             00328000
         L     XR,AOPSECT              POINT TO OPSECT                  00329000
         USING OPSECT,XR                                                00330000
         XC    CONRDCNT,CONRDCNT       MAKE INPUT LINE NULL             00331000
         DROP  XR                                                       00332000
         B     REC                     IF 'RETURN', THEN PROCEED TO    *00333000
                                       ABEND RECOVERY                   00334000
* PERFORM ABEND RECOVERY                                                00336000
REC      EQU   *                                                        00337000
         SPACE 1                                                        00338000
* FIRST, WE DE-AUTHORIZE VMCF                                           00338100
         STCTL C0,C0,ABNRR          TURN OFF VMCF ENABLE BIT-- @VA11336 00338200
         NI    ABNRR+3,X'FE'        BIT 31 IN CONTROL REG 0    @VA11336 00338300
         LCTL  C0,C0,ABNRR                                     @VA11336 00338400
         LA    R1,ABNERLST+7        SET UP VMCF PARM BLOCK     @VA11336 00338500
         SRL   R1,3                 MUST BE ON A DBLWORD BDY   @VA11336 00338600
         SLL   R1,3                                            @VA11336 00338700
         XC    0(40,R1),0(R1)       ZERO IT OUT                @VA11336 00338800
         MVI   3(R1),X'01'          DEAUTHORIZE SUBFUNCTION    @VA11336 00338900
         DC    X'83120068'          DIAGNOSE TO CALL VMCF      @VA11336 00339000
         SPACE 1                                                        00339100
* NEXT, WE RE-INITIALIZE THE SVC HANDLER, SO THAT WE CAN CALL SVCS      00339200
         L     R15,=V(DMSITSR)         SVC HANDLER RE-INITIALIZER       00340000
         BAL   RR,NUCCALL              CALL IT                          00341000
         LA    R1,FINPLIST             POINT TO 'FINIS' PLIST           00342000
         L     R15,AFINIS     POINT TO FINIS ROUTINE           @VA10359 00343000
         BAL   RR,NUCCALL     CLOSE ALL FILE AND UPDATE DIRECT @VA10359 00344000
         SPACE                                                          00345000
* RELEASE EXECTOR MODULE FROM FREE STORAGE.                             00346000
         L     R15,=V(DMSEXCAB)                                         00347000
         BAL   RR,NUCCALL              FREE EXECTOR                     00348000
         SPACE 2                                                        00349000
* ZERO OUT MACLIB DIRECTORY POINTERS                                    00350000
         XC    MACDIRC(32),MACDIRC                                      00351000
         SPACE 1                                                        00351025
* CLEAR CMS SUBSET REMAINS                                              00351050
         CLI   SUBFLAG,X'00'  SUBSET CLEAR                        V0375 00351075
         BE    NOSUB          BRANCH NO SUBSET ON                 V0375 00351100
         L     RR,ASUBSECT    ADDRESSS OF SUBSET WORK AREA        V0375 00351125
         USING SUBSECT,RR                                         V0375 00351150
         MVI   SUBFLAG,X'00'  RESET SUBSET FLAGS                  V0375 00351175
         L     R7,ASUBFST     LAST LINK IN SUBFST CHAIN           V0375 00351200
SUBLOOP  LTR   R1,R7          END OF CHAIN                        V0375 00351225
         BZ    SUBRET         BRANCH IF END                       V0375 00351250
         L     R7,0(R1)       SAVE CHAIN POINTER                  V0375 00351275
         LA    R0,4           FREE 4 DBLWDS                       V0375 00351300
         DMSFRET DWORDS=(0),LOC=(1),TYPCALL=BALR                  V0375 00351325
         B     SUBLOOP                                            V0375 00351350
SUBRET   L     R1,ASUBSTAT    GET ADDR OF STATEFST INFO           V0375 00351375
         LA    R0,STFSTSDW    Free STATEFST doubleword size    HRC015DS 00351410
         DMSFRET DWORDS=(0),LOC=(1),TYPCALL=BALR                  V0375 00351425
         DROP  RR                                                 V0375 00351450
NOSUB    EQU   *                                                  V0375 00351475
         SPACE                                                          00352000
* CALL INTER-COMMAND CLEANUP ROUTINE                                    00353000
         SVC   203                                                      00354000
         DC    H'12'                   DMSSMNCL (CLEANUP ROUTINE) CODE  00355000
         L     R15,=V(DMSSNXAB)   NUCX ABEND handler routine            00355100
         BAL   RR,NUCCALL         Go cleanup extensions                 00355200
* FREE ALL USER STORAGE                                        @VA04752 00355300
         DMSFRES UREC,TYPCALL=BALR                             @VA04752 00355700
         SPACE                                                          00356000
* ZERO OUT USER INTERRUPT HANDLER POINTERS IN IOSECT                    00357000
         L     XR,AIOSECT              POINT TO IOSECT                  00358000
         USING IOSECT,XR                                                00359000
         XC    IONTABL,IONTABL         SIZE OF INTERRUPT TABLE          00360000
         XC    AUSRITBL,AUSRITBL       ADDRESS OF TABLE                 00361000
         XC    AUSRILST,AUSRILST       ADDRESS OF LAST ENTRY            00362000
* ZERO OUT MOD5 IN MODFLGS FOR THE USE OF DMSMOD (LOADMOD)              00362100
         NI    MODFLGS,X'FF'-MDPCALL   NO LOAD MAP             @VA08985 00362200
         SPACE                                                          00363000
* TURN SVCTRACE OFF, IN CASE IT'S ON                                    00364000
         LA    R1,SVCPLIST             POINT TO SVCTRACE PLIST          00365000
         SVC   202                                                      00366000
         SPACE                                                          00367000
* CLOSE PUNCH AND PRINTER                                               00368000
         LINEDIT DISP=CPCOMM,DOT=NO,TEXT='CLOSE PUN'                    00369000
         LINEDIT DISP=CPCOMM,DOT=NO,TEXT='CLOSE PRT'                    00370000
         SPACE                                                          00371000
* CLOSE READER WITH 'HOLD' OPTION                                       00372000
         LINEDIT DISP=CPCOMM,DOT=NO,TEXT='CLOSE RDR HOLD'               00373000
         SPACE 1                                                        00373100
         TM    VSAMFLG1,VSAMRUN+VSAMSOS VSAM OR AMS RUNNING ?  @VM03082 00373150
         BZ    CLEARCBS       IF NOT, CONTINUE...              @V305106 00373200
         LA    R1,VSAMLIST    DMSVSR PLIST                     @V305106 00373250
         SVC   202            CLEAN UP AFTER VSAM              @V305106 00373300
         DC    AL4(*+4)       ...                              @VM03082 00373325
CLEARCBS EQU   *                                               @V305106 00373350
         SPACE                                                          00374000
* ZERO OUT ALL FCB POINTERS                                             00375000
         XC    FCBFIRST,FCBFIRST       FIRST FCB POINTER                00376000
         XC    FCBNUM,FCBNUM           NUMBER OF FCB'S                  00377000
         XC    DOSFIRST,DOSFIRST       FIRST DOSCB POINTER     @V305001 00377100
         XC    DOSNUM,DOSNUM           NUMBER OF DOSCB'S       @V305001 00377200
         SPACE 2                                                        00380000
         B     CK                                                       00381000
         SPACE 3                                                        00382000
FINPLIST DC    CL8'FINIS',3CL8'*',8X'FF' FINIS PLIST                    00383000
SVCPLIST DC    CL16'SVCTRACEOFF',8X'FF' SVCTRACE OFF                    00384000
VSAMLIST DC    CL8'DMSVSR',8X'FF'  VSAM CLEANUP CALL LIST      @V305106 00384100
CON175   EQU   175                $$B (LTA) SIZE               @VA09234 00384200
         EJECT                                                          00385000
* WE NOW CHECK TO SEE WHETHER ABEND RECOVERY WAS SUCCESSFUL.  WE        00386000
* CAN'T REALLY TELL FOR SURE, OF COURSE, BUT WE DO MAKE ONE             00387000
* IMPORTANT CHECK.  WE CHECK TO SEE WHETHER WE HAVE RECOVERED           00388000
* ALL STORAGE WHICH HAS EVER BEEN ALLOCATED.                            00389000
         SPACE                                                          00390000
* WE MUST FIRST COMPUTE THE AMOUNT OF KNOWN ALLOCATED STORAGE.          00391000
CK       EQU   *                                                        00392000
         SR    SUM,SUM                 ZERO SUM SO FAR                  00393000
         SPACE                                                          00394000
* IF THERE ARE ANY STACKED READS, THEN ADD SEVENTEEN DOUBLEWORDS.       00395000
         CLC   NUMFINRD,=F'0'          ANY STACKED READS?               00396000
         BE    *+8                     SKIP IF NOT                      00397000
         AH    SUM,=H'17'              ADD 17 DWORDS FOR BLOCK          00398000
         SPACE                                                          00399000
* IF THERE ARE ANY USER SYNONYMS, THEN ADD SIZE OF TABLE.               00400000
         L     XR,AUSABRV              POINT TO SIZE OF TABLE, IF ANY   00401000
         A     SUM,0(XR)               ADD IT IN                        00402000
         SPACE 1                                                        00402100
* IF THERE ARE ANY USER TRANSLATE TABLES ADD 32 FOR EACH ONE.           00402150
         L     XR,AINTRTBL    INPUT TABLE IF ANY               @VA01054 00402200
         LTR   XR,XR          IS THERE ONE?                    @VA01054 00402250
         BZ    TRYOUT         NO, TRY OUTPUT                   @VA01054 00402300
         LA    SUM,64(SUM)    ACCOUNT FOR IT                   @VA03002 00402360
TRYOUT   L     XR,AOUTRTBL    OUTPUT TABLE IF ANY              @VA01054 00402400
         LTR   XR,XR          IS THERE ONE?                    @VA01054 00402450
         BZ    NOTABLE        NO, SKIP IT                      @VA01054 00402500
         LA    SUM,32(SUM)    ACCOUNT FOR IT                   @VA01054 00402550
NOTABLE  DS    0H                                              @VA01054 00402600
*                                                                       00403020
* Account for any Nucleus Extension storage not released at    HRC404DS 00403040
* end of command.                                              HRC404DS 00403060
         LA    R15,NUCXCBLK       Point to NUCEXT chain        HRC404DS 00403080
NUCXNXT  DS    0H                                              HRC404DS 00403100
         ICM   R15,B'1111',SCBFWPTR-SCBLOCK(R15) Next SCBLOCK  HRC404DS 00403120
         BZ    NUCXDONE                                        HRC404DS 00403140
         ICM   R14,B'1111',SCBXORG-SCBLOCK(R15) Is it loaded?  HRC424DS 00403145
         BZ    NUCXNXT            If not, skip to next         HRC424DS 00403150
         LA    R14,7                                           HRC404DS 00403160
         A     R14,SCBXLEN-SCBLOCK(,R15) Add in any storage    HRC404DS 00403180
         SRL   R14,3              Amount in dwords             HRC404DS 00403200
         AR    SUM,R14                                         HRC404DS 00403220
         B     NUCXNXT            On to next block             HRC404DS 00403240
NUCXDONE DS    0H                                              HRC404DS 00403260
*                                                              HRC404DS 00403280
* Account for any Nucleus Extension storage on the cache       HRC404DS 00403300
         ICM   R15,B'1111',NUCXCBEE  Point to NUCEXT cache     HRC404DS 00403320
         BZ    *+8                                             HRC404DS 00403340
         A     SUM,=A(4096/8)     It is one page               HRC404DS 00403360
*                                                              HRC404DS 00403380
         A     SUM,NUCXFRES       Account for any workareas    HRC404DS 00403400
* FOR EACH ACTIVE DISK, WE COMPUTE THE SPACE ALLOCATED BY THE           00404000
* USER FILE DIRECTORY FOR THE DISK.                                     00405000
         SR    ADR,ADR                 NO ADT YET                       00406000
         SPACE 1                                                        00406100
*        ADD SIZE OF DMSROS IF IT IS IN CORE                            00406200
         AH    SUM,LDMSROS    ADD DMSROS NUCLEUS CORE          @V201122 00406300
         TM    DCSSFLAG,DCSSVTLD   IS SVT MODULE LOADED ?      @VM03047 00406320
         BZ    CDTRANS        NO, SEE IF DOS TRANS. AREA IS.   @VM03047 00406340
         A     R6,OSMODLDW        ADD LENGTH OF OS SIM         @VA05055 00406370
CDTRANS  ICM   R1,15,DOSTRANS IS DOS TRANS. AREA ACTIVE ?      @VM03047 00406380
         BZ    CADTL          NO, JUST KEEP ON GOING           @V305101 00406400
         LA    R1,CON175          $$B (LTA) SIZE               @VA09234 00406450
         AR    SUM,R1         ADD LENGTH OF $$B-TRANS AREA     @V305101 00406500
         EJECT                                                 @VA13114 00407000
* COME BACK HERE TO FIND NEXT ELEMENT OF ACTIVE DISK TABLE.             00408000
CADTL    EQU   *                                                        00409000
         LR    R1,ADR                  POINT TO PREVIOUS ADT            00410000
         L     R15,=V(DMSLADN)         POINT TO ADTNXT ROUTINE          00411000
         BALR  R14,R15                 CALL ADTNXT                      00412000
         LTR   R15,R15                 ANY ADT FOUND?                   00413000
         BNZ   CADTE                   GO IF NOT                        00414000
         LR    ADR,R1                  SAVE POINTER TO ADT              00415000
         BAL   RR,UFDSIZE              CALL ROUTINE TO COMPUTE SIZE    *00416000
                                       OF USER FILE DIRECTORY FOR DISK  00417000
         B     CADTL                                                    00418000
         SPACE                                                          00419000
CADTE    EQU   *                                                        00420000
         SPACE 1                                               @VA11938 00421000
* COME HERE TO CHECK IF THE DEFAULT LOADER TABLES HAVE CHANGED.@VA11938 00421040
* IF THEY HAVE,  THE STORAGE OCCUPIED BY THEM SHOULD BE TAKEN  @VA11938 00421080
* INTO CONSIDERATION.                                          @VA11938 00421120
         SPACE 1                                               @VA11938 00421160
         CLC   ALDRTBLS+1(3),VMSIZE+1  ARE WE AT THE TOP.?     @VA13114 00421200
         BE    DOCALOC                 NOTHING TO DO,GOTO FREE @VA11938 00421320
         L     XR,F8192                ASSUME 2 PAGES OF TABLES@VA11938 00421360
         L     R1,VMSIZE               GET VMSIZE IN BYTES     @VA11938 00421400
         C     R1,MINSIZE              IS IT A "LARGE MACHINE"?@VA11938 00421440
         BNH   JUST2                   IF NOT WE HAD 2 PAGES   @VA11938 00421480
         AH    XR,H4096                ELSE WE HAD 3 AT IPL    @VA11938 00421520
JUST2    DS    0H                                              @VA11938 00421560
         SR    R1,R1                   CLEAR A REGISTER,       @VA11938 00421600
         IC    R1,ALDRTBLS             GET CURRENT NO. OF TABLS@VA11938 00421640
         SLL   R1,12                   TIMES X'1000' FOR PAGES @VA11938 00421680
         AR    R1,XR                   GET TOTAL NO.TO SUBTRACT@VA11938 00421720
         SRL   R1,3                    INTO DOUBLEWORDS        @VA11938 00421760
         AR    SUM,R1                  ACCOUNT FOR IT          @VA11938 00421800
         EJECT                                                 @VA11938 00421840
*                                                              @VA11938 00421880
* AT THIS POINT, REGISTER SUM CONTAINS THE AMOUNT OF FREE STORAGE       00422000
* THAT SHOULD BE ALLOCATED.                                             00423000
* WE NOW FIND OUT HOW MUCH REALLY IS ALLOCATED.                         00424000
*                                                              @VA11938 00424300
DOCALOC  DS    0H                                              @VA11938 00424600
         DMSFRES CALOC,TYPCALL=BALR    COMPUTE SIZE OF ALLOCATED       *00425000
                                       STORAGE                          00426000
         SPACE                                                          00427000
* DMSFRE HAS RETURNED IN REG 0 THE NUMBER OF DOUBLEWORDS OF FREE        00428000
* STORAGE WHICH ARE CURRENTLY ALLOCATED, NOT INCLUDING THE SPACE        00429000
* USED BY SSTAT, OR BY FREETAB (USED BY DMSFRE).                        00430000
         SPACE                                                          00431000
* THE TENSION IS RISING.                                                00432000
         SPACE                                                          00433000
         CR    R0,SUM                  COMPARE THE TWO NUMBERS.         00434000
         SPACE                                                          00435000
* ARE YOU HOLDING YOUR BREATH?                                          00436000
         SPACE                                                          00437000
         BE    FEND                                               V0512 00438100
         BL    FDIE                    DISASTER                         00439000
         BH    FWARN                   BAD, BUT NO DISASTER             00440000
         SPACE                                                          00441000
FDIE     EQU   *                                                        00442000
         SR    SUM,R0                  COMPUTE OVERRUN                  00443000
         DMSERR NUM=149,LET=T,HALT=YES,TYPCALL=BALR,                   *00444000
               MF=(E,ABNERLST),                                        *00445000
               SUB=(DEC,(SUM),HEX,(SUM)),                              *00446000
               TEXT='........ (HEX ......) DOUBLEWORDS OF SYSTEM STORAG*00447000
               E HAVE BEEN DESTROYED. RE-IPL CMS.'                      00448000
         B     FEND                    IN CASE HE GETS GUTSY            00449000
         SPACE                                                          00450000
FWARN    EQU   *                                                        00451000
         SR    R0,SUM                  GET NUMBER OF LOST DOUBLEWORDS   00452000
         DMSERR NUM=150,LET=W,MF=(E,ABNERLST),TYPCALL=BALR,            *00453000
               SUB=(DEC,(R0),HEX,(R0)),                                *00454000
               TEXT='........ (HEX ......) DOUBLEWORDS OF SYSTEM STORAG*00455000
               E WERE NOT RECOVERED'                                    00456000
         B     FEND                                                     00457000
         SPACE                                                          00458000
         SPACE 5                                                        00462000
FEND     EQU   *                                                        00463000
PGREL    TM      OPTFLAGS,NOPAGREL     CAN WE REL PAGES?       @VA01106 00463100
         BO      BELOW                 NO                      @VA01106 00463200
         TM      MISFLAGS,RELPAGES     YES,SHOULD REL PAGES?   @VA01106 00463300
         BNO     BELOW                 NO                      @VA01106 00463400
         L       R13,FREELOWE          PUT LOWEXT INTO R13     @VA01106 00463500
         SRL     R13,12                                        @VA01106 00463600
         BCTR    R13,0                 DECREMENT R13           @VA01106 00463700
         SLL     R13,12                PUT ZEROS INTO REG      @VA01106 00463800
         L       R4,AUSRAREA           FOR NO, MIN. PAGE       @VA01106 00464000
         DC      X'834D0010'           GO RELEASE PAGES        @VA01106 00464100
         NI      MISFLAGS,255-RELPAGES TURN FLAG OFF AGAIN     @VA01106 00464200
         STRINIT TYPCALL=BALR                                  @VA01106 00464300
BELOW    BAL     RR,KXOK               'KX' IS OK AGAIN        @VA01106 00464400
         TM    BATFLAGS,BATRUN+BATLOAD BATCH TRYING TO RECOVER?@VA05162 00464500
         BC    11,NOTBAT2          NO, CONTINUE AS USUAL...    @VA05162 00464600
         L     R15,ABATABND        GET BATCH ABEND PROC.       @VA05162 00464700
         BALR  R14,R15             GO AND DON'T RETURN...      @VA05162 00464800
NOTBAT2  EQU   *                                               @VA05162 00464900
         L     R15,=V(DMSINTAB)        RETURN TO DMSINT                 00465000
         BR    R15                                                      00466000
* NUCCALL SUBROUTINE -- USED TO CALL A NUCLEUS ROUTINE.                 00468000
NUCCALL  EQU   *                                                        00469000
         ST    RR,ABNRR                SAVE RETURN REG                  00470000
         LA    R13,ABNPAS13            PASS A SAVE AREA                 00471000
         BALR  R14,R15                 CALL NUCLEUS ROUTINE             00472000
         SPACE                                                          00473000
* WE ASSUME NOTHING ABOUT THE CONTENTS OF THE REGISTERS UPON RETURN.    00474000
DMSABNRT EQU   *                                                        00475000
         BALR  R14,0                   ESTABLISH ADDRESSABILITY         00476000
         USING *,R14                                                    00477000
         L     BR,=A(DMSABN)           RE-ESTABLISH USUAL BASE REG      00478000
         DROP  R14                                                      00479000
         L     WR,=V(DMSABW)           POINT TO WORK AREA               00480000
         L     RR,ABNRR                RESTORE RETURN REG               00481000
         BR    RR                                                       00482000
         EJECT                                                          00483000
* NOKX SUBROUTINE -- PREVENT KX FROM INTERRUPTING DMSABN.               00484000
* THIS ROUTINE ALSO CHECKS TO SEE IF DMSABN IS BEING ENTERED AT         00485000
* A CRITICAL TIME.                                                      00486000
NOKX     EQU   *                                                        00487000
         L     XR,AFVS                 POINT TO FVSECT                  00488000
         USING FVSECT,XR                                                00489000
         CLI   UFDBUSY,0               UFD BEING UPDATED?               00490000
         BNE   NOKXX                   DISASTER IF SO                   00491000
         SPACE                                                          00492000
NOKXR    EQU   *                                                        00493000
         OI    UFDBUSY,ABNBIT          TURN ON ABEND IN PROGRESS BIT    00494000
         CLC   ABNPSW+2(2),=X'0222'    IS THIS A KX?                    00495000
         BNE   *+8                     SKIP IF NOT                      00496000
         MVI   KXFLAG,0                IF SO, THEN TURN OFF KX FLAG     00497000
         TM    DOSFLAGS,DOSMODE    DOS ENVIRONMENT ACTIVE?     @V305066 00497100
         BZ    KXCHK          NO                               @V305066 00497200
         OI    DOSFLAGS,DOSMODE+DOSSVC  TURN ON 2 DOS FLAGS    @V305066 00497300
         B     KXCHK                   GO CHECK FOR KX ALREADY          00498000
         SPACE                                                          00499000
NOKXX    EQU   *                                                        00500000
         DMSERR NUM=152,LET=T,DISP=SIO,DIE=YES,TYPCALL=BALR,           *00501000
               MF=(E,ABNERLST),                                        *00502000
               TEXT='SYSTEM ABEND ... CALLED FROM ...... WHILE ''UFDBUS*00503000
               Y'' = ..',                                              *00504000
               SUB=(HEXA,ABNPSW,HEXA,ABNPSW+4,HEX4A,UFDBUSY)            00505000
         B     NOKXR                   IN CASE HE'S GOT GUTS            00506000
         EJECT                                                          00507000
* KXOK SUBROUTINE -- ALLOW KX IF DESIRED.                               00508000
KXOK     EQU   *                                                        00509000
         L     XR,AFVS                 POINT TO FVSECT                  00510000
         USING FVSECT,XR                                                00511000
         NI    UFDBUSY,X'FF'-ABNBIT    TURN OFF BIT                     00512000
         SPACE 4                                                        00513000
* IF A KX IS ENTERED WHILE IN THE ABEND PROCESSING ROUTINE, THEN        00514000
* WE SIMPLY IGNORE IT.                                                  00515000
KXCHK    EQU   *                                                        00516000
         L     XR,AFVS                 POINT TO FVSECT                  00517000
         TM    KXFLAG,KXWANT           HAS A KX BEEN ENTERED?           00518000
         MVI   KXFLAG,0                TURN OFF KX FLAG                 00519000
         BCR   8,RR (BZ 0(RR))         RETURN TO CALLER IF NOT          00520000
         DMSERR NUM=153,LET=W,DISP=SIO,TYPCALL=BALR,                   *00521000
               TEXT='''HX'' DURING ABEND PROCESSING WAS IGNORED'        00522000
         BR    RR                      RETURN TO CALLER                 00523000
         DROP  XR                                                       00524000
         EJECT                                                          00525000
* ATTN SUBROUTINE.  TURN OFF 'KT' FLAG, IF IT IS ON.                    00526000
ATTN     EQU   *                                                        00527000
         LA    R1,ATTNLIST             POINT TO PLIST                   00528000
         L     R15,=V(DMSCAT)          POINT TO ATTN ROUTINE            00529000
         B     NUCCALL                 GO CALL IT                       00530000
         SPACE                                                          00531000
         DS    0F                                                       00532000
ATTNLIST DC    CL8'ATTN',C'LIFO',AL1(2),AL3(ATTNRT)                     00533000
ATTNRT   DC    C'RT'                                                    00534000
         DS    0H                                                       00535000
         EJECT                                                          00536000
* CONWAIT SUBROUTINE -- WAIT FOR ALL TYPEOUT TO FINISH                  00537000
CONWAIT  EQU   *                                                        00538000
         LA    R1,=CL16'CONWAIT CON1'                                   00539000
         L     R15,=V(DMSCWT)          ADDRESS OF CONWAIT ROUTINE       00540000
         B     NUCCALL                 GO CALL IT                       00541000
         EJECT                                                          00542000
AUXCLEAN EQU   *                                               @VA00985 00542075
         LA    R1,AUXCLIST        SET PLIST FOR DMSLADAD       @VA00985 00542150
         L     R15,AUXCLIST                                    @VA01484 00542310
         B     NUCCALL                                         @VA01484 00542320
         DS    0F                                              @VA01484 00542330
AUXCLIST DC    V(DMSLADAD)                                     @VA01484 00542340
         DC    F'0'                                            @VA01484 00542350
         DC    A(-1)                                           @VA01484 00542360
         DC    A(-1)                                           @VA01484 00542370
         EJECT                                                          00542825
* THIS SUBROUTINE IS PASSED AN ADT POINTER IN REGISTER ADR.  IT         00543000
* COMPUTES THE AMOUNT OF FREE STORAGE ALLOCATED TO THE USER FILE        00544000
* DIRECTORY FOR THAT DISK, AND ADDS IT TO REGISTER SUM.                 00545000
* WE IGNORE THE SYSTEM DISK FOR THE PURPOSE OF THIS COMPUTATION.        00546000
         SPACE                                                          00547000
* THE LOGIC OF THIS ROUTINE WAS PATTERNED AFTER THE LOGIC OF THE        00548000
* 'RELEASE' ROUTINE, DMSALU.  IF THE LOGIC OF THAT ROUTINE CHANGES,     00549000
* IT MAY BE NECESSARY TO CHANGE THE LOGIC OF THIS ROUTINE.              00550000
UFDSIZE  EQU   *                                                        00551000
         CLI   ADTM,C'S'               SYSTEM DISK?                     00552000
         BCR   8,RR (BE 0(RR))         DON'T COUNT SYSTEM DISK          00553000
         SPACE 1                                                        00553050
*        ADD SIZE OF ANY OSFST'S                                        00553100
         TM    ADTFLG2,ADTFROS OS ADT?                         @V201122 00553150
         BNO   UFS1           NO, CONTINUE                     @V201122 00553200
         L     R1,OSADTFST    GET POINTER TO OSFST'S           @V201122 00553250
ADOSFSTS LA    R1,0(,R1)      CLEAR HIGH ORDER BYTE            @V201122 00553300
         LTR   R1,R1          IS THIS LAST OSFST               @V201122 00553350
         BZ    UFS1           YES, THEN OUT OF LOOP            @V201122 00553400
         USING OSFST,R1                                        @V201122 00553450
         L     R1,OSFSTNXT    GET ADDRESS OF NEXT OSFST        @V201122 00553500
         LA    SUM,OSFSTLTH(SUM) ADD LENGTH OF OSFST           @V201122 00553550
         B     ADOSFSTS       CHECK IF THIS IS LAST OSFST      @V201122 00553600
         DROP  R1                                              @V201122 00553650
UFS1     EQU   *                                               @V201122 00553700
         SPACE                                                          00554000
         L     R1,ADTFDA               GET ADDRESS OF FIRST HYPERBLOCK  00555000
         LTR   R1,R1                   IS THERE ANY?                    00556000
         BZ    UFS2                    DON'T COUNT IT IF NOT            00557000
         L     R1,4(,R1)               SIZE OF FST TABLES               00558000
         LA    R1,8(,R1)               SIZE OF EXTENSION HYPERBLOCK     00559000
         L     R15,ADTHBCT             NUMBER OF HYPERBLOCKS            00560000
         TM    ADTFLG1,ADTFFSTF        FIRST HYPBLK IN FREE STORAGE?    00561000
         BO    *+6                     SKIP IF SO                       00562000
         BCTR  R15,0                   DON'T COUNT IT IF NOT            00563000
         MR    R14,R1                  R15 CONTAINS NUMBER OF BYTES     00564000
         TM    ADTFLG1,ADTFFSTF        FIRST HYPBLK IN FREE STORAGE?    00565000
         BZ    *+8                     SKIP IF NOT                      00566000
         LA    R15,8(,R15)             ADD 8 MORE BYTES FOR 1ST HYPBLK  00567000
         SRL   R15,3                   CONVERT TO DOUBLEWORDS           00568000
         AR    SUM,R15                 ADD TO SUM                       00569000
         SPACE                                                          00570000
UFS2     EQU   *                                                        00571000
         SPACE                                                          00572000
* ADD SIZE OF OLD MFD, IF ANY                                           00573000
         CLC   ADTMFDA,=F'0'           IS THERE ANY?                    00574000
         BE    *+8                     SKIP IF NOT                      00575000
         A     SUM,ADTMFDN             ADD SIZE IF SO                   00576000
         SPACE                                                          00577000
* IF THIS IS A READ/WRITE DISK, ADD THE SIZES OF THE THE BIT MASK       00578000
* AND QQMASK TABLES.                                                    00579000
         TM    ADTFLG1,ADTFMIN         IS THIS A MIN SIZE ADT?          00580000
         BO    USF3                    SKIP IF SO                       00581000
         CLC   =F'0',ADTMSK            ANY BIT MASK?                    00582000
         BE    *+8                     SKIP IF NOT                      00583000
         A     SUM,ADTPQM3             ADD SIZE IN DWORDS               00584000
         CLC   =F'0',ADTQQM            ANY QQMASK?                      00585000
         BE    USF3                    SKIP IF NOT                      00586000
         TM    ADTFLG1,ADTFQQF         IN FREE STORAGE?                 00587000
         BZ    USF3                    SKIP IF NOT                      00588000
         AH    SUM,=H'25'              ADD SIZE OF QQMASK               00589000
         SPACE                                                          00590000
USF3     EQU   *                                                        00591000
         BR    RR                      RETURN TO CALLER                 00592000
* SAVE LAST CONSOLE MSG LINE IN ABWSECT FOR SUBSEQUENT ANALYSIS@V67CBE4 00592015
* BY IPCS IN THE EVENT A VMDUMP IS SCHEDULED--FIRST BYTE OF    @V67CBE4 00592030
* SAVE AREA IS MSG LENGTH-REMAINDER IS MSG UP TO 95 CHARS      @V67CBE4 00592045
CONSAVE  EQU   *                                               @V67CBE4 00592060
         SR    R6,R6               CLEAR WORKING REGISTER      @V67CBE4 00592075
         TM    CONSTACK,LONGOP   CONSOLE MSG LINE IN LONG BUFR @V67CBE4 00592090
         BO    LONGMSG           YES-HANDLE IT FROM THERE      @V67CBE4 00592105
         ICM   R6,B'0001',CONSTACK+1  SHORT MSG-PICK UP LENGTH @V67CBE4 00592120
         CH    R6,MAXLEN         LENGTH EXCEED MAX ALLOWED     @V67CBE4 00592135
         BNH   EXMOVE1           NO--SO DON'T TRUNCATE         @V67CBE4 00592150
         LH    R6,MAXLEN         YES-TRUNCATE TO MAX ALLOWED   @V67CBE4 00592165
EXMOVE1  EQU   *                                               @V67CBE4 00592180
         STCM  R6,B'0001',ABNCMSG STORE MSG LENGTH IN SAVE FLD @V67CBE4 00592195
         BCT   R6,*+4             DECREMENT FOR EXECUTE MOVE   @V67CBE4 00592210
         EX    R6,MOVESHOR       EXECUTE MOVE INST TO SAVE MSG @V67CBE4 00592225
         B     CONEXIT           NOW LETS EXIT FROM SUBROUTINE @V67CBE4 00592240
* SINCE CONSOLE MSG LINE IS IN LONG MSG BUFFER WE MUST NOW     @V67CBE4 00592255
* LOCATE LAST MSG LINE AND SAVE IT FOR IPCS                    @V67CBE4 00592270
LONGMSG  EQU   *                                               @V67CBE4 00592285
         SR    R7,R7              CLEAR WORKING REGISTER       @V67CBE4 00592300
         ICM   R6,B'0111',CONSTACK+1  GET LONG MSG BUFFER ADDR @V67CBE4 00592315
         ICM   R7,B'0011',CONSTACK+4  GET BUFFER LENGTH        @V67CBE4 00592330
         AR    R7,R6        POINT TO END OF LAST LINE +1 BYTE  @V67CBE4 00592345
         BCT   R7,*+4     DECREMENT POINTER TO END OF LINE CHAR@V67CBE4 00592360
         CLI   0(R7),EOL   TEST IF END OF LINE CHAR            @V67CBE4 00592375
         BNE   CONEXIT     LEAVE(BETTER TO SAVE NOTHING)       @V67CBE4 00592390
         LR    R8,R7              SET SCAN POINTER             @V67CBE4 00592405
EOLSCAN  EQU   *                  SCAN TO BEGINNING OF LINE    @V67CBE4 00592420
         BCT   R8,*+4             DECREMENT SCAN POINTER       @V67CBE4 00592435
         CLI   0(R8),EOL          AT PRECEDING END OF LINE CHAR@V67CBE4 00592450
         BE    GETLEN             YES-SCAN OVER                @V67CBE4 00592465
         CR    R8,R6        MAYBE WE'RE AT START OF LONG BUFFER@V67CBE4 00592480
         BNE   EOLSCAN       IF NOT CONTINUE SCANNING          @V67CBE4 00592495
         BCT   R8,GETLEN   NOW DECREMENT SCAN PTR TO GET LENGTH@V67CBE4 00592510
GETLEN   EQU   *                                               @V67CBE4 00592525
         SR    R7,R8         COMPUTE CONSOLE MSG LINE LENGTH   @V67CBE4 00592540
         LA    R8,1(R8)      GET BEGINNING OF CONSOLE MSG LINE @V67CBE4 00592555
         CH    R7,MAXLEN     EXCEED MAX MSG LINE ALLOWED       @V67CBE4 00592570
         BNH   EXMOVE2       NO-OK TO SAVE FULL LENGTH         @V67CBE4 00592585
         LH    R7,MAXLEN  EXCEEDS MAX-THEREFORE TRUNCATE TO MAX@V67CBE4 00592600
EXMOVE2  EQU   *                                               @V67CBE4 00592615
         STCM  R7,B'0001',ABNCMSG  STORE LENGTH IN SAVE FIELD  @V67CBE4 00592630
         BCT   R7,*+4          DECREMENT FOR EXECUTE MOVE INST @V67CBE4 00592645
         EX    R7,MOVELONG   SAVE LAST CONSOLE MSG LINE        @V67CBE4 00592660
CONEXIT  EQU   *        EXIT FOR CONSOLE MSG SAVE SUBROUTINE   @V67CBE4 00592675
         BR    RR            RETURN TO INTERNAL CALLER         @V67CBE4 00592690
         DS    0H                                              @V67CBE4 00592705
MOVESHOR MVC   ABNCMSG+1(*-*),CONSTACK+2 SAVE SHORT CONSOLE MSG@V67CBE4 00592720
MOVELONG MVC   ABNCMSG+1(*-*),0(R8)  SAVE LONG CONSOLE MSG LINE@V67CBE4 00592735
         DS    0H                                              @V67CBE4 00592750
MAXLEN   DC    H'95'          MAX CONSOLE MSG LINE SAVE LENGTH @V67CBE4 00592765
DUMPPARM DC    C'VMD'         VMDUMP COMMAND PARM              @V67CBE4 00592780
CPPARM   DC    C'CP'                                           @V67CBE4 00592795
EOL      EQU   X'15'          CONSOLE MSG END OF LINE CHAR     @V67CBE4 00592810
LONGOP   EQU   X'10'          MASK FOR LONG MSG INDICATOR      @V67CBE4 00592825
USERKEY  DC    X'E0'               USER STORAGE KEY            @V67CBE4 00592840
X222     EQU   X'0222'            HX ABEND CODE                @VA05051 00593000
H4096    DC    H'4096'        PAGE SIZE AS HALFWORD            @VA11938 00593200
F8192    DC    A(8192)        STANDARD LOADER TABLE ALLOCATION @VA11938*00593400
                              FOR MACHINE LESS THAN 384K       @VA11938 00593600
MINSIZE  DC    A(393216)      MINIMUM CMS MACHINE ... 384K ... @VA11938 00593800
         LTORG                                                          00594000
         DMSABW                                                         00596000
         EJECT                                                          00597000
         NUCON                                                          00598000
         SVCSECT                                                        00599000
         SPACE 1                                                        00599100
         SUBSECT                                                  V0375 00599200
         SVCSAVE                                                        00600000
         SCBLOCK ,                                             HRC404DS 00600100
         IO                                                             00601000
         CMSCB                                                          00602000
         ADT                                                            00603000
         OSFST                                                 @V201122 00603100
         FVS                                                            00604000
         IOSECT                                                         00605000
         END                                                            00606000