DMSALP   START X'0'                                                     00010000
         DS    0D                                                       00020000
         END                                                            00030000