DMP      TITLE 'DMSDMP     (CMS)       VM/370 - RELEASE 6'              00001000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00002000
*.                                                                    * 00003000
*        MODULE NAME:                                                 * 00004000
*              DMSDMP                                                 * 00005000
*                                                                     * 00006000
*        FUNCTION:                                                    * 00007000
*              DMSDMP IS THE SIMULATED $$BDUMP/$$BPDUMP ROUTINE       * 00008000
*              UNDER CMS/DOS.  DMSDMP IS ENTERED WHENEVER A DUMP OR   * 00009000
*              JDUMP MACRO IS ISSUED. DMSPDP IS AN ENTRY POINT FOR    * 00010000
*              PDUMP REQUESTS.  IN BOTH CASES, A 'CP DUMP' COMMAND    * 00011000
*              IS ISSUED DIRECTING THE DUMP TO AN OFFLINE PRINTER.    * 00012000
*                                                                     * 00013000
*        ATTRIBUTES:                                                  * 00014000
*              REENTRANT                                              * 00015000
*              DISCONTIGUOUS SHARED SEGMENT                           * 00016000
*                                                                     * 00017000
*        ENTRY POINTS:                                                * 00018000
*              DMSDMP, DMSPDP                                         * 00019000
*                                                                     * 00020000
*        ENTRY CONDITIONS:                                            * 00021000
*              DMSDMP IS INVOKED IN RESPONSE TO THE ISSUING OF A      * 00022000
*              DUMP/JDUMP MACRO.  AN SVC 2 IS ISSUED FOR $$BDUMP IN   * 00023000
*              THE MACRO EXPANSION.  DMSDMP WILL HANDLE CMS/DOS       * 00024000
*              REQUESTS TO $$BDUMP.  NO SPECIAL ENTRY CONDITIONS ARE  * 00025000
*              ESTABLISHED.  DMSPDP IS INVOKED IN RESPONSE TO THE     * 00026000
*              ISSUING OF A PDUMP MACRO.  AN SVC 2 IS ISSUED FOR      * 00027000
*              $$BPDUMP.  DMSPDP WILL HANDLE CMS/DOS REQUESTS TO      * 00028000
*              $$BPDUMP.  AT ENTRY TO DMSPDP, THE USER'S REGISTER 0   * 00029000
*              POINTS TO THE PDUMP ADDRESSES.                         * 00030000
*                                                                     * 00031000
*        EXIT CONDITIONS:                                             * 00032000
*              DMSPDP - EXIT VIA SVC 11 (RETURN TO PROBLEM PROGRAM    * 00033000
*                       AFTER DUMP IS COMPLETE.                       * 00034000
*                                                                     * 00035000
*              DMSDMP - EXIT VIA SVC 6 (CANCEL).                      * 00036000
*                                                                     * 00037000
*        ERROR MESSAGES ISSUED BY THIS PROGRAM:                       * 00038000
*                                                                     * 00039000
*        DMSDMP020W               INVALID PDUMP ADDRESS 'ADDRESS' -   * 00040000
*                                 NO DUMP OPERATION PERFORMED         * 00041000
*                                                                     * 00042000
*                                 EXPLANATION:  ONE OF THE FOLLOWING  * 00043000
*                                 CONDITIONS OCCURRED WHILE           * 00044000
*                                 PERFORMING A PDUMP REQUEST:         * 00045000
*                                                                     * 00046000
*                                 1.  ADD1/ADD2 NEGATIVE              * 00047000
*                             2.  ADD1 > EOCADR IN BGCOM                00048000
*                                 3.  ADD1 > OR = ADD2                * 00049000
*                                                                     * 00050000
*         CALLS TO OTHER ROUTINES:                                    * 00051000
*              DMSFREB -OBTAIN FREE STORAGE                           * 00052000
*              DIAGNOSE (CODE 8) TO PERFORM PDUMP FUNCTION.           * 00053000
*              DMSERR - ERROR MESSAGE                                 * 00054000
*                                                                     * 00055000
*         EXTERNAL REFERENCES:                                        * 00056000
*              NUCON, REGEQU, BGCOM, DOSAVE                           * 00057000
*                                                                     * 00058000
*         CALLED BY:                                                  * 00059000
*              DMSDMP WILL BE INVOKED IN RESPONSE TO SVC 2 FOR $$BDUMP* 00060000
*              OR $$BJDUMP.  DMSPDP WILL BE INVOKED IN RESPONSE TO    * 00061000
*              SVC 2 FOR $$BPDUMP.                                    * 00062000
*                                                                     * 00063000
*         TABLES AND WORK AREAS:                                      * 00064000
*              PLIST - 'CP DUMP' PLIST                                * 00065000
*              FREE - ACQUIRED FREE STORAGE FOR PURPOSES              * 00066000
*              OF ADDRESSES, SWITCHES AND PLISTS SINCE                * 00067000
*              DMSDMP/DMSPDP IS REENTRANT AND CANNOT MODIFY           * 00068000
*              ITS OWN STORAGE.                                       * 00069000
*                                                                     * 00070000
*         REGISTER USAGE:                                             * 00071000
*              R0 - WORK REGISTER                                     * 00072000
*              R1 - PLIST POINTER, WORK REGISTER                      * 00073000
*              R2 - FREE STORAGE POINTER                              * 00074000
*              R3 - WORK REGISTER                                     * 00075000
*              R4 - WORK REGISTER                                     * 00076000
*              R5 - ADD1                                              * 00077000
*              R6 - BAL RETURN REGISTER                               * 00078000
*              R7 - ADD2                                              * 00079000
*              R8 - NOT USED                                          * 00080000
*              R9 - NOT USED                                          * 00081000
*              R10 - NOT USED                                         * 00082000
*              R11 - NOT USED                                         * 00083000
*              R12 - BASE REGISTER                                    * 00084000
*              R13 - NOT USED                                         * 00085000
*              R14 - NOT USED                                         * 00086000
*              R15 - NOT USED                                         * 00087000
*                                                                     * 00088000
*         OPERATION:                                                  * 00089000
*              DMSDMP PERFORMS THE CP CONSOLE FUNCTION 'DUMP'  AND    * 00090000
*              DUMPS FROM LOCATION 0 TO THE TOP OF VIRTUAL STORAGE.   * 00091000
*              DMSDMP EXITS WITH AN SVC 6 (CANCEL).                   * 00092000
*                                                                     * 00093000
*              DMSPDP FIRST VERIFIES THAT ADD1 AND ADD2 DO NOT VIOLATE* 00094000
*              ANY OF THE RULES FOR ADDRESSES AS OUTLINED ABOVE UNDER * 00095000
*              ERROR MESSAGES.  IF ADD2 > EOCADR IN BGCOM, ONLY       * 00096000
*              STORAGE UP TO EOCADR IS DUMPED.  PDUMP IS ACCOMPLISHED * 00097000
*              VIA DIAGNOSE (CODE 8).  PROCESSING CONTINUES AFTER     * 00098000
*              THE DUMP OPERATION  EXIT IS MADE FROM DMSPDP VIA       * 00099000
*              SVC 11.                                                * 00100000
*                                                                     * 00101000
*                                                                     * 00102000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00103000
         SPACE 2                                                        00104000
DMSDMP   CSECT                                                 @V305066 00105000
         USING FREE,R2        FREE STORAGE ADDRESSABILITY      @V305066 00106000
         DC    CL8'$$BDUMP'                                    @V305066 00107000
         ENTRY DMSPDP                                          @V305066 00108000
         BALR  R12,0          ESTABLISH OWN ADDRESSABILIIY     @V305066 00109000
         USING *,R12                                           @V305066 00110000
         LA    R1,PLIST       PLIST POINTER                    @V305066 00111000
         LA    R3,LEN1        LENGTH OF DUMP PLIST             @V305066 00112000
         DC    X'83130008'    DIAGNOSE FOR DUMP                @V305066 00113000
         SVC   SVC6           CANCEL JOB                       @V305066 00114000
         EJECT                                                          00115000
DMSPDP   EQU   *              ENTRY POINT FOR PDUMP            @V305066 00116000
         USING BGCOM,R3       PART. COMREG ADDRESSABILITY      @V305066 00117000
         USING NUCON,R0                                        @V305066 00118000
         DC    CL8'$$BPDUMP'                                   @V305066 00119000
         BALR  R12,0          ESTABLISH OWN ADDRESSABILIY      @V305066 00120000
         USING *,R12                                           @V305066 00121000
         L     R3,ASYSREF     ADDRESS PART. COMM. REGION       @V305066 00122000
         LR    R4,R0          SAVE POINTER TO PDUMP ADDRESSES  @V305066 00123000
         LA    R0,FOUR        OBTAIN FOUR DOUBLEWORDS          @VA05214 00124000
         DMSFREE DWORDS=(0),TYPE=NUCLEUS,TYPCALL=BALR          @V305066 00125000
         LR    R2,R1          R2 CONTAINS FREE STORAGE POINTER @V305066 00126000
         L     R5,0(R4)       PDUMP ADD1                       @V305066 00127000
         L     R7,4(,R4)      ADD2                             @V305066 00128000
         CR    R5,R7          ADD2 MUST BE > ADD1              @V305066 00129000
         BNL   ERR20W         IF NOT, ERROR                    @V305066 00130000
         LTR   R5,R5          ADD1 MUST NOT BE NEGATIVE        @V305066 00131000
         BM    ERR20W         ERROR IF NEGATIVE                @V305066 00132000
         C     R5,EOCADR      ADD1 > EOCADR IN BGCOM           @V305066 00133000
         BH    ERR20W         YES, NO OPERATION                @V305066 00134000
         BAL   R6,CONVERT     CVT HEX ADD TO ZONED FORMAT      @V305066 00135000
         MVC   ADD1(6),ZONE   ADD1 TO PLIST                    @V305066 00136000
         LTR   R7,R7          ADD2 MUST NOT BE  NEGATIVE       @V305066 00137000
         BM    ERR20W         ERROR, NO OPERATION              @V305066 00138000
         C     R7,EOCADR      ADD2 > EOCADR IN BGCOM           @V305066 00139000
         BH    DUMPPART       YES, ONLY DUMP AS FAR AS PPEND   @V305066 00140000
         LR    R5,R7          ADD2 TO R5                       @V305066 00141000
CVT      BAL   R6,CONVERT     CVT HEX ADD TO ZONED FORMAT      @V305066 00142000
         MVC   ADD2(6),ZONE   ADD2 TO PLIST                    @V305066 00143000
         MVC   FREE(16),PLIST MOVE 'CP DUMP' TO PLIST          @V305066 00144000
         MVI   DASH,HYPHEN    MOVE ADDRESS DELIMITER TO PLIST  @V305066 00145000
         LA    R1,FREE        PLIST POINTER                    @V305066 00146000
         LA    R4,LEN2        LENGTH OF PDUMP PLIST            @V305066 00147000
         DC    X'83140008'    DIAGNOSE FOR PDUMP               @V305066 00148000
RELEASE  LR    R1,R2          FREE STORAGE POINTER             @V305066 00149000
         LA    R0,FOUR                                         @VA05214 00150000
         DMSFRET              DWORDS=(0),LOC=(1),TYPCALL=BALR  @VA05214 00150100
         SVC   SVC11          RETURN TO PROBLEM PROGRAM        @V305066 00151000
DUMPPART L     R5,EOCADR      DUMP AS FAR AS EOCADR            @V305066 00152000
         B     CVT            GO TO CONVERT ADDRESS            @V305066 00153000
CONVERT  ST    R5,WORK        STORE ADDRESS                    @VA05214 00154000
         UNPK  ZONE,WORK+1(4) UNPACK TO ZONED FORMAT           @VA05214 00155000
         TR    ZONE(6),TRTAB-240 CONVERT TO READABLE           @VA05214 00156000
         BR    R6             RETURN TO EXECUTE DUMP REQUEST   @V305066 00157000
         EJECT                                                          00158000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00159000
*                    ERROR MESSAGES                                   * 00160000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00161000
         SPACE 2                                                        00162000
ERR20W   ST    R5,SAVEAD      STORE INVALID ADDRESS            @V305066 00163000
         LA    R5,SAVEAD      POINT TO INVALID ADDRESS         @V305066 00164000
         DMSERR NUM=20,LET=W,SUB=(HEX4A,(R5)),TEXT='INVALID PDUMP ADDRE*00165000
               SS ''........'' - NO DUMP OPERATION PERFORMED'  @V305066 00166000
         B     RELEASE        NO OPERATION, CONTINUE PROCESSING@V305066 00167000
         EJECT                                                          00168000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00169000
*                    CONSTANTS                                        * 00170000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00171000
         SPACE 2                                                        00172000
PLIST    DC    CL8'CP'                                         @V305066 00173000
         DC    CL8'DUMP'                                       @V305066 00174000
         DC    6X'F0'                                          @V305066 00175000
         DC    CL1'-'                                          @V305066 00176000
LEN1     EQU   *-PLIST            LENGTH OF DUMP PLIST         @V305066 00177000
TRTAB    DC    C'0123456789ABCDEF'                             @VA05214 00177500
         EJECT                                                          00178000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00179000
*                                                                     * 00180000
*                             EQUATES                                 * 00181000
*                                                                     * 00182000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00183000
         SPACE 2                                                        00184000
SVC6     EQU   6              SVC 6                            @V305066 00185000
SVC11    EQU   11             SVC 11                           @V305066 00186000
FOUR     EQU   4                                               @VA06180 00187000
HYPHEN   EQU   C'-'           DASH                             @V305066 00188000
EBCDIC   EQU   X'F0'          INSURE PRINTABLE CHARACTER       @V305066 00189000
         EJECT                                                          00190000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00191000
*                    DSECTS                                           * 00192000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00193000
         SPACE 2                                                        00194000
FREE     DSECT                                                 @V305066 00195000
         DS    CL8                                             @V305066 00196000
         DS    CL8                                             @V305066 00197000
ADD1     DS    CL6                                             @V305066 00198000
DASH     DS    CL1                                             @V305066 00199000
ADD2     DS    CL6                                             @V305066 00200000
LEN2     EQU   *-FREE         LENGTH OF PDUMP PLIST            @V305066 00201000
         ORG   FREE                                            @VA05214 00201500
SAVEAD   DS    0F                                              @VA05214 00202000
WORK     DS    CL5                                             @VA05214 00203000
ZONE     DS    CL7                                             @VA05214 00204000
         EJECT                                                          00205000
         NUCON                                                 @V305066 00206000
         EJECT                                                          00207000
         REGEQU                                                @V305066 00208000
         EJECT                                                          00209000
         BGCOM                                                 @V305066 00210000
DMSDMP   CSECT                                                 @V305066 00211000
         LTORG                                                 @V305066 00212000
         ORG   DMSDMP+X'300'                                   @V305066 00213000
         END                                                            00214000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00216000
*.                                                                    * 00217000
*        MODULE NAME:                                                 * 00218000
*              DMSDMP                                                 * 00219000
*                                                                     * 00220000
*        FUNCTION:                                                    * 00221000
*              DMSDMP IS THE SIMULATED $$BDUMP/$$BPDUMP ROUTINE       * 00222000
*              UNDER CMS/DOS.  DMSDMP IS ENTERED WHENEVER A DUMP OR   * 00223000
*              JDUMP MACRO IS ISSUED. DMSPDP IS AN ENTRY POINT FOR    * 00224000
*              PDUMP REQUESTS.  IN BOTH CASES, A 'CP DUMP' COMMAND    * 00225000
*              IS ISSUED DIRECTING THE DUMP TO AN OFFLINE PRINTER.    * 00226000
*                                                                     * 00227000
*        ATTRIBUTES:                                                  * 00228000
*              REENTRANT                                              * 00229000
*              DISCONTIGUOUS SHARED SEGMENT                           * 00230000
*                                                                     * 00231000
*        ENTRY POINTS:                                                * 00232000
*              DMSDMP, DMSPDP                                         * 00233000
*                                                                     * 00234000
*        ENTRY CONDITIONS:                                            * 00235000
*              DMSDMP IS INVOKED IN RESPONSE TO THE ISSUING OF A      * 00236000
*              DUMP/JDUMP MACRO.  AN SVC 2 IS ISSUED FOR $$BDUMP IN   * 00237000
*              THE MACRO EXPANSION.  DMSDMP WILL HANDLE CMS/DOS       * 00238000
*              REQUESTS TO $$BDUMP.  NO SPECIAL ENTRY CONDITIONS ARE  * 00239000
*              ESTABLISHED.  DMSPDP IS INVOKED IN RESPONSE TO THE     * 00240000
*              ISSUING OF A PDUMP MACRO.  AN SVC 2 IS ISSUED FOR      * 00241000
*              $$BPDUMP.  DMSPDP WILL HANDLE CMS/DOS REQUESTS TO      * 00242000
*              $$BPDUMP.  AT ENTRY TO DMSPDP, THE USER'S REGISTER 0   * 00243000
*              POINTS TO THE PDUMP ADDRESSES.                         * 00244000
*                                                                     * 00245000
*        EXIT CONDITIONS:                                             * 00246000
*              DMSPDP - EXIT VIA SVC 11 (RETURN TO PROBLEM PROGRAM    * 00247000
*                       AFTER DUMP IS COMPLETE.                       * 00248000
*                                                                     * 00249000
*              DMSDMP - EXIT VIA SVC 6 (CANCEL).                      * 00250000
*                                                                     * 00251000
*        ERROR MESSAGES ISSUED BY THIS PROGRAM:                       * 00252000
*                                                                     * 00253000
*        DMSDMP020W               INVALID PDUMP ADDRESS 'ADDRESS' -   * 00254000
*                                 NO DUMP OPERATION PERFORMED         * 00255000
*                                                                     * 00256000
*                                 EXPLANATION:  ONE OF THE FOLLOWING  * 00257000
*                                 CONDITIONS OCCURRED WHILE           * 00258000
*                                 PERFORMING A PDUMP REQUEST:         * 00259000
*                                                                     * 00260000
*                                 1.  ADD1/ADD2 NEGATIVE              * 00261000
*                                 2.  ADD1 > PPEND IN BGCOM           * 00262000
*                                 3.  ADD1 > OR = ADD2                * 00263000
*                                                                     * 00264000
*         CALLS TO OTHER ROUTINES:                                    * 00265000
*              DMSFREB -OBTAIN FREE STORAGE                           * 00266000
*              DIAGNOSE (CODE 8) TO PERFORM PDUMP FUNCTION.           * 00267000
*              DMSERR - ERROR MESSAGE                                 * 00268000
*                                                                     * 00269000
*         EXTERNAL REFERENCES:                                        * 00270000
*              NUCON, REGEQU, BGCOM, DOSAVE                           * 00271000
*                                                                     * 00272000
*         CALLED BY:                                                  * 00273000
*              DMSDMP WILL BE INVOKED IN RESPONSE TO SVC 2 FOR $$BDUMP* 00274000
*              OR $$BJDUMP.  DMSPDP WILL BE INVOKED IN RESPONSE TO    * 00275000
*              SVC 2 FOR $$BPDUMP.                                    * 00276000
*                                                                     * 00277000
*         TABLES AND WORK AREAS:                                      * 00278000
*              PLIST - 'CP DUMP' PLIST                                * 00279000
*              FREE - ACQUIRED FREE STORAGE FOR PURPOSES              * 00280000
*              OF ADDRESSES, SWITCHES AND PLISTS SINCE                * 00281000
*              DMSDMP/DMSPDP IS REENTRANT AND CANNOT MODIFY           * 00282000
*              ITS OWN STORAGE.                                       * 00283000
*                                                                     * 00284000
*         REGISTER USAGE:                                             * 00285000
*              R0 - WORK REGISTER                                     * 00286000
*              R1 - PLIST POINTER, WORK REGISTER                      * 00287000
*              R2 - FREE STORAGE POINTER                              * 00288000
*              R3 - WORK REGISTER                                     * 00289000
*              R4 - WORK REGISTER                                     * 00290000
*              R5 - ADD1                                              * 00291000
*              R6 - BAL RETURN REGISTER                               * 00292000
*              R7 - ADD2                                              * 00293000
*              R8 - NOT USED                                          * 00294000
*              R9 - NOT USED                                          * 00295000
*              R10 - NOT USED                                         * 00296000
*              R11 - NOT USED                                         * 00297000
*              R12 - BASE REGISTER                                    * 00298000
*              R13 - NOT USED                                         * 00299000
*              R14 - NOT USED                                         * 00300000
*              R15 - NOT USED                                         * 00301000
*                                                                     * 00302000
*         OPERATION:                                                  * 00303000
*              DMSDMP PERFORMS THE CP CONSOLE FUNCTION 'DUMP'  AND    * 00304000
*              DUMPS FROM LOCATION 0 TO THE TOP OF VIRTUAL STORAGE.   * 00305000
*              DMSDMP EXITS WITH AN SVC 6 (CANCEL).                   * 00306000
*                                                                     * 00307000
*              DMSPDP FIRST VERIFIES THAT ADD1 AND ADD2 DO NOT VIOLATE* 00308000
*              ANY OF THE RULES FOR ADDRESSES AS OUTLINED ABOVE UNDER * 00309000
*              ERROR MESSAGES.  IF ADD2 > PPEND IN BGCOM, ONLY STORAGE* 00310000
*              UP TO PPEND IS DUMPED.  THE PDUMP IS ACCOMPLISHED      * 00311000
*              VIA DIAGNOSE (CODE 8).  PROCESSING CONTINUES AFTER     * 00312000
*              THE DUMP OPERATION  EXIT IS MADE FROM DMSPDP VIA       * 00313000
*              SVC 11.                                                * 00314000
*                                                                     * 00315000
*                                                                     * 00316000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00317000
         SPACE 2                                                        00318000
DMSDMP   CSECT                                                 @V305066 00319000
         USING FREE,R2        FREE STORAGE ADDRESSABILITY      @V305066 00320000
         DC    CL8'$$BDUMP'                                    @V305066 00321000
         ENTRY DMSPDP                                          @V305066 00322000
         BALR  R12,0          ESTABLISH OWN ADDRESSABILIIY     @V305066 00323000
         USING *,R12                                           @V305066 00324000
         LA    R1,PLIST       PLIST POINTER                    @V305066 00325000
         LA    R3,LEN1        LENGTH OF DUMP PLIST             @V305066 00326000
         DC    X'83',X'13',XL2'0008' DIAGNOSE FOR DUMP         @V305066 00327000
         SVC   6              CANCEL JOB                       @V305066 00328000
         EJECT                                                          00329000
DMSPDP   EQU   *              ENTRY POINT FOR PDUMP            @V305066 00330000
         USING BGCOM,R3       PART. COMREG ADDRESSABILITY      @V305066 00331000
         USING NUCON,0                                         @V305066 00332000
         DC    CL8'$$BPDUMP'                                   @V305066 00333000
         BALR  R12,0          ESTABLISH OWN ADDRESSABILIY      @V305066 00334000
         USING *,R12                                           @V305066 00335000
         L     R3,ASYSREF     ADDRESS PART. COMM. REGION       @V305066 00336000
         LR    R4,R0          SAVE POINTER TO PDUMP ADDRESSES  @V305066 00337000
         LA    R0,7           OBTAIN 7 DOUBLEWORDS FREE STOR.  @V305066 00338000
         DMSFREE DWORDS=(0),TYPE=NUCLEUS,TYPCALL=BALR          @V305066 00339000
         LR    R2,R1          R2 CONTAINS FREE STORAGE POINTER @V305066 00340000
         L     R5,0(R4)       PDUMP ADD1                       @V305066 00341000
         L     R7,4(,R4)      ADD2                             @V305066 00342000
         CR    R5,R7          ADD2 MUST BE > ADD1              @V305066 00343000
         BNL   ERR20W         IF NOT, ERROR                    @V305066 00344000
         LTR   R5,R5          ADD1 MUST NOT BE NEGATIVE        @V305066 00345000
         BM    ERR20W         ERROR IF NEGATIVE                @V305066 00346000
         C     R5,PPEND       ADD1 > PPEND IN BGCOM            @V305066 00347000
         BH    ERR20W         YES, NO OPERATION                @V305066 00348000
         BAL   R6,CONVERT     CVT HEX ADD TO ZONED FORMAT      @V305066 00349000
         MVC   ADD1(6),ZONE   ADD1 TO PLIST                    @V305066 00350000
         LTR   R7,R7          ADD2 MUST NOT BE  NEGATIVE       @V305066 00351000
         BM    ERR20W         ERROR, NO OPERATION              @V305066 00352000
         C     R7,PPEND       ADD2 > PPEND                     @V305066 00353000
         BH    DUMPPART       YES, ONLY DUMP AS FAR AS PPEND   @V305066 00354000
         LR    R5,R7          ADD2 TO R5                       @V305066 00355000
CVT      BAL   R6,CONVERT     CVT HEX ADD TO ZONED FORMAT      @V305066 00356000
         MVC   ADD2(6),ZONE   ADD2 TO PLIST                    @V305066 00357000
         MVC   FREE(16),PLIST MOVE 'CP DUMP' TO PLIST          @V305066 00358000
         MVI   DASH,C'-'      MOVE ADDRESS DELIMITER TO PLIST  @V305066 00359000
         LA    R1,FREE        PLIST POINTER                    @V305066 00360000
         LA    R4,LEN2        LENGTH OF PDUMP PLIST            @V305066 00361000
         DC    X'83',X'14',XL2'0008' DIAGNOSE FOR PDUMP        @V305066 00362000
RELEASE  LR    R1,R2          FREE STORAGE POINTER             @V305066 00363000
         DMSFRET DWORDS=7,LOC=(1),TYPCALL=BALR                 @V305066 00364000
         SVC   11             RETURN TO PROBLEM PROGRAM        @V305066 00365000
DUMPPART L     R5,PPEND       DUMP AS FAR AS PPEND             @V305066 00366000
         B     CVT            GO TO CONVERT ADDRESS            @V305066 00367000
CONVERT  CVD   R5,DOUBLE      CVT HEX ADD TO DECIMAL           @V305066 00368000
         UNPK  ZONE(6),DOUBLE+5(3) UNPACK TO ZONED FORMAT      @V305066 00369000
         OI    ZONE+5,X'F0'   MAKE LAST CHARARATER PRINTABLE   @V305066 00370000
         BR    R6             RETURN TO EXECUTE DUMP REQUEST   @V305066 00371000
         EJECT                                                          00372000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00373000
*                    ERROR MESSAGES                                   * 00374000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00375000
         SPACE 2                                                        00376000
ERR20W   ST    R5,SAVEAD      STORE INVALID ADDRESS            @V305066 00377000
         LA    R5,SAVEAD      POINT TO INVALID ADDRESS         @V305066 00378000
         DMSERR NUM=20,LET=W,SUB=(HEX4A,(R5)),TEXT='INVALID PDUMP ADDRE*00379000
               SS ''........'' - NO DUMP OPERATION PERFORMED'  @V305066 00380000
         B     RELEASE        NO OPERATION, CONTINUE           @V305066 00381000
         EJECT                                                          00382000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00383000
*                    CONSTANTS                                        * 00384000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00385000
         SPACE 2                                                        00386000
PLIST    DC    CL8'CP'                                         @V305066 00387000
         DC    CL8'DUMP'                                       @V305066 00388000
         DC    6X'F0'                                          @V305066 00389000
         DC    CL1'-'                                          @V305066 00390000
LEN1     EQU   *-PLIST            LENGTH OF DUMP PLIST         @V305066 00391000
         EJECT                                                          00392000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00393000
*                    DSECTS                                           * 00394000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00395000
         SPACE 2                                                        00396000
FREE     DSECT                                                 @V305066 00397000
         DS    CL8                                             @V305066 00398000
         DS    CL8                                             @V305066 00399000
ADD1     DS    CL6                                             @V305066 00400000
DASH     DS    CL1                                             @V305066 00401000
ADD2     DS    CL6                                             @V305066 00402000
LEN2     EQU   *-FREE         LENGTH OF PDUMP PLIST            @V305066 00403000
DOUBLE   DS    D                                               @V305066 00404000
ZONE     DS    CL6                                             @V305066 00405000
SAVEAD   DS    F                                               @V305066 00406000
         EJECT                                                          00407000
         NUCON                                                 @V305066 00408000
         REGEQU                                                @V305066 00409000
         BGCOM                                                 @V305066 00410000
DMSDMP   CSECT                                                 @V305066 00411000
         LTORG                                                 @V305066 00412000
         ORG   DMSDMP+X'300'                                   @V305066 00413000
         END                                                            00414000