DMSIDE   CSECT                                                          00010000
*.                                                                      00020000
*  Module name -                                                        00030000
*                                                                       00040000
*         DMSIDE                                                        00050000
*                                                                       00060000
*  Function -                                                           00070000
*                                                                       00080000
*         Support the IDENTIFY command from VM/SP in VM/370             00090000
*                                                                       00100000
* Entry condition -                                                     00110000
*                                                                       00120000
* >>-----IDentify--.---------------.------------------------><          00130000
*                  '--| Options |--'                                    00140000
*                                                                       00150000
* Options:                                                              00160000
*                  .-TYPE------------.                                  00170000
* |----------------+-----------------+-----------------------|          00180000
*                  |        .-FIFO-. |                                  00190000
*                  |-STACK--+------+-|                                  00200000
*                  |        '-LIFO-' |                                  00210000
*                  |-FIFO------------|                                  00220000
*                  '-LIFO------------'                                  00230000
*                                                                       00240000
* Exit conditions -                                                     00250000
*                                                                       00260000
*        R15 = 0                                                        00270000
*              24  Invalid option or invalid parameter                  00280000
*.                                                                      00290000
         USING NUCON,0                                                  00300000
DMSIDE   CSECT                                                          00310000
         STM   R14,R12,12(R13)                                          00320000
         LR    R12,R15                                                  00330000
         USING DMSIDE,R12                                               00340000
         LR    R3,R1              Hold plist address                    00350000
*                                                                       00360000
         LA    R0,DMSIDEWL/8      Work area length in dwords            00370000
         DMSFREE DWORDS=(0) TYPE=NUCLEUS TYPCALL=BALR                   00380000
         LR    R11,R1                                                   00390000
         USING DMSIDEWK,R11                                             00400000
         LR    R14,R11            Area                                  00410000
         LA    R15,DMSIDEWL       Length                                00420000
         SR    R1,R1              Pad equals zero                       00430000
         MVCL  R14,R0             Clear the work area                   00440000
*                                                                       00450000
* Scan for any options                                                  00460000
*                                                                       00470000
         CLI   8(R3),X'FF'        Any options?                          00480000
         BE    OPTN050            If not, assume 'TYPE'                 00490000
         LA    R3,8(,R3)          Step past command name                00500000
         CLI   0(R3),C'('         Any options?                          00510000
         BNE   BADARG             Invalid argument at R4                00520000
         LA    R3,8(,R3)          Step past '('                         00530000
*                                                                       00540000
         CLC   0(8,R3),=CL8'TYPE'                                       00550000
         BE    OPTN050            Yes, no stacking                      00560000
         CLC   0(8,R3),=CL8'STACK'                                      00570000
         BNE   OPTN010            If not, check FIFO or LIFO            00580000
         CLI   8(R3),X'FF'        Is STACK the last?                    00590000
         BE    OPTN020            Yes, assume FIFO                      00600000
         LA    R3,8(,R3)          Step over 'STACK'                     00610000
OPTN010  DS    0H                                                       00620000
         CLC   0(8,R3),=CL8'FIFO'                                       00630000
         BE    OPTN020                                                  00640000
         CLC   0(8,R3),=CL8'LIFO'                                       00650000
         BE    OPTN030                                                  00660000
         B     BADOPT                                                   00670000
OPTN020  DS    0H                                                       00680000
         OI    OPTFLAG,OPTFIFO    Remember option                       00690000
         B     OPTN040                                                  00700000
OPTN030  DS    0H                                                       00710000
         OI    OPTFLAG,OPTLIFO    Remember option                       00720000
OPTN040  DS    0H                                                       00730000
         LA    R3,8(,R3)          Step past option name                 00740000
         CLI   0(R3),X'FF'        Any options?                          00750000
         BNE   BADOPT             That's all we expect                  00760000
OPTN050  DS    0H                 End of option processing              00770000
*                                                                       00780000
* Prepare response line                                                 00790000
*                                                                       00800000
         MVI   IDLINE,C' '        Blank it out                          00810000
         MVC   IDLINE+1(IDLINEL-1),IDLINE                               00820000
         MVC   IDAT,=C'AT'                                              00830000
         MVI   NODEID,C'*'        Set tokens in case we do              00840000
         MVC   IDVIA,=C'VIA'                                            00850000
         MVI   RSCSID,C'*'          not have SYSTEM NETID               00860000
*                                                                       00870000
* Fetch our user ID from Diagnose X'00'                                 00880000
*                                                                       00890000
         LA    R2,DIAG0BUF                                              00900000
         LA    R3,DIAG0BFL                                              00910000
         DC    X'83230000'                                              00920000
         MVC   MYUSER(8),USERID   Set it in output line                 00930000
*                                                                       00940000
* Get the current CPUID from a CP QUERY CPUID command                   00950000
*                                                                       00960000
         LA    R4,QCPUID                                                00970000
         LA    R6,QCPUIDL                                               00980000
         LA    R5,CPBUF                                                 00990000
         LA    R7,CPBUFL                                                01000000
         ICM   R6,B'1000',=X'40'                                        01010000
         DC    X'83',X'46',XL2'0008'                                    01020000
*                                                                       01030000
* Try to read the SYSTEM NETID file                                     01040000
*                                                                       01050000
         LA    R6,FSCBNID         Point to FSCB area                    01060000
         MVC   0(FSCBNIDL,R6),FSCBNIDP  Set pattern                     01070000
*                                                                       01080000
READNXT  DS    0H                                                       01090000
         LA    R5,RECBUF                                                01100000
         FSREAD FSCB=(R6),BUFFER=(R5),NOREC=1,BSIZE=80                  01110000
         LTR   R15,R15                                                  01120000
         BNZ   READEOF            Skip if EOF or no file                01130000
*                                                                       01140000
         LA    R1,RECBUF          Pointer to file record                01150000
         LA    R0,80              Length of the record                  01160000
         L     R15,ASCANN         Convert input line                    01170000
         BALR  R14,R15              to a tokenized plist                01180000
         CLC   CPBUF+10(6),0(R1)  Does CPUID match record?              01190000
         BNE   READNXT                                                  01200000
         MVC   NODEID,8(R1)       Set node from NETID file              01210000
         MVC   RSCSID,16(R1)      Set RSCS userID                       01220000
READEOF  DS    0H                                                       01230000
         FSCLOSE FSCB=(R6)                                              01240000
NONETID  DS    0H                                                       01250000
*                                                                       01260000
*  Fetch the date and time info from a QUERY TIME command               01270000
*                                                                       01280000
         LA    R4,QTIM                                                  01290000
         LA    R6,QTIML                                                 01300000
         LA    R5,CPBUF                                                 01310000
         LA    R7,CPBUFL                                                01320000
         A     R6,=XL4'40000000'                                        01330000
         DC    X'83',X'46',XL2'0008'                                    01340000
*                                                                       01350000
         MVC   MYDATE,CPBUF+8     Set DD/MM/YY in output line           01360000
         MVC   MYZONE,CPBUF+17    Set three letter time zone            01370000
*                                                                       01380000
         LA    R4,MYDAY                                                 01390000
         LA    R5,9+1             Length of 'WEDNESDAY '                01400000
         LA    R6,CPBUF+21        Start of day name                     01410000
         MVC   0(1,R4),0(R6)      Copy 1st char of dayname              01420000
DAYLOOP  DS    0H                                                       01430000
         LA    R4,1(,R4)          Step to next                          01440000
         LA    R6,1(,R6)          Step to next                          01450000
         CLI   0(R6),C' '         End found?                            01460000
         BE    DAYDONE                                                  01470000
         MVC   0(1,R4),0(R6)      Copy next char of dayname             01480000
         BCT   R5,DAYLOOP                                               01490000
DAYDONE  DS    0H                                                       01500000
         LA    R6,1(,R6)          Skip blank to date                    01510000
         MVC   MYTIME,0(R6)       Set HH:MM:YY in output line           01520000
*                                                                       01530000
         TM    OPTFLAG,OPTFIFO    Want it stacked FIFO?                 01540000
         BO    STKFIFO                                                  01550000
         TM    OPTFLAG,OPTLIFO    Want it stacked LIFO?                 01560000
         BO    STKLIFO                                                  01570000
*                                 Want it typed.                        01580000
         MVC   WRTERM(WRTERMSZ),WRTERMP Copy in WRTERM pattern          01590000
         LA    R1,IDLINE          Set line address                      01600000
         STCM  R1,B'0111',WRTERMA                                       01610000
         LA    R1,IDLINEL         Set line length                       01620000
         STH   R1,WRTERML                                               01630000
         LA    R1,WRTERM                                                01640000
         SVC   202                                                      01650000
         SR    R15,R15            Zero rc                               01660000
         B     IDEXIT             Go exit                               01670000
*                                                                       01680000
STKFIFO  DS    0H                                                       01690000
         MVC   STACKIT+8(4),=CL8'FIFO'                                  01700000
         B     STKIT                                                    01710000
STKLIFO  DS    0H                                                       01720000
         MVC   STACKIT+8(4),=CL8'LIFO'                                  01730000
STKIT    DS    0H                                                       01740000
         MVC   STACKIT(8),=CL8'ATTN'                                    01750000
         LA    R1,IDLINEL         Set line length                       01760000
         STC   R1,STACKIT+12     Set data address and length            01770000
         LA    R1,IDLINE          Set line address                      01780000
         STCM  R1,B'0111',STACKIT+13                                    01790000
         LA    R1,STACKIT                                               01800000
         SVC   202               Stack the IDENTIFY line                01810000
         DC    AL4(1)                                                   01820000
         B     IDEXIT                                                   01830000
*                                                                       01840000
BADARG   DS    0H                                                       01850000
         MVC   LINEDITL(LINEDISZ),LINEDITP                              01860000
         MVC   OUTBUF,255                                               01870000
         LINEDIT TEXT='DMSIDE070E Invalid parameter ........',         *01880000
               BUFFA=OUTBUF,DISP=TYPE,                                 *01890000
               SUB=(CHARA,((R3),8)),                                   *01900000
               MF=(E,LINEDITL)                                          01910000
         LA    R15,24                                                   01920000
         B     IDEXIT             Go exit                               01930000
BADOPT   DS    0H                                                       01940000
         MVC   LINEDITL(LINEDISZ),LINEDITP                              01950000
         MVC   OUTBUF,255                                               01960000
         LINEDIT TEXT='DMSIDE00EE Invalid option: ........',           *01970000
               BUFFA=OUTBUF,DISP=TYPE,                                 *01980000
               SUB=(CHARA,((R3),8)),                                   *01990000
               MF=(E,LINEDITL)                                          02000000
         LA    R15,24                                                   02010000
         B     IDEXIT             Go exit                               02020000
*                                                                       02030000
IDEXIT   DS    0H                                                       02040000
         LR    R5,R15             Hold the RC                           02050000
         LA    R0,DMSIDEWL/8      Work area length in dwords            02060000
         LR    R1,R11                                                   02070000
         DMSFRET DWORDS=(0),LOC=(1) TYPCALL=BALR                        02080000
*                                                                       02090000
         LR    R15,R5             Restore RC                            02100000
         L     R14,12(R13)                                              02110000
         LM    R0,R12,20(R13)                                           02120000
         BR    R14                Done                                  02130000
*                                                                       02140000
QCPUID   DC    C'QUERY CPUID'                                           02150000
QCPUIDL  EQU   *-QCPUID                                                 02160000
*                                                                       02170000
QTIM     DC    C'QUERY TIME'                                            02180000
QTIML    EQU   *-QTIM                                                   02190000
*                                                                       02200000
WRTERMP  DS    0D                                                       02210000
         DC    CL8'TYPLIN'                                              02220000
         DC    X'01',AL3(*-*)                                           02230000
         DC    C'B',X'00',AL2(*-*)                                      02240000
*                                                                       02250000
LINEDITP LINEDIT MF=L,MAXSUBS=5                                         02260000
LINEDISZ EQU   *-LINEDITP                                               02270000
*                                                                       02280000
FSCBNIDP FSCB   'SYSTEM NETID S2' FSCB work area pattern                02290000
FSCBNIDL EQU    *-FSCBNIDP                                              02300000
*                                                                       02310000
* Work area                                                             02320000
DMSIDEWK DSECT                                                          02330000
FSCBNID  FSCB   'SYSTEM NETID S2'                                       02340000
*                                                                       02350000
*                                                                       02360000
IDLINE   DS    0D                Build IDENTIFY output here             02370000
MYUSER   DS    CL8                                                      02380000
         DS    C                                                        02390000
IDAT     DC    CL2'AT'                                                  02400000
         DS    C                                                        02410000
NODEID   DS    CL8                                                      02420000
         DS    C                                                        02430000
IDVIA    DC    CL3'VIA'                                                 02440000
         DS    C                                                        02450000
RSCSID   DS    CL8                                                      02460000
         DC    C' '                                                     02470000
MYDATE   DS    CL8                                                      02480000
         DC    C' '                                                     02490000
MYTIME   DS    CL8                                                      02500000
         DC    C' '                                                     02510000
MYZONE   DS    CL3                                                      02520000
         DC    C'     '                                                 02530000
MYDAY    DS    CL9                                                      02540000
IDLINEL  EQU   *-IDLINE                                                 02550000
*                                                                       02560000
*                                 Option bits                           02570000
OPTFLAG  DS    X                                                        02580000
OPTFIFO  EQU   X'80'                                                    02590000
OPTLIFO  EQU   X'40'                                                    02600000
*                                                                       02610000
* Storage for various plists                                            02620000
*                                                                       02630000
PLISTBLD DS    0D                                                       02640000
*                                                                       02650000
DIAG0BUF DS    0D                Buffer for DIAG 0                      02660000
OPSYS    DS    CL8                                                      02670000
         DS    CL8                                                      02680000
USERID   DS    CL8                                                      02690000
DIAG0BFL EQU   *-DIAG0BUF                                               02700000
*                                                                       02710000
         ORG   PLISTBLD          Reuse the area above                   02720000
WRTERM   DC    CL8'TYPLIN'       WRTERM plist                           02730000
         DC    X'01'                                                    02740000
WRTERMA  DC    AL3(*-*)                                                 02750000
         DC    C'B',X'00'                                               02760000
WRTERML  DC    AL2(*-*)                                                 02770000
WRTERMSZ EQU   *-WRTERM                                                 02780000
*                                                                       02790000
         ORG   PLISTBLD          Reuse the area above                   02800000
STACKIT  DC    CL8'ATTN'         ATTN plist                             02810000
         DC    CL4'FIFO'                                                02820000
         DC    AL1(0)                                                   02830000
         DC    AL3(*-*)                                                 02840000
         ORG   ,                                                        02850000
LINEDITL LINEDIT MF=L,MAXSUBS=5                                         02860000
         DS    0D                                                       02870000
OUTBUF   DS    CL120              Terminal buffer                       02880000
*                                                                       02890000
RECBUF   DS    CL120              File I/O buffer                       02900000
*                                                                       02910000
CPBUF    DS    CL160              Diagnose 8 buffer                     02920000
CPBUFL   EQU   *-CPBUF                                                  02930000
*                                                                       02940000
         DS    0D                                                       02950000
DMSIDEWL EQU   *-DMSIDEWK          Work area length                     02960000
*                                                                       02970000
         REGEQU ,                                                       02980000
         NUCON                                                          02990000
         END                                                            03000000