LFN      TITLE 'DMSLFN: Sample model for user function package'         00010000
*                                                                       00020000
* Module Name -                                                         00030000
*                                                                       00040000
*        DMSLFN                                                         00050000
*                                                                       00060000
* Function -                                                            00070000
*                                                                       00080000
*        External function library for the REX interpreter              00090000
*                                                                       00100000
* Attributes -                                                          00110000
*                                                                       00120000
*        Serially Reusable, 31 bit addressing supported.                00130000
*        Resides in nucleus free storage as a nucleus                   00140000
*        extension.                                                     00150000
*                                                                       00160000
* Entry points -                                                        00170000
*                                                                       00180000
*        DMSLFN     - Major entry point                                 00190000
*        XXXXXXXX   - Entry point for XXXXXXX function                  00200000
*                                                                       00210000
* Entry Conditions -                                                    00220000
*                                                                       00230000
*        Called via SVC 202, either as a function                       00240000
*        invocation, or as a request to load a function.                00250000
*                                                                       00260000
* On Entry: Enabled for interrupts                                      00270000
*                                                                       00280000
*           For main entry point:                                       00290000
*             R1  = A(CMS standard PLIST)                               00300000
*             R12 = A(Entry Point)                                      00310000
*             R13 = A(Save Area)                                        00320000
*             R14 = Return Address                                      00330000
*             R15 = A(Entry Point)                                      00340000
*                                                                       00350000
*           For all function entry points:                              00360000
*             R0  = A(New function PLIST) iff top byte of R1            00370000
*                                         is X'05'                      00380000
*             R1  = A(Old-form Plist)                                   00390000
*             R12 = A(Entry Point)                                      00400000
*             R13 = A(Save Area)                                        00410000
*             R14 = Return Address                                      00420000
*             R15 = A(Entry Point)                                      00430000
*                                                                       00440000
* Exit Conditions -                                                     00450000
*                                                                       00460000
*           For return to CMS:                                          00470000
*             R15 set to returncode, other registers undefined.         00480000
*                                                                       00490000
*           For return after function call:                             00500000
*             R15 set to returncode, other registers undefined.         00510000
*             Location pointed to by FUNRET of function plist           00520000
*             (6th fullword) has had the address of an EVALBLOK         00530000
*             containing the returned data stored in it.                00540000
*             (of the format: F,Size,Datalen,F,Data)                    00550000
*                                                                       00560000
* Calls to other routines -                                             00570000
*                                                                       00580000
*             NUCEXT   - Called via SVC 202 to NUCXLOAD the             00590000
*                        package and the functions.                     00600000
*                                                                       00610000
* External References -                                                 00620000
*                                                                       00630000
*           NUCON                                                       00640000
*                                                                       00650000
*-------------------------------------------------------------*         00660000
*  Invocation:                                                *         00670000
*                                                             *         00680000
*  'RXLOCFN' is a program which includes a set of functions   *         00690000
*  for use with REX in a VM/SP environment.                   *         00700000
*                                                             *         00710000
*  It should be used as:                                      *         00720000
*                                                             *         00730000
*     RXLOCFN              loads the entire package           *         00740000
*     RXLOCFN  LOAD  name  loads a given function             *         00750000
*     RXLOCFN  RESET       to remove functions (called by     *         00760000
*                          NUCXDROP)                          *         00770000
*                                                             *         00780000
*  All the functions are loaded with prefix 'RX' to act as    *         00790000
*  pseudo built-in functions for REX.                         *         00800000
*-------------------------------------------------------------*         00810000
*  Operation:                                                 *         00820000
*                                                             *         00830000
*  The first request should be a LOAD, error if not.          *         00840000
*  Ensure the function to be loaded is in the table, error    *         00850000
*     if not.                                                 *         00860000
*  Get storage and load this program (not the first part,     *         00870000
*     which is used only once to load the program).           *         00880000
*  Create NUCEXT entry for RXLOCFN , also for specific        *         00890000
*     function if requested.                                  *         00900000
*                                                             *         00910000
*  The second (and following) requests will be processed      *         00920000
*     using the code residing in nucleus storage (this part). *         00930000
*  If LOAD request, verify parameters and set up the entry    *         00940000
*     point as a nucleus extension.  Any errors cause bad     *         00950000
*     return code.                                            *         00960000
*  If RESET request, cancel all nucleus extension entry       *         00970000
*     points for this program.                                *         00980000
         EJECT                                                          00990000
*                                                             *         01000000
*  Specific requests for any of the functions included        *         01010000
*  in this package are handled by the specific entry point    *         01020000
*  as described below:                                        *         01030000
*                                                             *         01040000
*  XXXXXXXX                                                   *         01050000
*    Initialization and verification of PLIST.                *         01060000
*    Verify that requested flag can be handled.               *         01070000
*    Obtain flag setting.                                     *         01080000
*    Branch to common return routine.                         *         01090000
*                                                             *         01100000
*  XXXXXXXX                                                   *         01110000
*    Initialization and verification of PLIST.                *         01120000
*    If no arguments passed, just return the size of the      *         01130000
*       virtual machine.                                      *         01140000
*    Verify passed parameters.                                *         01150000
*    Process the request.                                     *         01160000
*    Branch to common return routine.                         *         01170000
*                                                             *         01180000
*  Common return routine:                                     *         01190000
*    Complete the EVALBLOK and return to the caller.          *         01200000
*                                                             *         01210000
*-------------------------------------------------------------*         01220000
* Return codes from RXLOCFN :                                 *         01230000
*    0  - Execution OK                                        *         01240000
*    1  - RXLOCFN  already ON or function not found           *         01250000
*    4  - Invalid function call or not enough storage         *         01260000
*    also error return codes from NUCEXT                      *         01270000
*-------------------------------------------------------------*         01280000
         EJECT                                                          01290000
*-------------------------------------------------------------*         01300000
* Note:  This module uses a slightly unusual technique for    *         01310000
*        setting and clearing flags.  The equate for each     *         01320000
*        bit in the equate is set to the location of the flag *         01330000
*        byte itself.  This equate is also given a length     *         01340000
*        which is the value of the bit position in the flag   *         01350000
*        byte.  For example, if the following are defined:    *         01360000
*                                                             *         01370000
*            SWITCHES DS    XL1                               *         01380000
*            DISPMSGS EQU   SWITCHES,X'80'                    *         01390000
*                                                             *         01400000
*        then flag DISPMSGS may be turned on by using the     *         01410000
*        instruction:                                         *         01420000
*                                                             *         01430000
*            OI    DISPMSGS,L'DISPMSGS                        *         01440000
*                                                             *         01450000
*        This method avoids the need to know what flag byte   *         01460000
*        a given bit is located in and will eliminate errors  *         01470000
*        caused by turning a bit on/off in the wrong byte.    *         01480000
*                                                             *         01490000
***************************************************************         01500000
DMSLFN   CSECT                                                          01510000
         GBLB  &VMCF              Flag for IUCV or VMCF        UPDTVMCF 01510100
&VMCF    SETB  1                  Use VMCF                     UPDTVMCF 01510200
         USING DMSLFN,R12,R10                                           01524990
         USING DMSLFNWK,R11                                             01530000
         USING NUCON,0                                                  01540000
         LR    R12,R15             Get main base                        01550000
         LA    R10,2048(,R12)                                           01564990
         LA    R10,2048(,R10)      Second base                          01569980
         B     LFNINIT             Function package initialization      01574970
         LTORG ,                                                        01580000
         TITLE 'DMSLFN:  Code in free storage.'                         01590000
*-------------------------------------------------------------*         01600000
* The following code resides in free storage, and is capable  *         01610000
* of replying to LOAD or RESET.                               *         01620000
* A LOAD call results in the identifying of the functions     *         01630000
* passed as parameters following LOAD as entry points in      *         01640000
* RXLOCFN.                                                    *         01650000
* A RESET service call from NUCXDROP will turn the functions  *         01660000
* OFF.  A PURGE service call releases the MSG block queue.    *         01670000
*-------------------------------------------------------------*         01680000
         SPACE 2                                                        01690000
FREEGO   DS    0D                  Force doubleword alignment           01700000
*                                  of free-loaded code.                 01710000
         L     R11,4(,R2)          Work area address from SCBLOCK       01720000
         L     R12,LFNBASE1        Code base reg from workarea          01734990
         L     R10,LFNBASE2                                             01739980
         ST    R14,LFNRETAD        Save return address                  01744970
         CLC   ARG1(8,R1),=CL8'LOAD'   Is this a load?                  01750000
         BE    CHK4ARGS            Yes, check for any arg's             01760000
         CLC   ARG1(8,R1),=CL8'RESET'  Reset ?                          01770000
         BE    DOOFF               Yes, turn off functions              01780000
         LA    R15,4               Assume bad caller plist              01790000
         CLM   R1,B'1000',=X'FF'   Is it an abend call ?                01800000
         BNER  R14                 Br if not - quick quit               01814990
         AIF   (&VMCF).VMCF1                                   UPDTVMCF 01819990
         BAL   R3,IUCVCLR          Clear out IUCV interface             01820000
         AGO   .NDVMCF1                                        UPDTVMCF 01820005
.VMCF1   ANOP                                                  UPDTVMCF 01820010
         BAL   R3,VMCFCLR         Clear out VMCF interface     UPDTVMCF 01820015
.NDVMCF1 ANOP                                                  UPDTVMVF 01820020
         TM    HNDTIMER,L'HNDTIMER Is the handler in place??            01830000
         BZ    FREEGO2             Bif not, no need to unset it         01840000
         NI    HNDTIMER,255-L'HNDTIMER Handler is not in place ..       01850000
         NI    HAVTIMER,255-L'HAVTIMER We have not had an interrupt     01860000
         TTIMER CANCEL             Cancel interval timer                01870000
         SPACE 1                                                        01880000
         LA    R0,L'STIMON         Turn off real timer                  01890000
         LA    R1,STIMON                                                01900000
         DIAG  R1,R0,X'08'                                              01910000
FREEGO2  DS    0H                                                       01920000
         SR    R15,R15             Good return code                     01930000
         B     LFRETURN             .. and return                       01944990
         SPACE 1                                                        01950000
CHK4ARGS DS    0H                                                       01960000
         LA    R15,1               Set possible return code             01970000
         CLI   ARG2(R1),X'FF'      Any arguments passed?                01980000
         BER   R14                 No, error (already loaded)           01990000
         EJECT                                                          02010000
*-------------------------------------------------------------*         02040000
*                                                             *         02050000
* 'LOAD' request.  Check function name against FUNLIST.       *         02060000
*                                                             *         02070000
*  Only turn on the requested (autoload) function.            *         02080000
*-------------------------------------------------------------*         02090000
         LA    R15,NLIST                                                02120000
         MVC   DNLIST(LNLIST),0(R15) Setup pattern plist                02130000
         LR    R3,R1               Save old plist pointer               02140000
         LA    R2,FUNLIST          Start of function table              02159990
         LA    R4,LENTRY           Length of FUNLIST entry              02170000
         LA    R5,EFUNLIST-FUNLIST(,R2) End of function table           02180000
         LA    R15,1               Set error return code                02190000
CHECK1   DS    0H                                                       02200000
         CLC   ARG2(,R3),FUNLNAME(R2) Check against name                02210000
         BE    TURNON              Found - turn function on             02220000
         BXLE  R2,R4,CHECK1        Loop for another check               02230000
         B     LFRETURN            Return with RC = 1                   02244990
         SPACE 2                                                        02250000
TURNON   DS    0H                                                       02260000
         LA    R1,DNLIST           -> PLIST                             02270000
         MVC   DNLNAME,FUNLNAME(R2) Copy startup name                   02280000
* See if function is already a nucleus extension                        02290000
         LNR   R15,R15             -1                                   02300000
         ST    R15,DNLADDR         Query form of NUCEXT plist           02310000
         SVC   CMS202                                                   02320000
         DC    AL4(1)              Fall through if error                02330000
         LTR   R15,R15             Exists?                              02340000
         BZ    LFRETURN            Yes, immediate return                02354990
         SPACE 1                                                        02360000
         L     R6,FUNOFFS(,R2)     Load address offset                  02370000
         ALR   R6,R12              True start address                   02380000
         ST    R6,DNLADDR          Add to startup PSW                   02390000
         ST    R11,DNLUSER         Be sure user word is set             02400000
*   Issue SVC...                                                        02410000
         SVC   CMS202                                                   02420000
         DC    AL4(1)              Ignore errors                        02430000
         B     LFRETURN            Return                               02444990
         EJECT                                                          02450000
***************************************************************         02460000
* RESET call: switch off functions for NUCXDROP               *         02470000
***************************************************************         02480000
DOOFF    DS    0H                                                       02490000
         LA    R15,NLIST                                                02500000
         MVC   DNLIST(LNLIST),0(R15) Setup pattern plist                02510000
         LA    R5,FUNLIST          Start of function table              02529990
         LA    R1,DNLIST           -> PLIST                             02540000
FUNLOOP  DS    0H                                                       02550000
         L     R15,FUNOFFS(R5)     Any more to                 UPDTMAC  02560100
         LTR   R15,R15                to cancel?               UPDTMAC  02560200
         BZ    DORESET             0 = all done ... Get out             02570000
         MVC   DNLNAME(8),FUNLNAME(R5) Copy startup name                02580000
*   Issue SVC...                                                        02590000
         SVC   CMS202                                                   02600000
         DC    AL4(1)              Ignore errors                        02610000
*        (we ignore errors e.g.: function already cancelled)            02620000
         LA    R5,LENTRY(,R5)      -> next item in FUNLIST              02630000
         B     FUNLOOP                                                  02640000
         SPACE 2                                                        02650000
DORESET  DS    0H                                                       02660000
         SPACE 1                                                        02670000
         LA    R0,RECVBUF          HNDINT uses the transient area       02680790
         LA    R1,2048             Save transient area                  02681580
         LR    R3,R1                                                    02682370
         L     R2,=A(X'E000')                                           02683160
         MVCL  R0,R2                                                    02683950
         HNDINT CLR,(PLT1),ERROR=1 Be sure ASCII handler is cleared     02684740
         LA    R2,RECVBUF                                               02685530
         LA    R1,2048                                                  02686320
         LR    R3,R1                                                    02687110
         L     R0,=A(X'E000')                                           02687900
         MVCL  R0,R2               Restore transient area               02688690
         AIF   (&VMCF).VMCF2                                   UPDTVMCF 02688990
         SPACE 1                                                        02690000
         BAL   R3,IUCVCLR          Clear out IUCV interface             02700000
         AGO   .NDVMCF2                                        UPDTVMCF 02700005
.VMCF2   ANOP                                                  UPDTVMCF 02700010
         BAL   R3,VMCFCLR         Clear out VMCF interface     UPDTVMCF 02700015
.NDVMCF2 ANOP                                                  UPDTVMVF 02700020
         TM    HNDTIMER,L'HNDTIMER Is the handler in place??            02710000
         BZ    DORESET2            Bif not, no need to unset it         02720000
         TTIMER CANCEL             Cancel interval timer                02730000
DORESET2 DS    0H                                                       02740000
         AGO   .NOCONS1                                        CONSREMV 02749990
         SPACE 1                                                        02750000
         BAL   R5,CONSFREE         Close all open console paths         02753000
.NOCONS1 ANOP                                                  CONSREMV 02753005
         SPACE 1                                                        02756000
         LA    R15,LFNWKLEN        Account for NUCLEUS type storage     02760000
         L     R0,NUCXFRES            allocated outside of the          02770000
         SLR   R0,R15                    area described in the SCBLOCK  02780000
         ST    R0,NUCXFRES                                              02790000
         SPACE 1                                                        02800000
         LA    R0,LFNWKLEN                                              02810000
         LR    R1,R11                                                   02815000
         DMSFRET DWORDS=(0),LOC=(1)                                     02820000
         SR    R15,R15                                                  02830000
         B     LFRETURN            Return to NUCXDROP                   02844990
         TITLE 'DMSLFN:  $TIMER function code'                          02850000
*-------------------------------------------------------------*         02860000
* The $TIMER function excepts a 'CANCEL' argument to cancel   *         02870000
* a pending timer, or a numeric value of seconds to set in    *         02880000
* the location 80 timer via the STIMER macro.                 *         02890000
* Notification of timer expiration is via the $WAIT('TIMER')  *         02900000
* function.                                                   *         02910000
*-------------------------------------------------------------*         02920000
$TIMER   DS    0H                                                       02930000
         L     R11,4(,R2)          Work area address from SCBLOCK       02940000
         L     R12,LFNBASE1        Code base reg from workarea          02954990
         L     R10,LFNBASE2                                             02959980
         ST    R14,LFNRETAD        Save return address                  02964970
         LR    R13,R0              Get addressability                   02970000
         MVC   SAVEFRET,EFUNRET-EFPLIST(R13)     Return address         02980000
         SPACE 1                                                        02990000
         L     R1,EARGLIST-EFPLIST(,R13) Point to the arg list          03000000
         L     R0,PARM1LEN-PARMBLOK(,R1) 1st argument length            03010000
         L     R1,PARM1ADR-PARMBLOK(,R1) 1st argument address           03020000
         LTR   R0,R0               Argument present??                   03030000
         BNP   LFNRERR             Return 'ERROR' as result             03040000
         SPACE 1                                                        03050000
         LA    R15,6               Check for 6 byte field               03060000
         CR    R0,R15                                                   03070000
         BNE   *+14                If not skip next                     03080000
         CLC   =C'CANCEL',0(R1)    Check argument..                     03090000
         BE    TIMERCAN            Br if '$TIMER'('CANCEL')             03100000
         SPACE 1                                                        03110000
         BAL   R14,REXV650                                              03129990
         BNZ   LFNRERR             Return 'ERROR' as result             03150000
         TM    HNDTIMER,L'HNDTIMER Is the handler in place??            03160000
         BO    LFNRERR             Bif so, timer already set up         03170000
         NI    HAVTIMER,255-L'HAVTIMER We have not had an interrupt     03180000
         LA    R0,100              Convert seconds in R1                03190000
         MR    R0,R0                 to hundredths of seconds in R1     03200000
         ST    R1,INTERVAL                                              03210000
         STIMER REAL,TIMUPGO,BINTVL=INTERVAL                            03220000
         OI    HNDTIMER,L'HNDTIMER Handler is in place ..               03230000
         SPACE 1                                                        03240000
         LA    R0,L'STIMREAL       Turn on a real timer                 03250000
         LA    R1,STIMREAL                                              03260000
         DIAG  R1,R0,X'08'                                              03270000
         SPACE 1                                                        03280000
         B     LFNROK                                                   03290000
         EJECT                                                          03300000
TIMERCAN DS    0H                                                       03310000
         TM    HNDTIMER,L'HNDTIMER Is the handler in place??            03320000
         BZ    LFNROK              Bif not, no need to unset it         03330000
         TTIMER CANCEL             Cancel interval timer                03340000
         NI    HNDTIMER,255-L'HNDTIMER Handler is not in place ..       03350000
         NI    HAVTIMER,255-L'HAVTIMER We have not had an interrupt     03360000
         SPACE 1                                                        03370000
         LA    R0,L'STIMON         Turn off real timer                  03380000
         LA    R1,STIMON                                                03390000
         DIAG  R1,R0,X'08'                                              03400000
         SPACE 1                                                        03410000
         B     LFNROK                                                   03420000
         SPACE 3                                                        03430000
*********************************************************************** 03440000
*                                                                     * 03450000
*        TIMER INTERRUPT HANDLER                                      * 03460000
*                                                                     * 03470000
*********************************************************************** 03480000
$TIMUP   DS    0H                                                       03490000
         STM   R14,R12,12(R13)                                          03500000
         LA    R11,0(,R15)         Clear junk                           03510000
         LA    R15,TIMUPGO-DMSLFNWK                                     03520000
         SR    R11,R15                                                  03530000
         L     R12,LFNBASE1                                             03542990
         L     R10,LFNBASE2                                             03545980
         B     TIMUP                                                    03550000
TIMUPLN  EQU   *-$TIMUP                                                 03560000
TIMUP    DS    0H                                                       03570000
         SPACE 1                                                        03580000
         LA    R0,L'STIMON         Turn off real timer                  03590000
         LA    R1,STIMON                                                03600000
         DIAG  R1,R0,X'08'                                              03610000
         SPACE 1                                                        03620000
         SPKA  0                   Set nucleus key                      03630000
         OI    HAVTIMER,L'HAVTIMER Signal TIMER event completed         03640000
         NI    HNDTIMER,255-L'HNDTIMER Handler is not in place ..       03650000
         OI    MSGIN,X'40'         POST the MSGIN ECB                   03660000
         LM    R14,R12,12(R13)                                          03670000
         SR    R15,R15                                                  03680000
         BR    R14                   and return to CMS                  03690000
         SPACE 2                                                        03700000
STIMREAL DC    C'SET TIMER REAL'                                        03710000
STIMON   DC    C'SET TIMER ON'                                          03720000
         TITLE 'DMSLFN:  $WAIT function code'                           03730000
*-------------------------------------------------------------*         03740000
* The $WAIT function enters a PSW wait state until an event   *         03750000
* awakens the routine.  The caller may wait on  ....          *         03760000
*                                                             *         03770000
*    1) *MSG services events                                  *         03780000
*    2) virtual reader file availability                      *         03790000
*    3) timer events                                          *         03800000
*    4) CONSOLE macro exits                                   *         03805000
*                                                             *         03810000
*-------------------------------------------------------------*         03820000
$WAIT    DS    0H                                                       03830000
         L     R11,4(,R2)          Work area address from SCBLOCK       03840000
         L     R12,LFNBASE1        Code base reg from workarea          03854990
         L     R10,LFNBASE2                                             03859980
         ST    R14,LFNRETAD        Save return address                  03864970
         LR    R13,R0              Get addressability                   03870000
         MVC   SAVEFRET,EFUNRET-EFPLIST(R13)     Return address         03880000
         L     R9,EARGLIST-EFPLIST(,R13) Point to the arg list          03890000
         NI    WAITANY,255-L'WAITANY Clear all wait event flags         03900000
         AGO   .NOCONSX                                        CONSREMV 03902990
         LA    R6,CNPTHQUE-(CNPTHNXT-CNPTH) Point to CONSOLE paths      03903000
         USING CNPTH,R6                                                 03906000
.NOCONSX ANOP                                                  CONSREMV 03906005
$WAIT1   DS    0H                                                       03910000
         L     R0,4(,R9)           Get next argument length             03920000
         LTR   R0,R0                                                    03930000
         BZ    $WAIT3              Bif zero length - ignore it          03940000
         BNP   $WAIT4              Bif negative - end of list           03950000
         L     R1,0(,R9)           Address of argument                  03960000
         SR    R2,R2                                                    03970000
         LA    R3,WAITABLE-3       Point to argument lookup table       03980000
$WAIT2   DS    0H                                                       03990000
         LA    R3,3(R2,R3)         Skip to next table entry             04000000
         ICM   R2,B'0001',1(R3)    Get next length byte                 04010000
         AGO   .NOCONSY                                        CONSREMV 04020000
         BZ    $WAITPTH            Bif not found, check CONSOLE path    04024990
.NOCONSY ANOP                                                  CONSREMV 04024995
         BZ    LFNRERR             Bif zero,argument not found          04025000
         CR    R0,R2               Table length vs argument length      04030000
         BCTR  R2,0                Down by 1                            04040000
         BNE   $WAIT2              Loop if length mismatch              04054990
         CLC   2(*-*,R3),0(R1)                                          04060000
         EX    R2,*-6              Test argument data against table     04070000
         BNE   $WAIT2              Bif argument does not match          04080000
         IC    R2,0(,R3)           Get table flag byte                  04090000
         OI    WAITFLAG,*-*                                             04100000
         EX    R2,*-4              Set appropriate wait flag            04110000
         AGO   .NOCONSZ                                        CONSREMV 04110005
         B     $WAIT3              Step to next argument                04110500
         EJECT                                                          04111000
$WAITPTH DS    0H                                                       04111500
         ICM   R6,B'1111',CNPTHNXT Chain to next list entry             04112000
         L     R2,CNPTHNML         Get next pathname length             04112500
         BZ    LFNRERR             Bif not found, caller's error        04113000
         CR    R0,R2               Path length vs argument length       04113500
         BCTR  R2,0                Down by 1                            04114000
         BNE   $WAITPTH            Loop if length mismatch              04114500
         CLC   CNPTHNAM(*-*),0(R1)                                      04115000
         EX    R2,*-6              Test argument data against pathname  04115500
         BNE   $WAITPTH            Bif argument does not match          04116000
         OI    WAITCONS,L'WAITCONS Show one path was found              04116500
         OI    CNPWAIT,L'CNPWAIT   Mark which path it was               04117000
         DROP  R6                                                       04117500
         SPACE 2                                                        04118000
.NOCONSZ ANOP                                                  CONSREMV 04118005
$WAIT3   DS    0H                                                       04120000
         LA    R9,8(,R9)           Step to next argument                04130000
         B     $WAIT1              and loop                             04140000
$WAIT4   DS    0H                                                       04150000
         TM    WAITANY,L'WAITANY   Check for any argument found         04160000
         BZ    LFNRERR             Bif zero - argument not found        04170000
         EJECT                                                          04180000
         TM    WAITSMSG,L'WAITSMSG If either type of                    04190000
         BO    *+12                   IUCV Wait then be sure            04200000
         TM    WAITMSG,L'WAITMSG         the IUCV handler is            04210000
         BZ    *+8                          set up                      04220000
         AIF   (&VMCF).VMCF3                                   UPDTVMCF 04229990
         BAL   R3,IUCVSET                                               04230000
         AGO   .NDVMCF3                                        UPDTVMCF 04230005
.VMCF3   ANOP                                                  UPDTVMCF 04230010
         BAL   R3,VMCFSET                                      UPDTVMCF 04230015
.NDVMCF3 ANOP                                                  UPDTVMVF 04230020
         SPACE 1                                                        04240000
         BAL   R3,WAITCHEK         Poll the pending queue               04250000
*                                     and WAITECB if nothing there      04260000
         NI    WAITANY,255-L'WAITANY Clear all WAIT flags               04270000
         SSM   MASKENAB            Re-enable                            04280000
         LR    R3,R15              Hold result pointer                  04290000
         TM    HNDLRDR,L'HNDLRDR   Did we set a reader handler??        04300000
         BZ    RDRNOCLR            Skip CLR if not                      04310000
         HNDINT CLR,(RDR1),ERROR=1                                      04320000
         NI    HNDLRDR,255-L'HNDLRDR  Handler is cleared....            04330000
RDRNOCLR DS    0H                                                       04340000
         SR    R0,R0                                                    04350000
         IC    R0,1(,R3)           Length of result                     04360000
         LA    R1,2(,R3)           Address of result                    04370000
         B     LFNRETC             Return character result              04380000
         AIF   (&VMCF).VMCF4                                   UPDTVMCF 04389990
         TITLE 'DMSLFN:  $MSG, $SMSG function code'                     04390000
*-------------------------------------------------------------*         04400000
* The $MSG function retrieves the next available CP MSG or WNG*         04410000
* from a FIFO queue and returns the sender userid and message *         04420000
* text as its explicit result.  If no MSG is in the queue,    *         04430000
* control is returned with a null string as the result.       *         04440000
* However, if 'WAIT' is the first argument to the $MSG        *         04450000
* function, control is not returned until the next MSG        *         04460000
* arrives in the queue.                                       *         04470000
*-------------------------------------------------------------*         04480000
$MSG     DS    0H                                                       04490000
         L     R11,4(,R2)          Work area address from SCBLOCK       04500000
         L     R12,LFNBASE1        Code base reg from workarea          04512990
         L     R10,LFNBASE2                                             04515980
         LA    R6,HAVEMSG          Use MSG queue anchor                 04520000
         OI    WAITMSG,L'WAITMSG   Mark Wait type                       04530000
         B     MSGCOMM             Join common code                     04540000
.VMCF4   ANOP                                                  UPDTVMCF 04540005
         SPACE 1                                                        04554990
*-------------------------------------------------------------*         04560000
* The $SMSG function retrieves the next available CP SMSG     *         04570000
* from a FIFO queue and returns the sender userid and message *         04580000
* text as its explicit result.  If no SMSG is in the queue,   *         04590000
* control is returned with a null string as the result.       *         04600000
* However, if 'WAIT' is the first argument to the $SMSG       *         04610000
* function, control is not returned until the next SMSG       *         04620000
* arrives in the queue.                                       *         04630000
*-------------------------------------------------------------*         04640000
$SMSG    DS    0H                                                       04650000
         L     R11,4(,R2)          Work area address from SCBLOCK       04660000
         L     R12,LFNBASE1        Code base reg from workarea          04672990
         L     R10,LFNBASE2                                             04675980
         OI    WAITSMSG,L'WAITSMSG Mark Wait type                       04680000
         LA    R6,HAVESMSG         Use SMSG queue anchor                04690000
MSGCOMM  DS    0H                                                       04700000
         ST    R14,LFNRETAD        Save return address                  04714990
         BAL   R14,FNINIT          Go initialize                        04720000
         LR    R2,R1               Argument address to R2               04730000
         SPACE 1                                                        04740000
         AIF   (&VMCF).VMCF5                                   UPDTVMCF 04749990
         BAL   R3,IUCVSET          If not setup , go do it now          04750000
         AGO   .NDVMCF5                                        UPDTVMCF 04750005
.VMCF5   ANOP                                                  UPDTVMCF 04750010
         BAL   R3,VMCFSET          If not setup , go do it now UPDTVMCF 04750015
.NDVMCF5 ANOP                                                  UPDTVMVF 04750020
         SSM   MASKDISA                                                 04770000
         CLC   =C'WAIT ',0(R2)     Check argument..                     04780000
         BNE   *+8                 Br if not $SMSG('WAIT')              04790000
         BAL   R3,WAITCHEK         Poll the pending queue               04800000
*                                     and WAITECB if nothing there      04810000
         USING EVALBLOK,R5                                              04830000
         ICM   R5,B'1111',0(R6)    Get queue entry FIFO                 04840000
         BZ    *+10                Skip de-queue if none there          04850000
         MVC   0(4,R6),EVBPAD1     De-queue top element                 04860000
         NI    WAITANY,255-L'WAITANY Clear all WAIT flags               04870000
         SSM   MASKENAB            Re-enable                            04880000
         LTR   R5,R5               Did we get one??                     04890000
         BZ    LFNRNULL            No, return null result               04900000
         XC    EVBPAD1,EVBPAD1                                          04910000
         B     EBLOCK              Yes, return the result               04920000
         DROP  R5                                                       04930000
         AIF   (&VMCF).VMCF6                                   UPDTVMCF 04939990
         TITLE 'DMSLFN:  CMSIUCV path connection routine'               04940000
*-> Establish a connection with CP message services through IUCV.       04950000
*-> Set up CMS IUCV interrupt handler in free storage                   04960000
IUCVSET  DS    0H                                                       04970000
         TM    HNDLIUCV,L'HNDLIUCV IUCV path set up already??           04980000
         BO    IUCVSET1            If so, be sure CP SET correctly      04990000
         SPACE 1                                                        05000000
         LA    R4,IUCVNAME                                              05010000
         LA    R5,CONPEND                                               05020000
         HNDIUCV SET,NAME=(R4),EXIT=(R5),UWORD=(R11), Build HNDIUCV    *05030000
               MF=(L,HNDIUCVL,HLEN)                   parameter list    05040000
         SVC   202                                    execute the list  05050000
         DC    AL4(1)                                                   05060000
         SPACE 1                                                        05070000
         LA    R6,IUCVPLST         Get address of IUCV plist            05080000
         XC    0(40,R6),0(R6)                                           05090000
         USING IPARML,R6           Tell assembler                       05100000
         SPACE 1                                                        05110000
*-> Build the parameter list with the IUCV macro, then connect          05120000
*-> and set up the path's exit                                          05130000
         SPACE 1                                                        05140000
         XC    CONCOMP,CONCOMP                                          05150000
         XC    MSGIN,MSGIN                                              05160000
         LA    R5,STARMSG                                               05170000
         IUCV  CONNECT,PRMLIST=(R6),USERID=(R5),MF=L                    05180000
         SPACE 1                                                        05190000
         LA    R5,MSINTRPT                                              05200000
         CMSIUCV CONNECT,NAME=(R4),PRMLIST=(R6),EXIT=(R5),UWORD=(R11), *05210000
               MF=(L,CMSIUCVL,CLEN)                   parameter list    05220000
         SVC   202                                    execute the list  05230000
         DC    AL4(1)                                                   05240000
         SPACE 1                                                        05250000
         SR    R4,R4                                                    05262990
         ICM   R4,B'0011',IPPATHID Save the path he gives us            05265980
         DROP  R6                                                       05270000
         EJECT                                                          05280000
*-> Wait here for the connection complete                               05290000
         LA    R5,CONCOMP                                               05300000
         WAITECB ECB=(R5),FORMAT=OS,MF=(L,WAITECBL,WLEN)                05310000
         SVC   202                                    execute the list  05320000
         DC    AL4(1)                                                   05330000
         SPACE 1                                                        05340000
         OI    HNDLIUCV,L'HNDLIUCV IUCV path is set up                  05350000
         SPACE 1                                                        05360000
IUCVSET1 DS    0H                                                       05370000
         TM    WAITSMSG,L'WAITSMSG Do we desire SMSG intercept          05380000
         BZ    IUCVSET2            Skip next if not                     05390000
         LA    R0,LCPSETSM         Turn on CP SMSG services             05400000
         LA    R1,CPSETSM                                               05410000
         DIAG  R1,R0,X'08'                                              05420000
IUCVSET2 DS    0H                                                       05430000
         TM    WAITMSG,L'WAITMSG                                        05440000
         BZR   R3                  Return to caller                     05450000
         LA    R0,LCPSETM          Turn on CP MSG services              05460000
         LA    R1,CPSETM                                                05470000
         DIAG  R1,R0,X'08'                                              05480000
         BR    R3                  Return to caller                     05490000
         SPACE 1                                                        05500000
CPSETSM  DC    C'SET SMSG IUCV'                                         05510000
LCPSETSM EQU   *-CPSETSM                                                05520000
CPSETM   DC    C'SET MSG IUCV',X'15',C'SET WNG IUCV'                    05530000
LCPSETM  EQU   *-CPSETM                                                 05540000
         TITLE 'DMSLFN:  CMSIUCV path termination routine'              05550000
IUCVCLR  DS    0H                                                       05560000
         TM    HNDLIUCV,L'HNDLIUCV IUCV path set up already??           05570000
         BZR   R3                  If not, just return                  05580000
         SPACE 1                                                        05590000
         LA    R0,LCPCLRSM         Turn off CP *MSG services            05600000
         LA    R1,CPCLRSM                                               05610000
         DIAG  R1,R0,X'08'                                              05620000
         SPACE 1                                                        05630000
         LA    R6,IUCVPLST         Get address of IUCV plist            05640000
         XC    0(40,R6),0(R6)                                           05650000
         USING IPARML,R6           Tell assembler                       05660000
         SPACE 1                                                        05670000
         IUCV  SEVER,PRMLIST=(R6),PATHID=(R4),MF=L                      05689990
         SPACE 1                                                        05700000
         LA    R4,IUCVNAME                                              05710000
         CMSIUCV SEVER,NAME=(R4),PRMLIST=(R6),CODE=ONE,                *05720000
               MF=(L,CMSIUCVL)                        Parameter list    05730000
         SVC   202                                    execute the list  05740000
         DC    AL4(1)                                                   05750000
         EJECT                                                          05760000
         HNDIUCV CLR,NAME=(R4),MF=(L,HNDIUCVL)        Build parm list   05770000
         SVC   202                                    execute the list  05780000
         DC    AL4(1)                                                   05790000
         DROP  R6                                                       05800000
*                                  Ready to fret the message queue      05810000
         ICM   R5,B'1111',HAVESMSG Point to first entry                 05820000
         BZ    *+12                None, skip it                        05830000
         BAL   R4,QUERESET         Go reset the queue                   05840000
         ST    R5,HAVESMSG         Clear anchor                         05850000
         SPACE 1                                                        05860000
         ICM   R5,B'1111',HAVEMSG  Point to first entry                 05870000
         BZ    *+12                None, skip it                        05880000
         BAL   R4,QUERESET         Go reset the queue                   05890000
         ST    R5,HAVEMSG          Clear anchor                         05900000
         NI    HNDLIUCV,255-L'HNDLIUCV IUCV path cleared                05910000
         BR    R3                  Return to caller                     05920000
         SPACE 2                                                        05930000
         USING EVALBLOK,R5         Ready to fret the message queue      05940000
QUERESET DS    0H                                                       05950000
         LTR   R1,R5               Any more left??                      05960000
         BZR   R4                  No , return to caller                05970000
         L     R0,EVSIZE           Total block size (DW's)              05980000
         L     R5,EVBPAD1          Chain to next                        05990000
         DMSFRET DWORDS=(0),LOC=(1)                                     06000000
         B     QUERESET                                                 06010000
         DROP  R5                                                       06020000
CPCLRSM  DC    C'SET SMSG OFF',X'15',C'SET MSG ON',X'15',C'SET WNG ON'  06030000
LCPCLRSM EQU   *-CPCLRSM                                                06040000
         TITLE 'DMSLFN:  CMSIUCV interrupt handler'                     06050000
* This is our external interrupt exit for the path we've set up         06060000
* between ourself and *MSG                                              06070000
* For Connection Complete - Post the CONCOMP ECB and return             06080000
* For Incoming Message    - Receive the msg, Post MSGIN ECB, and return 06090000
         SPACE 2                                                        06100000
MSINTRPT DS    0H                                                       06110000
         LR    R11,R0              Work area address from UWORD         06120000
         L     R12,LFNBASE1        Code base reg from workarea          06132990
         L     R10,LFNBASE2                                             06135980
         USING IPARML,R2           R2 points to ext. int. buffer        06140000
         CLI   IPTYPE,X'02'        Is it connection complete??          06150000
         BE    CONNCOMP            If so, it's a special case           06160000
         ST    R14,MSGRETAD        Save return address                  06173990
         SPACE 1                                                        06177980
         LR    R6,R2               Hold Interrupt IPARML address        06181970
         L     R1,IPBFLN1F         Get an EVALBLOK to                   06185960
         BAL   R14,GETEVAL            hold the SMSG buffer contents     06189950
         USING EVALBLOK,R5                                              06193940
         LR    R2,R6                                                    06197930
         MVC   EVLEN(4),IPBFLN1F   Hold IUCV message length             06201920
         L     R3,IPMSGID          Hold IUCV message identifer          06205910
         LH    R4,IPPATHID         Hold IUCV path identifer             06209900
         L     R6,IPTRGCLS         Hold IUCV class                      06213890
         SPACE 1                                                        06220000
         LA    R2,IUCVPLST         Switch to RECEIVE Plist              06249990
         XC    IPARML(L'IUCVPLST),IPARML                                06269980
         IUCV  RECEIVE,PATHID=(R4),PRMLIST=(R2),MSGID=(R3),            *06289970
               TRGCLS=(R6),BUFFER=EVDATA,BUFLEN=(EVLEN,4)               06309960
         EJECT                                                          06340000
         LA    R2,HAVEMSG-(EVBPAD1-EVALBLOK) Use MSG queue anchor       06350000
         LA    R0,4                *MSG class for SMSG entries          06360000
         CR    R0,R6               Was it an SMSG                       06374990
         BNE   NEXTENQ             If not, skip next                    06380000
SMSGENQ  DS    0H                  Here to enqueue complete message     06390000
         LA    R2,HAVESMSG-(EVBPAD1-EVALBLOK) Use SMSG queue anchor     06400000
         SPACE 1                                                        06410000
NEXTENQ  DS    0H                  Here to enqueue complete message     06420000
         LR    R3,R2               Save lagging                         06430000
         ICM   R2,B'1111',EVBPAD1-EVALBLOK(R2) Chain to next            06440000
         BNZ   NEXTENQ             Search for the end                   06450000
         ST    R5,EVBPAD1-EVALBLOK(R3) Chain it on                      06460000
         ST    R2,EVBPAD1          Zero forward pointer                 06470000
         SPACE 1                                                        06480000
         OI    MSGIN,X'40'         POST the MSGIN ECB                   06490000
         L     R14,MSGRETAD        Get return address                   06505990
         BR    R14                   and return to CMS                  06511980
         SPACE 1                                                        06520000
CONNCOMP DS    0H                  Here on connection complete          06530000
         OI    CONCOMP,X'40'       POST the CONCOMP ECB                 06540000
         BR    R14                   and return to CMS                  06550000
         SPACE 1                                                        06560000
CONPEND  DS    0H                  Here on connection pending           06570000
*        This should never occur. Ignore it and return                  06580000
         BR    R14                                                      06590000
         AGO   .NDVMCF6                                        UPDTVMCF 06590005
.VMCF6   ANOP                                                  UPDTVMCF 06590010
         TITLE 'DMSLFN:  CMS VMCF path connection routine'     UPDTVMCF 06590015
*-> Establish a connection with CP SMSG services through VMCF. UPDTVMCF 06590020
*-> Set up CMS VMCF interrupt handler in free storage          UPDTVMCF 06590025
VMCFSET  DS    0H                                              UPDTVMCF 06590030
         TM    HNDLVMCF,L'HNDLVMCF VMCF path set up already??  UPDTVMCF 06590035
         BOR   R3                 If so, return to caller      UPDTVMCF 06590040
*------------------------------------------------------------* UPDTVMCF 06590045
         LA    R0,DIAG0DAT        Diagnose 0 buffer address    UPDTVMCF 06590050
         LA    R1,DIAG0LEN                          length     UPDTVMCF 06590055
         DIAG  R0,R1,X'00'        Fetch our VM Release Info    UPDTVMCF 06590060
*                                                              UPDTVMCF 06590065
* The VM/370 HNDEXT has a restricted design. We need the       UPDTVMCF 06590070
* address of our work area to process the interrupt, but       UPDTVMCF 06590075
* VM/370 does not provide a way to pass it to the exit         UPDTVMCF 06590080
* routine. We use the technique here of having the exit        UPDTVMCF 06590085
* routine be located in the workarea.                          UPDTVMCF 06590090
*                                                              UPDTVMCF 06590095
*        HNDEXT SET,MSINTRPT                                   UPDTVMCF 06590100
*        BAL   1,DMS&SYSNDX.A   0                              UPDTVMCF 06590105
*        DC    CL8'TRAP'        4                              UPDTVMCF 06590110
*        DC    A(&LOC)         12                              UPDTVMCF 06590115
*SYSNDX.A SVC 202               16                             UPDTVMCF 06590120
*        DC    AL4(&ERROR)     18                              UPDTVMCF 06590125
*        BR    R14             22                              UPDTVMCF 06590130
*                                                              UPDTVMCF 06590135
         MVC   MSINTRPT(MSINPATL),MSINTRPP Set code pattern    UPDTVMCF 06590140
         LA    R1,HNDXCALL        Build HNDEXT plist here      UPDTVMCF 06590145
         MVC   0(8,R1),=CL8'TRAP' Set HNDEXT pattern           UPDTVMCF 06590150
         LA    R0,MSINTRPT        Handler routine in workarea  UPDTVMCF 06590155
         ST    R0,8(,R1)          Set routine address          UPDTVMCF 06590160
         SVC   202                Run HNDEXT                   UPDTVMCF 06590165
*                                                              UPDTVMCF 06590170
*        Set CR0 bit 31                                        UPDTVMCF 06590175
*                                                              UPDTVMCF 06590180
         STCTL C0,C0,CR0WORK                                   UPDTVMCF 06590185
         OI    CR0WORK+3,X'01'                                 UPDTVMCF 06590190
         LCTL  C0,C0,CR0WORK                                   UPDTVMCF 06590195
*                                                              UPDTVMCF 06590200
*        Authorize for VMCF SENDX message reception            UPDTVMCF 06590205
*                                                              UPDTVMCF 06590210
         LA    R1,VMCFPLST                                     UPDTVMCF 06590215
         USING VMCPARM,R1                                      UPDTVMCF 06590220
         LA    R15,VMCPLEN*8-1                                 UPDTVMCF 06590225
         XC    0(*-*,R1),0(R1)   Clear it out                  UPDTVMCF 06590230
         EX    R15,*-6                                         UPDTVMCF 06590235
*                                                              UPDTVMCF 06590240
         OI    VMCPFLG1,VMCPSMSG                               UPDTVMCF 06590245
         MVC   VMCPFUNC,=AL2(VMCPAUTH) Authorize VMCF          UPDTVMCF 06590250
         MVC   VMCPUSER,DIAG0DAT+16    My userid               UPDTVMCF 06590255
         LA    R0,VMCMAREA                                     UPDTVMCF 06590260
         ST    R0,VMCPVADA             Message area address    UPDTVMCF 06590265
         LA    R0,SMSGPRML                                     UPDTVMCF 06590270
         ST    R0,VMCPLENA             Message area len        UPDTVMCF 06590275
*                                                              UPDTVMCF 06590280
         DIAG  R1,R2,X'68'        Authorize VMCF               UPDTVMCF 06590285
         LTR   R2,R2                                           UPDTVMCF 06590290
*                                                              UPDTVMCF 06590295
         OI    HNDLVMCF,L'HNDLVMCF VMCF path is set up         UPDTVMCF 06590300
         BR    R3                 Return to caller             UPDTVMCF 06590305
         DROP  R1                                                       06590310
         TITLE 'DMSLFN:  CMS VMCF path termination routine'    UPDTVMCF 06590315
VMCFCLR  DS    0H                                              UPDTVMCF 06590320
         TM    HNDLVMCF,L'HNDLVMCF VMCF path set up already??  UPDTVMCF 06590325
         BZR   R3                 If not, just return          UPDTVMCF 06590330
*                                                              UPDTVMCF 06590335
*        UnAuthorize for VMCF SENDX message reception          UPDTVMCF 06590340
*                                                              UPDTVMCF 06590345
         LA    R1,VMCFPLST                                     UPDTVMCF 06590350
         USING VMCPARM,R1                                      UPDTVMCF 06590355
         LA    R15,VMCPLEN*8-1                                 UPDTVMCF 06590360
         XC    0(*-*,R1),0(R1)   Clear it out                  UPDTVMCF 06590365
         EX    R15,*-6                                         UPDTVMCF 06590370
         MVC   VMCPFUNC,=AL2(VMCPUAUT)  Unauthorize VMCF       UPDTVMCF 06590375
         DIAG  R1,R2,X'68'                                     UPDTVMCF 06590380
         LTR   R2,R2                                           UPDTVMCF 06590385
         DROP  R1                                              UPDTVMCF 06590390
*                                                              UPDTVMCF 06590395
*        Reset CR0 bit 31                                      UPDTVMCF 06590400
*                                                              UPDTVMCF 06590405
         STCTL C0,C0,CR0WORK                                   UPDTVMCF 06590410
         NI    CR0WORK+3,X'FF'-X'01'                           UPDTVMCF 06590415
         LCTL  C0,C0,CR0WORK                                   UPDTVMCF 06590420
*                                                              UPDTVMCF 06590425
*        Remove External Interupt Handler                      UPDTVMCF 06590430
*                                                              UPDTVMCF 06590435
         HNDEXT CLR                                            UPDTVMCF 06590440
*                                                              UPDTVMCF 06590445
*                                  Ready to fret the msg queue UPDTVMCF 06590450
         ICM   R5,B'1111',HAVESMSG Point to first entry        UPDTVMCF 06590455
         BZ    *+12                None, skip it               UPDTVMCF 06590460
         BAL   R4,QUERESET         Go reset the queue          UPDTVMCF 06590465
         ST    R5,HAVESMSG         Clear anchor                UPDTVMCF 06590470
         NI    HNDLVMCF,255-L'HNDLVMCF VMCF path cleared       UPDTVMCF 06590475
         BR    R3                  Return to caller            UPDTVMCF 06590480
*                                                              UPDTVMCF 06590485
         USING EVALBLOK,R5         Ready to fret the msg queue UPDTVMCF 06590490
QUERESET DS    0H                                              UPDTVMCF 06590495
         LTR   R1,R5               Any more left??             UPDTVMCF 06590500
         BZR   R4                  No , return to caller       UPDTVMCF 06590505
         L     R0,EVSIZE           Total block size (DW's)     UPDTVMCF 06590510
         L     R5,EVBPAD1          Chain to next               UPDTVMCF 06590515
         DMSFRET DWORDS=(0),LOC=(1)                            UPDTVMCF 06590520
         B     QUERESET                                        UPDTVMCF 06590525
         DROP  R5                                              UPDTVMCF 06590530
         TITLE 'DMSLFN:  CMS VMCF interrupt handler'           UPDTVMCF 06590535
* This is our external interrupt exit for the SMSG processing  UPDTVMCF 06590540
* Receive the msg, Post MSGIN ECB, and return                  UPDTVMCF 06590545
*                                                              UPDTVMCF 06590550
         USING EXTUAREA,R1                                     UPDTVMCF 06590555
*********************************  Start of code copied to     UPDTVMCF 06590560
*********************************  our Work area               UPDTVMCF 06590565
MSINTRPP DS    0H                                              UPDTVMCF 06590570
         LR    R11,R15                                         UPDTVMCF 06590575
         LA    R15,MSINTRPT-DMSLFNWK                           UPDTVMCF 06590580
         SR    R11,R15             Start of work area          UPDTVMCF 06590585
         L     R12,LFNBASE1        Code base from workarea     UPDTVMCF 06590590
         L     R10,LFNBASE2                                    UPDTVMCF 06590595
         B     MSINTGO             Go to code CSECT            UPDTVMCF 06590600
MSINPATL EQU   *-MSINTRPP                                      UPDTVMCF 06590605
*                                                              UPDTVMCF 06590610
* R13 -> UAREA User area in EXTUSAVE                           UPDTVMCF 06590615
MSINTGO  DS    0H                                              UPDTVMCF 06590620
         CLC   =X'4001',EXTUPSW+2  Is this type X'4001'?       UPDTVMCF 06590625
         BNER  R14                 Ignore if not VMCF          UPDTVMCF 06590630
*                                                              UPDTVMCF 06590635
         ST    R14,MSGRETAD        Save return address         UPDTVMCF 06590640
*                                                              UPDTVMCF 06590645
         LA    R4,VMCMAREA                                     UPDTVMCF 06590650
         USING VMCMHDR,R4                                      UPDTVMCF 06590655
         L     R1,VMCMLENA         Get an EVALBLOK to hold     UPDTVMCF 06590660
         LA    R1,9(,R1)            the sending USERID and     UPDTVMCF 06590665
         BAL   R14,GETEVAL            SMSG buffer contents     UPDTVMCF 06590670
         USING EVALBLOK,R5                                     UPDTVMCF 06590675
         LA    R4,VMCMAREA         Wiped by GETEVAL            UPDTVMCF 06590680
         MVC   EVDATA(8),VMCMUSE   Sending userID              UPDTVMCF 06590685
         MVI   EVDATA+8,C' '                                   UPDTVMCF 06590690
         L     R3,VMCMLENA         Message length              UPDTVMCF 06590695
         BCTR  R3,0                                            UPDTVMCF 06590700
         MVC   EVDATA+9(*-*),VMCMBUF                           UPDTVMCF 06590705
         EX    R3,*-6              Move msg data to EVALBLOK   UPDTVMCF 06590710
         LA    R3,1+1+8(,R3)       Length of user + 1 + msg    UPDTVMCF 06590715
         ST    R3,EVLEN            Set VMCF message length     UPDTVMCF 06590720
*                                                              UPDTVMCF 06590725
SMSGENQ  DS    0H                                              UPDTVMCF 06590730
         LA    R2,HAVESMSG-(EVBPAD1-EVALBLOK) Use SMSG anchor  UPDTVMCF 06590735
*                                                              UPDTVMCF 06590740
NEXTENQ  DS    0H                  Search loop here            UPDTVMCF 06590745
         LR    R3,R2               Save lagging                UPDTVMCF 06590750
         ICM   R2,B'1111',EVBPAD1-EVALBLOK(R2) Chain to next   UPDTVMCF 06590755
         BNZ   NEXTENQ             Search for the end          UPDTVMCF 06590760
*                                                              UPDTVMCF 06590765
         ST    R5,EVBPAD1-EVALBLOK(R3) Chain it on             UPDTVMCF 06590770
         ST    R2,EVBPAD1          Zero forward pointer        UPDTVMCF 06590775
*                                                              UPDTVMCF 06590780
         OI    MSGIN,X'40'         POST the MSGIN ECB          UPDTVMCF 06590785
         L     R14,MSGRETAD        Get return address          UPDTVMCF 06590790
         BR    R14                   and return to CMS         UPDTVMCF 06590795
.NDVMCF6 ANOP                                                  UPDTVMCF 06590800
         TITLE 'DMSLFN:  WAITCHEK - check queues for wait completed'    06600000
*-------------------------------------------------------------*         06610000
* The WAITCHEK routine checks for the completion of events    *         06620000
* from the various interrupt handlers.                        *         06630000
*                                                             *         06640000
*                                                             *         06650000
*                                                             *         06660000
*                                                             *         06670000
*-------------------------------------------------------------*         06680000
WAITCHEK DS    0H                                                       06690000
         AGO   .NOCONSW                                        CONSREMV 06692990
         LA    R6,CNPTHQUE-(CNPTHNXT-CNPTH) Point to CONSOLE paths      06693000
         USING CNPTH,R6                                                 06696000
.NOCONSW ANOP                                                  CONSREMV 06696005
         SSM   MASKDISA           Disable nterrupts                     06700000
         SPACE 1                                                        06710000
         AGO   .NOCONS2                                        CONSREMV 06719990
         TM    WAITCONS,L'WAITCONS Waiting on CONSL type                06721990
         BZ    WAITCHK0           Nope, skip next                       06723980
WAITCNC  DS    0H                                                       06725970
         ICM   R6,B'1111',CNPTHNXT Chain to next list entry             06727960
         BZ    WAITCHK0           None, all paths were checked          06729950
         TM    CNPWAIT,L'CNPWAIT  Is WAIT requested on this path??      06731940
         BZ    WAITCNC            Nope, Check Next Console              06733930
         ICM   R5,B'1111',CNPTHINQ Do we have one already??             06735920
         BZ    WAITCNC            Nope, Check Next Console              06737910
         MVC   CNPTHINQ,EVBPAD1   De-queue top element                  06739900
         NI    WAITANY,255-L'WAITANY Clear all WAIT flags               06741890
         SSM   MASKENAB            Re-enable                            06743880
         XC    EVBPAD1,EVBPAD1                                          06745870
         B     EBLOCK              return the result                    06747860
         SPACE 1                                                        06749850
WAITCHK0 DS    0H                                                       06751840
.NOCONS2 ANOP                                                  CONSREMV 06751845
         TM    WAITIMER,L'WAITIMER Waiting on TIMER type                06753830
         BZ    WAITCHK1           Nope, skip next                       06755820
         TM    HAVTIMER,L'HAVTIMER Has a timer expired??                06757810
         BZ    WAITCHK1           Nope, skip next                       06759800
         LA    R15,WTIMER         Possible response table entry         06761790
         NI    HAVTIMER,255-L'HAVTIMER Reset it                         06763780
         BR    R3                 Return to caller, event completed     06765770
         SPACE 1                                                        06790000
WAITCHK1 DS    0H                                                       06800000
         TM    WAITSMSG,L'WAITSMSG Waiting on SMSG type                 06810000
         BZ    WAITCHK2           Nope, skip next                       06820000
         LA    R15,WSMSG          Possible response table entry         06830000
         LA    R6,HAVESMSG        Use SMSG queue anchor                 06842990
         ICM   R5,B'1111',0(R6)   Do we have one already??              06845980
         BNZR  R3                 Return to caller, event completed     06850000
         SPACE 1                                                        06860000
WAITCHK2 DS    0H                                                       06870000
         AIF   (&VMCF).VMCF7                                   UPDTVMCF 06879990
         TM    WAITMSG,L'WAITMSG  Waiting on MSG type                   06880000
         BZ    WAITCHK3           Nope, skip next                       06890000
         LA    R15,WMSG           Possible response table entry         06900000
         LA    R6,HAVEMSG          Use MSG queue anchor                 06912990
         ICM   R5,B'1111',0(R6)   Do we have one already??              06915980
         BNZR  R3                 Return to caller, event completed     06920000
         EJECT                                                          06930000
WAITCHK3 DS    0H                                                       06940000
.VMCF7   ANOP                                                  UPDTVMCF 06940005
         TM    WAITRDR,L'WAITRDR  Waiting on reader??                   06950000
         BZ    WAITCHK4           Nope, skip next                       06960000
         SPACE 1                                                        06970000
         LA    R0,LINITRDR        'SPOOL 00C HOLD'   'CLOSE 00C'        06980000
         LA    R1,INITRDR                                               06990000
         DIAG  R1,R0,X'08'                                              07000000
         SPACE 1                                                        07010000
         LA    R15,WRDR           Assume that a file is there           07020000
         TIO   X'00C'             Check for a file in the reader        07030000
         BC    2,*-4              Loop while busy                       07040000
         BC    1,*+10             Reader is not operational??           07050000
         BZ    *+6                There is a file in there              07060000
         SR    R15,R15                                                  07070000
         SPACE 1                                                        07080000
         LA    R0,LFREERDR        'CLOSE 00C'  'SPOOL 00C NOHOLD'       07090000
         LA    R1,FREERDR                                               07100000
         DIAG  R1,R0,X'08'                                              07110000
         SPACE 1                                                        07120000
         LTR   R15,R15            Was there a file                      07130000
         BNZR  R3                 Yes, return to caller                 07140000
         B     WAITCHK4                                                 07150000
         SPACE 1                                                        07160000
INITRDR  DC    C'SP C HOLD',X'15',C'CLOSE C'                            07170000
LINITRDR EQU   *-INITRDR                                                07180000
FREERDR  DC    C'CLOSE C',X'15',C'SP C NOH'                             07190000
LFREERDR EQU   *-FREERDR                                                07200000
         EJECT                                                          07210000
WAITCHK4 DS    0H                                                       07220000
         TM    WAITRDR,L'WAITRDR  Do we need a handler                  07230000
         BZ    WAITONIT           Bif not, no need to set it again      07240000
         TM    HNDLRDR,L'HNDLRDR  Is the handler in place??             07250000
         BO    WAITONIT           Bif yes, no need to set it again      07260000
         LA    R1,HNDINTL          Point to MF=L HNDINT area            07270000
         MVC   0(HNDINTLN,R1),RDRPATRN Fill in the list form of macro   07280000
         LA    R0,IORDRGO          Re-locate the                        07290000
         ST    R0,HNDINTA            exit routine address               07300000
         SVC   202                                                      07310000
         DC    AL4(1)                                                   07320000
         OI    HNDLRDR,L'HNDLRDR  Handler is in place...                07330000
WAITONIT DS    0H                                                       07340000
         XC    MSGIN,MSGIN         Clear out ECB                        07350000
         LA    R5,MSGIN                                                 07360000
         AIF   (&VMCF).VMCF8                                   UPDTVMCF 07369990
         WAITECB ECB=(R5),FORMAT=OS,MF=(L,WAITECBL) Build WAIT plist    07370000
         SVC   202                                  execute the list    07380000
         DC    AL4(1)                                                   07390000
.VMCF8   ANOP                                                  UPDTVMCF 07390005
         WAIT  1,ECB=(R5)          Wait for something to do    UPDTVMCF 07390010
         B     WAITCHEK                                                 07400000
         EJECT                                                          07410000
*********************************************************************** 07420000
*                                                                     * 07430000
*      READER I/O INTERRUPT HANDLER                                   * 07440000
*                                                                     * 07450000
*********************************************************************** 07460000
$IORDR   DS    0H                                                       07470000
         LA    R11,0(,R15)         Clear junk                           07480000
         LA    R15,IORDRGO-DMSLFNWK                                     07490000
         SR    R11,R15                                                  07500000
         L     R12,LFNBASE1                                             07512990
         L     R10,LFNBASE2                                             07515980
         B     IORDR                                                    07520000
IORDRLN  EQU   *-$IORDR                                                 07530000
IORDR    DS    0H                                                       07540000
         SPACE 1                                                        07550000
         SR    R15,R15                                                  07560000
         OI    MSGIN,X'40'         POST the MSGIN ECB                   07570000
         BR    R14                   and return to CMS                  07580000
         SPACE 1                                                        07590000
RDRPAT   HNDINT SET,(RDR1,*-*,00C,ASAP),ERROR=1                         07600000
RDRPATRN EQU   RDRPAT+4,28                                              07610000
         TITLE 'DMSLFN:  $TAPE function code'                           08230000
*-------------------------------------------------------------*         08240000
* $TAPE('WRITE',data) writes the second argument data onto    *         08250000
* tape drive 181.  R15 from the TAPEIO is set as the function *         08260000
* result.                                                     *         08270000
*-------------------------------------------------------------*         08280000
$TAPE    DS    0H                                                       08290000
         L     R11,4(,R2)          Work area address from SCBLOCK       08300000
         L     R12,LFNBASE1        Code base reg from workarea          08314990
         L     R10,LFNBASE2                                             08319980
         ST    R14,LFNRETAD        Save return address                  08324970
         BAL   R14,FNINIT          Go initialize                        08330000
         CLC   =C'WRITE ',0(R1)    Check argument..                     08340000
         BNE   LFNRERR             Br if not '$TAPE'('WRITE',...        08350000
         SPACE 1                                                        08360000
*        WRTAPE (R2),(R3),ERROR=1  Write tape - R15 back to caller      08370000
         LA    R1,TWRTPLST                                              08380000
         MVC   0(TWRTPLSL,R1),TWRTPAT                                   08390000
         STCM  R2,B'0111',TWRTADDR                                      08400000
         ST    R3,TWRTLEN                                               08410000
         SVC   202                                                      08420000
         DC    AL4(1)                                                   08430000
         B     LFNRET                                                   08440000
         SPACE 1                                                        08450000
TWRTPAT  DS    0D                                                       08460000
         DC    CL8'TAPEIO'         Handle TAPEIO CMS plist              08470000
         DC    CL8'WRITE'                                               08480000
         DC    CL4'TAP1'                                                08490000
         DC    AL1(0)                                                   08500000
         DC    AL3(*-*)            TAPE buffer address                  08510000
         DC    A(*-*)              TAPE buffer length                   08520000
         DC    F'0'                                                     08530000
         TITLE 'DMSLFN:  $ACGRP function code'                          08540000
*-------------------------------------------------------------*         08550000
* $ACGRP(userid) returns the directory ACIGROUP field for     *         08560000
* 'userid' as its explicit result.                            *         08570000
*-------------------------------------------------------------*         08580000
$ACGRP   DS    0H                                                       08590000
         L     R11,4(,R2)          Work area address from SCBLOCK       08600000
         L     R12,LFNBASE1        Code base reg from workarea          08614990
         L     R10,LFNBASE2                                             08619980
         ST    R14,LFNRETAD        Save return address                  08624970
         BAL   R14,FNINIT          Go initialize                        08630000
         SPACE 1                                                        08640000
* Address a 16 byte parameter list within a single page...              08650000
         LA    R2,DIAGA0           Point to DIAG A0 16 byte buffer      08660000
         LR    R3,R2               "     "  "    "  "  "    "           08670000
         LA    R4,16-1(,R2)        Point to last byte in buffer         08680000
         ICM   R15,B'1111',=X'FFFFF000' Page number mask                08690000
         NR    R3,R15              Isolate page number                  08700000
         NR    R4,R15              "       "    "                       08710000
         CR    R3,R4               Check for buffer within 1 page       08720000
         BE    *+8                 Bif it is...                         08730000
         LA    R2,8(,R2)           Adjust RX to insure containment      08740000
         SPACE 1                                                        08750000
         MVC   0(8,R2),0(R1)       Userid to first doubleword           08760000
         SR    R3,R3               Subcode zero - retrieve ACIGROUP     08770000
         DIAG  R2,R3,X'A0'                                              08780000
         BNZ   LFNRERR             RETURN ERROR AS RESULT               08790000
         LA    R1,8(,R2)           ACIGROUP address                     08800000
         LA    R0,8                         length                      08810000
         B     LFNRETC             Return result                        08820000
         AGO   .NOCONS3                                        CONSREMV 08820020
         TITLE 'DMSLFN: $CONSL interface to the CMS CONSOLE Facility'   08820030
*-------------------------------------------------------------*         08820060
* The $CONSL functions provide an interface between REXX and  *         08820090
* the CMS CONSOLE Facility.                                   *         08820120
*-------------------------------------------------------------*         08820150
$CONSL   DS    0H                                                       08820180
         L     R11,4(,R2)          Work area address from SCBLOCK       08820210
         L     R12,LFNBASE1        Code base reg from workarea          08820240
         L     R10,LFNBASE2                                             08820270
         ST    R14,LFNRETAD        Save return address                  08820300
         BAL   R14,FNINIT          Go initialize                        08820330
         LTR   R3,R3               2nd Argument present??               08820360
         BNP   LFNRERR             Return 'ERROR' as result             08820390
         USING PARMBLOK,R9                                              08820420
         L     R4,PARM3ADR         Third ARGument                       08820450
         L     R5,PARM3LEN           pointers to R4,R5                  08820480
         DROP  R9                                                       08820510
         SPACE 1                                                        08820540
         CLC   =C'CLOSE ',0(R1)    Check argument..                     08820570
         BE    CONSCLOS                                                 08820600
         CLC   =C'QUERY ',0(R1)    Check argument..                     08820630
         BE    CONSQRY                                                  08820660
         CLC   =C'WRITE ',0(R1)    Check argument..                     08820690
         BE    CONSW                                                    08820720
         CLC   =C'EWRITE ',0(R1)   Check argument..                     08820750
         BE    CONSEW                                                   08820780
         CLC   =C'EWA ',0(R1)      Check argument..                     08820810
         BE    CONSEWA                                                  08820840
         CLC   =C'WSF ',0(R1)      Check argument..                     08820870
         BE    CONSWSF                                                  08820900
         CLC   =C'RDMOD ',0(R1)    Check argument..                     08820930
         BE    CRDMOD                                                   08820960
         CLC   =C'RDBUF ',0(R1)    Check argument..                     08820990
         BE    CRDBUF                                                   08821020
         CLC   =C'OPEN ',0(R1)     Check argument..                     08821050
         BNE   LFNRERR             Return 'ERROR' as result             08821080
         EJECT                                                          08821110
         SR    R6,R6               Set default R6                       08821140
         BCTR  R6,0                     X'FFFFFFFF' = VM Console        08821170
         LTR   R0,R5               3rd Argument present??               08821200
         BNP   COPEN               No, use the default of virtual cons  08821230
         LR    R1,R4               Address of Character CUU             08821260
         BAL   R14,REXV600                                              08821290
         BNZ   LFNRERR             Bif conversion error                 08821320
         LR    R6,R1               Device address in binary             08821350
         SPACE 1                                                        08821380
COPEN    DS    0H                                                       08821410
         LA    R4,SENDBUF          CQYSECT data area                    08821440
         LA    R5,CQYSIZE          CQYSECT data length                  08821470
         CONSOLE MF=(E,CONSOLEL),OPEN,PATH=((2),(3)),DEVICE=(6),       *08821500
               EXIT=CONSEGO,UWORD=(6),BUFFER=((4),(5))                  08821530
         C     R15,=F'1'                                                08821560
         BH    LFNRET              Return if code is not 0 or 1         08821590
         LR    R5,R15              Hold return code                     08821620
         SPACE 1                                                        08821650
         LA    R0,CNPTHNAM-CNPTH+7(,R3)                                 08821680
         SRL   R0,3                                                     08821710
         DMSFREE DWORDS=(0),ERR=NOSTORE                                 08821740
         LR    R0,R6               Hold virtual address                 08821770
         LR    R6,R1                                                    08821800
         USING CNPTH,R6                                                 08821830
         XC    CNPTH(CNPTHNAM-CNPTH),CNPTH Clear fixed portion          08821860
         ST    R0,CNPTHVDA         Set CONSOLE virtual address          08821890
         ST    R3,CNPTHNML         Set CONSOLE path name length         08821920
         LA    R0,CNPTHNAM                                              08821950
         LR    R1,R3                                                    08821980
         MVCL  R0,R2               Copy path name to CNPTHNAM area      08822010
         EJECT                                                          08822040
         LA    R2,CNPTHQUE-(CNPTHNXT-CNPTH)       CHAIN                 08822070
COPNENQL DS    0H                                  NEW                  08822100
         ICM   R3,B'1111',CNPTHNXT-CNPTH(R2)        CONWORK             08822130
         BZ    COPNENQ                               IN                 08822160
         CR    R6,R3                                 VIRTUAL            08822190
         BL    COPNENQ                                 ADDRESS          08822220
         LR    R2,R3                                    ORDER           08822250
         B     COPNENQL                                                 08822280
COPNENQ  DS    0H                                                       08822310
         ST    R3,CNPTHNXT                 FORWARD CHAIN                08822340
         ST    R6,CNPTHNXT-CNPTH(,R2)      BACK CHAIN                   08822370
         SPACE 1                                                        08822400
         USING CQYSECT,R4                                               08822430
         LR    R15,R5              OPEN Return code                     08822460
         B     LFNRET              Return result                        08822490
         DROP  R4,R6                                                    08822520
         EJECT                                                          08822550
CRDBUF   DS    0H                                                       08822580
         LTR   R0,R5               3rd Argument present??               08822610
         BNP   LFNRERR             No, return ERROR. Invalid arguments. 08822640
         L     R6,=A(L'RECVBUF)                                         08822670
         CONSOLE MF=(E,CONSOLEL),READ,PATH=((2),(3)),                  *08822700
               BUFFER=(RECVBUF,(6)),OPTIONS=(WAIT,RDBUF)                08822730
         B     CRDCOMMN                                                 08822760
         SPACE 2                                                        08822790
CRDMOD   DS    0H                                                       08822820
         LTR   R0,R5               3rd Argument present??               08822850
         BNP   LFNRERR             No, return ERROR. Invalid arguments. 08822880
         L     R6,=A(L'RECVBUF)                                         08822910
         CONSOLE MF=(E,CONSOLEL),READ,PATH=((2),(3)),                  *08822940
               BUFFER=(RECVBUF,(6)),OPTIONS=(WAIT,RDMOD)                08822970
CRDCOMMN DS    0H                                                       08823000
         LTR   R15,R15                                                  08823030
         BNZ   LFNRET              Return error RC                      08823060
         LR    R2,R4               address of the EXEC variable name    08823090
         LR    R3,R5               length of the EXEC variable name     08823120
         LA    R4,RECVBUF          address of the data buffer           08823150
         LR    R5,R0               length of the data buffer            08823180
         BAL   R14,STORE           Set REXX Variable                    08823210
         SPACE 1                                                        08823240
         B     LFNRET              Return result                        08823270
         EJECT                                                          08823300
CONSW    DS    0H                                                       08823330
         LTR   R0,R5               3rd Argument present??               08823360
         BNP   LFNRERR             Return 'ERROR' as result             08823390
         CONSOLE MF=(E,CONSOLEL),WRITE,PATH=((2),(3)),                 *08823420
               BUFFER=((4),(5)),OPTIONS=(NOCLEAR,W)                     08823450
         SPACE 1                                                        08823480
         B     LFNRET              Return result                        08823510
         SPACE 3                                                        08823540
CONSEW   DS    0H                                                       08823570
         LTR   R0,R5               3rd Argument present??               08823600
         BNP   LFNRERR             Return 'ERROR' as result             08823630
         CONSOLE MF=(E,CONSOLEL),WRITE,PATH=((2),(3)),                 *08823660
               BUFFER=((4),(5)),OPTIONS=(NOCLEAR,EW)                    08823690
*        CONSOLE MF=(E,CONSOLEL),WRITE,PATH=((2),(3)),                 *08823720
               BUFFER=((4),(5)),OPTIONS=(CLEAR,EW)                      08823750
         SPACE 1                                                        08823780
         B     LFNRET              Return result                        08823810
         EJECT                                                          08823840
CONSEWA  DS    0H                                                       08823870
         LTR   R0,R5               3rd Argument present??               08823900
         BNP   LFNRERR             Return 'ERROR' as result             08823930
         CONSOLE MF=(E,CONSOLEL),WRITE,PATH=((2),(3)),                 *08823960
               BUFFER=((4),(5)),OPTIONS=(NOCLEAR,EWA)                   08823990
*        CONSOLE MF=(E,CONSOLEL),WRITE,PATH=((2),(3)),                 *08824020
               BUFFER=((4),(5)),OPTIONS=(CLEAR,EWA)                     08824050
         SPACE 1                                                        08824080
         B     LFNRET              Return result                        08824110
         SPACE 3                                                        08824140
CONSWSF  DS    0H                                                       08824170
         LTR   R0,R5               3rd Argument present??               08824200
         BNP   LFNRERR             Return 'ERROR' as result             08824230
         CONSOLE MF=(E,CONSOLEL),WRITE,PATH=((2),(3)),                 *08824260
               BUFFER=((4),(5)),OPTIONS=(WSF)                           08824290
         SPACE 1                                                        08824320
         B     LFNRET              Return result                        08824350
         EJECT                                                          08824380
CONSCLOS DS    0H                                                       08824410
         CONSOLE MF=(E,CONSOLEL),CLOSE,PATH=((2),(3))                   08824440
         LA    R6,CNPTHQUE-(CNPTHNXT-CNPTH) Search chain for CNPTH      08824470
         USING CNPTH,R6                                                 08824500
CCLSNEXT DS    0H                                                       08824530
         LR    R5,R6               Hold lagging pointer                 08824560
         ICM   R6,B'1111',CNPTHNXT                                      08824590
         BZ    LFNRET              (SHOULD NOT OCCUR)                   08824620
         C     R3,CNPTHNML                                              08824650
         BNE   CCLSNEXT            LOOP TO CHECK NEXT                   08824680
         LR    R1,R3                                                    08824710
         BCTR  R1,0                                                     08824740
         CLC   0(*-*,R2),CNPTHNAM                                       08824770
         EX    R1,*-6                                                   08824800
         BNE   CCLSNEXT            LOOP TO CHECK NEXT                   08824830
         MVC   CNPTHNXT-CNPTH(4,R5),CNPTHNXT  DE-CHAIN                  08824860
         LR    R1,R6                                                    08824890
         LA    R0,CNPTHNAM-CNPTH+7(,R3)                                 08824920
         SRL   R0,3                                                     08824950
         DMSFRET DWORDS=(0),LOC=(1)                                     08824980
         SR    R15,R15                                                  08825010
         B     LFNRET              Return result                        08825040
         EJECT                                                          08825070
CONSFREE DS    0H                  Here to clear all paths              08825100
         ICM   R6,B'1111',CNPTHQUE                                      08825130
         BZR   R5                  Bif no more paths                    08825160
         MVC   CNPTHQUE,CNPTHNXT   Remove list element                  08825190
         L     R3,CNPTHNML                                              08825220
         LA    R2,CNPTHNAM                                              08825250
         CONSOLE MF=(E,CONSOLEL),CLOSE,PATH=((2),(3))                   08825280
         LR    R1,R6                                                    08825310
         LA    R0,CNPTHNAM-CNPTH+7(,R3)                                 08825340
         SRL   R0,3                                                     08825370
         DMSFRET DWORDS=(0),LOC=(1)                                     08825400
         B     CONSFREE                                                 08825430
         DROP  R6                                                       08825460
         EJECT                                                          08825490
CONSQRY  DS    0H                                                       08825520
         LTR   R0,R5               3rd Argument present??               08825550
         BNP   LFNRERR             No, return ERROR. Invalid arguments. 08825580
         LA    R6,CQYSIZE          CQYSECT data length                  08825610
         CONSOLE MF=(E,CONSOLEL),QUERY,PATH=((2),(3)),                 *08825640
               BUFFER=(SENDBUF,(6))                                     08825670
         LTR   R15,R15                                                  08825700
         BNZ   LFNRET              Return error RC                      08825730
         LR    R2,R4               address of the EXEC variable name    08825760
         LR    R3,R5               length of the EXEC variable name     08825790
         SPACE 1                                                        08825820
         LA    R6,SENDBUF                                               08825850
         USING CQYSECT,R6                                               08825880
         LA    R4,RECVBUF          address of the data buffer           08825910
         LR    R5,R4                                                    08825940
         LH    R15,CQYDQRRW        Rows                                 08825970
         BAL   R14,CONSQRYN                                             08826000
         MVC   0(*-*,R5),0(R15)                                         08826030
         EX    R1,*-6                                                   08826060
         LA    R5,1(R1,R5)                                              08826090
         MVI   0(R5),C' '                                               08826120
         LA    R5,1(,R5)                                                08826150
         LH    R15,CQYDQRCL        Columns                              08826180
         BAL   R14,CONSQRYN                                             08826210
         MVC   0(*-*,R5),0(R15)                                         08826240
         EX    R1,*-6                                                   08826270
         LA    R5,1(R1,R5)                                              08826300
         SPACE 1                                                        08826330
         MVC   0(8,R5),=C' NOCOLOR'                                     08826360
         TM    CQYDQRFL,CQYDQREC                                        08826390
         BZ    *+10                                                     08826420
         MVC   0(8,R5),=C' EXCOLOR'                                     08826450
         LA    R5,8(,R5)                                                08826480
         SPACE 1                                                        08826510
         MVC   0(12,R5),=C' NOHIGHLIGHT'                                08826540
         TM    CQYDQRFL,CQYDQREH                                        08826570
         BZ    *+10                                                     08826600
         MVC   0(12,R5),=C' EXHIGHLIGHT'                                08826630
         LA    R5,12(,R5)                                               08826660
         SPACE 1                                                        08826690
         LA    R4,RECVBUF          address of the data buffer           08826720
         SR    R5,R4               length of the data buffer            08826750
         BAL   R14,STORE           Set REXX Variable                    08826780
         SPACE 1                                                        08826810
         SR    R15,R15                                                  08826840
         B     LFNRET              Return result                        08826870
         DROP  R6                                                       08826900
         SPACE 1                                                        08826930
CONSQRYN DS    0H                                                       08826960
         MVC   RETCODE,RETEDPAT    Set up edit pattern                  08826990
         CVD   R15,WORKDW1         Convert return code to dec.          08827020
         ED    RETCODE,WORKDW1+3   Edit the number                      08827050
         LA    R0,9                                                     08827080
         LA    R1,RETCODE+1                                             08827110
CONSQRYL CLI   0(R1),C' '          Loop until                           08827140
         BNE   *+12                  leading blanks are skipped         08827170
         LA    R1,1(,R1)                                                08827200
         BCT   R0,CONSQRYL                                              08827230
         SPACE 1                                                        08827260
         LR    R15,R1              Result address                       08827290
         LR    R1,R0               Result length                        08827320
         BCTR  R1,0                Result length - 1                    08827350
         BR    R14                                                      08827380
         EJECT                                                          08827410
$CONSE   DS    0H                                                       08827440
         STM   R14,R12,12(R13)                                          08827470
         LA    R11,0(,R15)         Clear junk                           08827500
         LA    R15,CONSEGO-DMSLFNWK                                     08827530
         SR    R11,R15                                                  08827560
         L     R12,LFNBASE1                                             08827590
         L     R10,LFNBASE2                                             08827620
         B     CONSEXIT                                                 08827650
CONSELN  EQU   *-$CONSE                                                 08827680
CONSEXIT DS    0H                                                       08827710
*                                  R0 has the device address            08827740
*                                  It was passed as the userword.       08827770
         LA    R6,CNPTHQUE         Search for CNPTH block               08827800
         USING CNPTH,R6                                                 08827830
CONSEGET DS    0H                                                       08827860
         ICM   R6,B'1111',CNPTHNXT                                      08827890
         BZR   R14                 (SHOULD NOT OCCUR)                   08827920
         C     R0,CNPTHVDA         Matching virtual address??           08827950
         BNE   CONSEGET            No, keep looking                     08827980
         L     R1,CNPTHNML         Get an EVALBLOK to                   08828010
         BAL   R14,GETEVAL           hold the interrupting pathname     08828040
         USING EVALBLOK,R5                                              08828070
         BCTR  R3,0                                                     08828100
         MVC   EVDATA(*-*),CNPTHNAM Copy in the path name               08828130
         EX    R3,*-6                                                   08828160
         SPACE 1                                                        08828190
         LA    R2,CNPTHINQ-(EVBPAD1-EVALBLOK) Use queue anchor          08828220
CONENQ   DS    0H                  Here to enqueue complete message     08828250
         LR    R3,R2               Save lagging                         08828280
         ICM   R2,B'1111',EVBPAD1-EVALBLOK(R2) Chain to next            08828310
         BNZ   CONENQ              Search for the end                   08828340
         ST    R5,EVBPAD1-EVALBLOK(R3) Chain it on                      08828370
         ST    R2,EVBPAD1          Zero forward pointer                 08828400
         SPACE 1                                                        08828430
         OI    MSGIN,X'40'         POST the MSGIN ECB                   08828460
         LM    R14,R12,12(R13)                                          08828490
         SR    R15,R15                                                  08828520
         BR    R14                                                      08828550
.NOCONS3 ANOP                                                  CONSREMV 08828555
         TITLE 'DMSLFN:  $ASCLN function code'                          08830000
*-------------------------------------------------------------*         08840000
* The $ASCLN function sets and clears a virtual line interrupt*         08850000
* handler routine which resides in free storage. The ASCII    *         08860000
* line at virtual address 001 is ENABLE'd or DISABLE'd as     *         08870000
* requested.                                                  *         08880000
*-------------------------------------------------------------*         08890000
$ASCLN   DS    0H                                                       08900000
         L     R11,4(,R2)          Work area address from SCBLOCK       08910000
         L     R12,LFNBASE1        Code base reg from workarea          08924990
         L     R10,LFNBASE2                                             08929980
         ST    R14,LFNRETAD        Save return address                  08934970
         BAL   R14,FNINIT          Go initialize                        08940000
         SPACE 1                                                        08950000
         CLC   =C'ENABLE ',0(R1)   Check argument..                     08960000
         BE    ASCSET              Br if call '$ASCLN' 'ENABLE'         08970000
         CLC   =C'DISABLE ',0(R1)  Check argument..                     08980000
         BNE   LFNRERR             Br if not call '$ASCLN' 'DISABLE'    08990000
         SPACE 1                                                        09000000
         LA    R1,CCWDISAB         Disable ASCII line                   09010000
         BAL   R6,IO                                                    09020000
         B     LFNRERR             RC=4 if I/O error occured            09030000
         HNDINT CLR,(PLT1),ERROR=1                                      09040000
         B     LFNROK                                                   09050000
         EJECT                                                          09060000
ASCSET   DS    0H                                                       09070000
         LA    R1,HNDINTL          Point to MF=L HNDINT area            09080000
         MVC   0(HNDINTLN,R1),ASCPATRN Fill in the list form of macro   09090000
         LA    R0,IOLINEGO         Re-locate the                        09100000
         ST    R0,HNDINTA            exit routine address               09110000
         SVC   202                                                      09120000
         DC    AL4(1)                                                   09130000
         SPACE 2                                                        09140000
         LA    R1,CCWENABL         Enable and initialize line           09150000
         BAL   R6,IO                                                    09160000
         B     LFNRERR             RC=4 if I/O error occured            09170000
         B     LFNROK                                                   09180000
         SPACE 1                                                        09190000
ASCPAT   HNDINT SET,(PLT1,*-*,001,ASAP),ERROR=1                         09200000
ASCPATRN EQU   ASCPAT+4,28                                              09210000
         SPACE 2                                                        09220000
CCWPAT   DS    0D                                                       09230000
         CCW   ENABLE,0,SILI,1                        Enable            09240000
         CCW   DISABLE,0,SILI,1                       Disable           09250000
         CCW   WRITE,SENDBUF-DMSLFNWK,CC+SILI,L'SENDBUF Write data      09260000
         CCW   READ,RECVBUF-DMSLFNWK,SILI,L'RECVBUF   Read response     09270000
         CCW   SENSE,SENSBYTE-DMSLFNWK,SILI,1         Read sense byte   09280000
CCWPATLN EQU   *-CCWPAT                                                 09290000
         TITLE 'DMSLFN:  $ASCR, $ASCW, $ASCWR function code'            09300000
*-------------------------------------------------------------*         09310000
* The $ASCR function reads the ASCII line at address X'001'   *         09320000
* and returns the data as its explicit result                 *         09330000
*-------------------------------------------------------------*         09340000
$ASCR    DS    0H                                                       09350000
         L     R11,4(,R2)          Work area address from SCBLOCK       09360000
         L     R12,LFNBASE1        Code base reg from workarea          09374990
         L     R10,LFNBASE2                                             09379980
         ST    R14,LFNRETAD        Save return address                  09384970
         BAL   R14,FNINIT          Go initialize                        09390000
         SPACE 1                                                        09400000
         LA    R1,CCWREAD          Read response from line              09410000
         MVI   0(R1),READ                                               09420000
         BAL   R6,IO                                                    09430000
         B     LFNRERR                                                  09440000
         B     ASCRSULT            Go pass response as result           09450000
         SPACE 1                                                        09460000
*-------------------------------------------------------------*         09470000
* The $ASCW function writes the first argument data to the    *         09480000
* line at virtual address X'001'.                             *         09490000
*-------------------------------------------------------------*         09500000
$ASCW    DS    0H                                                       09510000
         L     R11,4(,R2)          Work area address from SCBLOCK       09520000
         L     R12,LFNBASE1        Code base reg from workarea          09532990
         L     R10,LFNBASE2                                             09535980
         NI    CCWWRITE+4,255-CC   Disconnect WRITE from READ           09540000
         B     ASCWCOMM                                                 09550000
         SPACE 1                                                        09560000
*-------------------------------------------------------------*         09570000
* The $ASCWP function writes the first argument data on the   *         09580000
* ASCII line at virtual address X'001' as a prompt. It then   *         09590000
* puts up an inhibited READ to await a command and exits.     *         09600000
*-------------------------------------------------------------*         09610000
$ASCWP   DS    0H                                                       09620000
         L     R11,4(,R2)          Work area address from SCBLOCK       09630000
         L     R12,LFNBASE1        Code base reg from workarea          09642990
         L     R10,LFNBASE2                                             09645980
         OI    CCWWRITE+4,CC  CONNECT WRITE TO READ CCW                 09650000
         MVI   CCWREAD,READNTO                                          09660000
         B     ASCWCOMM                                                 09670000
         EJECT                                                          09684990
*-------------------------------------------------------------*         09690000
* The $ASCWR function writes the first argument data on the   *         09700000
* ASCII line at virtual address X'001', reads the response,   *         09710000
* and returns the data as its explicit result                 *         09720000
*-------------------------------------------------------------*         09730000
$ASCWR   DS    0H                                                       09740000
         L     R11,4(,R2)          Work area address from SCBLOCK       09750000
         L     R12,LFNBASE1        Code base reg from workarea          09762990
         L     R10,LFNBASE2                                             09765980
         OI    CCWWRITE+4,CC  CONNECT WRITE TO READ CCW                 09770000
         MVI   CCWREAD,READ                                             09780000
ASCWCOMM DS    0H                                                       09790000
         ST    R14,LFNRETAD        Save return address                  09804990
         BAL   R14,FNINIT          Go initialize                        09810000
         LTR   R3,R3               Any argument data??                  09820000
         BNP   LFNRERR             No, take error exit                  09830000
         SPACE 2                                                        09844990
         L     R15,CCWWRITE        Get CCW data address                 09850000
         STH   R3,CCWWRITE+6           and set length                   09860000
         SPACE 1                                                        09870000
         BCTR  R3,0                                                     09880000
         EX    R3,SRVSETWM         Copy data to output buffer           09890000
         SPACE 1                                                        09900000
         CLC   =C'BINARY ',0(R1)   No translate desired??               09910000
         BE    SRVSETWF            If so, all set                       09920000
         L     R2,=A(EBC2ASCI-DMSLFN) Translate table                   09930000
         ALR   R2,R12                    address relocated              09940000
         CLC   =C'ASCII ',0(R1)    ASCII translate desired??            09950000
         BE    SRVSETWX            If so, all set                       09960000
         SPACE 1                                                        09970000
         L     R2,=A(MKPARITY-DMSLFN)                                   09980000
         LA    R4,SRVSETMP                                              09990000
         CLC   =C'BINARYM ',0(R1)  Mark parity binary??                 10000000
         BE    *+12                Skip next if it is                   10010000
         L     R2,=A(NOPARITY-DMSLFN)                                   10020000
         LA    R4,SRVSETNP                                              10030000
         SPACE 1                                                        10040000
         ALR   R2,R12              Table address relocated              10050000
         EX    R3,0(,R4)           Set or Unset X'80' bits              10060000
         SPACE 1                                                        10070000
         SR    R2,R2                                                    10080000
         CLC   =C'BINARYE ',0(R1)  Even parity binary??                 10090000
         BNE   *+8                 Skip next if it is                   10100000
         L     R2,=A(PARITYE-DMSLFN)                                    10110000
         CLC   =C'BINARYO ',0(R1)  Odd parity binary??                  10120000
         BNE   *+8                 Skip next if it is                   10130000
         L     R2,=A(PARITYO-DMSLFN)                                    10140000
         EJECT                                                          10154990
         LTR   R2,R2               Even or Odd??                        10160000
         BZ    SRVSETWF            Skip next if neither                 10170000
         ALR   R2,R12              Table address relocated              10180000
         EX    R3,SRVSETWT         Translate to appropriate parity      10190000
SRVSETWF L     R2,=A(BITFLIP-DMSLFN) Translate table                    10200000
         ALR   R2,R12                    address relocated              10210000
SRVSETWX DS    0H                                                       10220000
         EX    R3,SRVSETWT         Reverse bits or xlate to ASCII       10230000
         SPACE 1                                                        10240000
         LA    R1,CCWWRITE    Write response prompt, read response      10250000
         TM    CCWWRITE+4,CC       If not a command                     10260000
         BZ    SRVSETIO              read then skip                     10270000
         CLI   CCWREAD,READNTO         to normal IO                     10280000
         BNE   SRVSETIO                  routine address                10290000
         BAL   R6,IONOWAIT         Goto start the I/O with no wait      10300000
         B     LFNRERR                                                  10310000
         B     LFNROK                                                   10320000
SRVSETIO DS    0H                                                       10330000
         BAL   R6,IO               Goto common I/O routine              10340000
         B     LFNRERR                                                  10350000
         TM    CCWWRITE+4,CC       If '$ASCW' then                      10360000
         BZ    LFNROK                return 'OK' response               10370000
         EJECT                                                          10380000
ASCRSULT DS    0H                                                       10390000
         LH    R1,CCWREAD+6        Read length                          10400000
         SH    R1,LINECSW+6           - residual count                  10410000
         BZ    *+6                                                      10420000
         BCTR  R1,0                Don't stack 'CR' or 'XOFF'           10430000
         SPACE 1                                                        10440000
         TM    SENSBYTE,X'01'      Timeout in the sense data?           10450000
         BZ    ASCNOTO1            No, skip next                        10460000
         LA    R1,7                                                     10470000
ASCNOTO1 DS    0H                                                       10480000
         SPACE 1                                                        10490000
         BAL   R14,GETEVAL         Allocate an EVALBLOK                 10500000
         LTR   R15,R3              Data length zero??                   10510000
         BZ    EBLOCK              All done if so                       10520000
         SPACE 1                                                        10530000
         USING EVALBLOK,R5                                              10540000
         BCTR  R3,0                Length of result - 1                 10550000
         L     R2,CCWREAD          Response data pointer                10560000
         SPACE 1                                                        10570000
         TM    SENSBYTE,X'01'      Timeout in the sense data?           10580000
         BZ    ASCNOTO2            No, skip next                        10590000
         LA    R2,=C'Timeout'                                           10600000
ASCNOTO2 DS    0H                                                       10610000
         MVC   EVDATA(*-*),0(R2)                                        10620000
         EX    R3,*-6              Move data to EVALBLOK                10630000
         TM    SENSBYTE,X'01'      Timeout in the sense data?           10640000
         BO    EBLOCK              Yes, all done                        10650000
         LA    R2,BITFLIP                                               10664990
         CLC   =C'ASCII ',FNARG1   ASCII input??                        10670000
         BNE   *+8                 No, return it as is                  10680000
         LA    R2,ASCI2EBC                                              10699990
         EX    R3,*+8              Translate                            10710000
         B     EBLOCK              Return result                        10720000
         TR    EVDATA(*-*),0(R2)                                        10730000
         DROP  R5                                                       10740000
         SPACE 1                                                        10750000
SRVSETWM MVC   0(*-*,R15),0(R2)                                         10760000
SRVSETWT TR    0(*-*,R15),0(R2)                                         10770000
SRVSETNP NC    0(*-*,R15),0(R2)                                         10780000
SRVSETMP OC    0(*-*,R15),0(R2)                                         10790000
         TITLE 'DMSLFN:  LINEIO interrupt handler'                      10800000
* This is our I/O interrupt exit for the path we've set up              10810000
* between ourself and the ASCII line at virtual address X'001'          10820000
         SPACE 1                                                        10830000
IONOWAIT OI    IONWAITD,L'IONWAITD Here for SIO and no WAIT             10840000
         B     *+8                                                      10850000
IO       NI    IONWAITD,255-L'IONWAITD Here for SIO and WAIT            10860000
         NI    IOSENSEP,255-L'IOSENSEP No sense pending yet             10870000
         SPACE 1                                                        10880000
IOUCHECK DS    0H                                                       10890000
         SSM   MASKDISA       Suppress interrupts during SIO            10900000
         SPACE 1                                                        10910000
         NI    IONOTOPR,255-L'IONOTOPR Clear not operational flag       10920000
         MVI   SENSBYTE,0                                               10930000
         ST    R1,X'48'       Set CAW                                   10940000
         LA    R3,1           Line device address                       10950000
         SIO   0(R3)          Start the line I/O                        10960000
         BC    2,*-4           ... loop while it's busy                 10970000
         BC    8+4,*+8        Bif started or CSW stored                 10980000
         OI    IONOTOPR,L'IONOTOPR Set not operational flag             10990000
         SPACE 1                                                        11000000
         SSM   MASKENAB       Allow interrupts                          11010000
         SPACE 1                                                        11020000
         TM    IONOTOPR,L'IONOTOPR If not operational,                  11030000
         BOR   R6                  take the error exit                  11040000
         TM    IONWAITD,L'IONWAITD If no WAIT, then return to caller    11050000
         BO    4(,R6)                                                   11060000
         SPACE 1                                                        11070000
         WAITD PLT1,ERROR=1   Wait for I/O complete                     11080000
         SPACE 1                                                        11090000
         TM    IOSENSEP,L'IOSENSEP Did we just do a SENSE??             11100000
         BO    4(,R6)         Yes, return                               11110000
         TM    LINECSW+4,X'02' Is Unit Check set??                      11120000
         BZ    4(,R6)         No, return                                11130000
         LA    R1,CCWSENSE    Point to the CCW                          11140000
         OI    IOSENSEP,L'IOSENSEP Signal a SENSE is in progress        11150000
         B     IOUCHECK       Join common I/O Routine                   11160000
         EJECT                                                          11170000
*********************************************************************** 11180000
*                                                                     * 11190000
*        LINE I/O INTERRUPT HANDLER                                   * 11200000
*                                                                     * 11210000
*********************************************************************** 11220000
$IOLINE  DS    0H                                                       11230000
         LA    R11,0(,R15)         Clear junk                           11240000
         LA    R15,IOLINEGO-DMSLFNWK                                    11250000
         SR    R11,R15                                                  11260000
         L     R12,LFNBASE1                                             11272990
         L     R10,LFNBASE2                                             11275980
         B     IOLINE                                                   11280000
IOLINELN EQU   *-$IOLINE                                                11290000
IOLINE   DS    0H                                                       11300000
         SR    R15,R15             Preset return code                   11310000
         LR    R1,R2               Point past last CCW                  11320000
         LA    R0,8                                                     11330000
         SLR   R1,R0               Point to CCW                         11340000
         CLI   0(R1),SENSE         Is it a SENSE??                      11350000
         BE    *+8                 skip next if it is                   11360000
         STM   R2,R3,LINECSW                                            11370000
         SPACE 1                                                        11380000
         CLI   0(R1),READNTO       Is it a terminal command read??      11390000
         BNER  R14                 Just return if not...                11400000
         SPACE 1                                                        11410000
         ST    R14,LFNRETAD        Save return address                  11424990
         LH    R1,CCWREAD+6        READ length                          11430000
         SH    R1,LINECSW+6           - residual count                  11440000
         BZ    *+6                                                      11450000
         BCTR  R1,0                Don't stack 'CR' or 'XOFF'           11460000
         SPACE 1                                                        11470000
         LA    R1,9(,R1)           Add count for fake userid            11480000
         BAL   R14,GETEVAL         Get a REXX EVALBLOK for result       11490000
         USING EVALBLOK,R5                                              11500000
         SPACE 1                                                        11510000
         MVC   EVDATA(9),=CL9'CONSOLE' Fake vm userid for $SMSG         11520000
         L     R2,CCWREAD                                               11530000
         BCTR  R3,0                Decrement for EXECUTEs               11540000
         SH    R3,=H'9'                                                 11550000
         BM    SMSGENQ                                                  11560000
         MVC   EVDATA+9(*-*),0(R2)                                      11570000
         EX    R3,*-6                                                   11580000
         LA    R2,ASCI2EBC                                              11599990
         B     *+10                                                     11610000
         TR    EVDATA+9(*-*),0(R2)   Translate line to EBCDIC           11620000
         EX    R3,*-6                                                   11630000
         B     SMSGENQ            Exit through MSGPOST routine          11640000
         EJECT ,                                                        11640100
*.                                                                      11640200
*        FETCH - Fetch the value of an EXEC variable via EXECCOMM       11640300
*                                                                       11640400
*        Input -                                                        11640500
*              R4 contains the address of the result buffer             11640600
*              R5 contains the length of the result buffer              11640700
*              R2 contains the address of the EXEC variable name        11640800
*              R3 contains the length of the EXEC variable name         11640900
*        Output -                                                       11641000
*              CC = 0 success, CC = NZ if variable is not initialized.  11641100
*.                                                                      11641200
FETCH    EQU   *                                                        11641300
         USING SHVBLOCK,R6             * Shared Variable Block          11641400
         LA    R6,SHRLIST              * Load SHVBLOCK base register    11641500
         XC    SHVBLOCK(SHVBLEN),SHVBLOCK                               11641600
         MVI   SHVCODE,SHVFETCH        * FETCH option                   11641700
         B     CALLEXEC                * And go perform the fetch       11641800
         SPACE ,                                                        11641900
*.                                                                      11642000
*        STORE - Store a new value of an EXEC variable via EXECCOMM     11642100
*                                                                       11642200
*        Input -                                                        11642300
*              R2 contains the address of the EXEC variable name        11642400
*              R3 contains the length of the EXEC variable name         11642500
*              R4 contains the address of the data buffer               11642600
*              R5 contains the length of the data buffer                11642700
*        Output -                                                       11642800
*              CC = 0 for success, CC = NZ for failure.                 11642900
*.                                                                      11643000
STORE    EQU   *                                                        11643100
         LA    R6,SHRLIST              * Load SHVBLOCK base register    11643200
         XC    SHVBLOCK(SHVBLEN),SHVBLOCK                               11643300
         MVI   SHVCODE,SHVSTORE        * STORE option                   11643400
         ST    R5,SHVVALL              * Save length of value           11643500
         EJECT ,                                                        11643600
CALLEXEC DS    0H                                                       11643700
         LA    R1,SHRPLIST                                              11643800
         USING EFPLIST,R1                                               11643900
         ST    R6,EFBLOCK              * Save SHRLIST address in NPLIST 11644000
         LA    R0,EXECCOMM             * Point to function name         11644100
         ST    R0,ECOMVERB             * Save address in NPLIST         11644200
         SPACE ,                                                        11644300
         ST    R4,SHVVALA              * Save address of result         11644400
         ST    R5,SHVBUFL              * Save length of result buffer   11644500
         SPACE ,                                                        11644600
         ST    R2,SHVNAMA              * Save address of variable name  11644700
         ST    R3,SHVNAML              * Save length of variable name   11644800
         SPACE ,                                                        11644900
*.                                                                      11645000
*        Now execute the EXECCOMM request                               11645100
*.                                                                      11645200
         XC    EBEGARGS,EBEGARGS       * Clear BEGARGS pointer          11645300
         XC    EENDARGS,EENDARGS       * Clear ENDARGS pointer          11645400
         LR    R0,R1                   * Point to extended plist        11645500
         DROP  R1                                                       11645600
         LA    R1,EXECCOMM             * Point to function name         11645700
         ICM   R1,B'1000',=X'02'       * Set SUBCOM-call flag           11645800
         SVC   202                     * Execute the plist              11645900
         DC    AL4(1)                  * Dummy error exit               11646000
         LTR   R15,R15                 * EXECCOMM function complete ?   11646100
         BM    RETCCNZ                 * Return to caller if negative   11646200
         SPACE ,                                                        11646300
         CLI   SHVCODE,SHVFETCH        * FETCH request ?                11646400
         BNE   CHECKNEW                * Nope, continue                 11646500
         L     R5,SHVVALL              * Load length of variable        11646600
         SPACE ,                                                        11646700
         CLI   SHVRET,0                * Any errors ?                   11646800
         BER   R14                     * Nope, return CC=0              11646900
         B     RETCCNZ                 * Else, return non-zero CC       11647000
CHECKNEW EQU   *                                                        11647100
         TM    SHVRET,SHVNEWV          * New variable defined ?         11647200
         BNZ   RETCCZ                  * Yes, continue                  11647300
RETCCNZ  EQU   *                                                        11647400
         SLR   R15,R15                 * Set non-zero CC                11647500
         BR    R14                     * Return to caller               11647600
RETCCZ   EQU   *                                                        11647700
         CR    R15,R15                 * Set CC=0                       11647800
         BR    R14                     * Return to caller               11647900
         DROP  R6                      * Drop SHVBLOCK addressability   11648000
         TITLE 'DMSLFN:  ASCII line I/O error routine'                  11650000
*-------------------------------------------------------------*         11660000
* lfnret                                                      *         11670000
*   returns numeric return code to caller                     *         11680000
* lfnretc                                                     *         11690000
*   returns character result to caller                        *         11700000
* lfnrnull                                                    *         11710000
*   returns a null string result to the caller                *         11720000
* lfnrok, lfnrerr                                             *         11730000
*   returns 'OK' and 'ERROR' responses to the caller          *         11740000
*-------------------------------------------------------------*         11750000
LFNRET   DS    0H                                                       11760000
         MVC   RETCODE,RETEDPAT    Set up edit pattern                  11770000
         CVD   R15,WORKDW1         Convert return code to dec.          11780000
         ED    RETCODE,WORKDW1+3   Edit the return code                 11790000
         LA    R0,9                                                     11800000
         LA    R1,RETCODE+1                                             11810000
LFNRETLP CLI   0(R1),C' '          Loop until                           11820000
         BNE   *+12                  leading blanks are skipped         11830000
         LA    R1,1(,R1)                                                11840000
         BCT   R0,LFNRETLP                                              11850000
         SPACE 1                                                        11860000
LFNRETC  DS    0H                                                       11870000
         LA    R6,0(,R1)           Result address                       11880000
         LR    R1,R0               Result length                        11890000
         LA    R14,LINEVALN        Numeric code return address          11900000
         B     GETEVAL             Allocate an EVALBLOK                 11910000
LFNRNULL DS    0H                                                       11920000
         SR    R1,R1               Get a null EVALBLOK                  11930000
         LA    R14,EBLOCK          return address                       11940000
         B     GETEVAL                                                  11950000
LFNROK   DS    0H                                                       11960000
         LA    R1,2                                                     11970000
         LA    R14,LINEVALO        'OK' return address                  11980000
         B     GETEVAL             Allocate an EVALBLOK                 11990000
LFNRERR  DS    0H                                                       12000000
         LA    R1,5                                                     12010000
         LA    R14,LINEVALE        'Error' return address               12020000
         B     GETEVAL             Allocate an EVALBLOK                 12030000
         SPACE 1                                                        12040000
         USING EVALBLOK,R5                                              12050000
LINEVALN DS    0H                                                       12060000
         BCTR  R3,0                                                     12070000
         MVC   EVDATA(*-*),0(R6)                                        12080000
         EX    R3,*-6              Move in the numeric code             12090000
         B     EBLOCK                                                   12100000
LINEVALO DS    0H                                                       12110000
         MVC   EVDATA(2),=C'OK'    Move in the 'OK' string              12120000
         B     EBLOCK                                                   12130000
LINEVALE DS    0H                                                       12140000
         MVC   EVDATA(5),=C'Error' Move in the 'Error' string           12150000
         B     EBLOCK              Return result                        12160000
         TITLE 'DMSLFN:  function init and argument retrieval routine'  12170000
*-------------------------------------------------------------*         12180000
* fninit -                                                    *         12190000
*   performs initialization of a rexx function.               *         12200000
*-------------------------------------------------------------*         12210000
FNINIT   DS    0H                                                       12220000
         LR    R13,R0              Get addressability                   12230000
         USING EFPLIST,R13           to the plist                       12240000
         MVC   SAVEFRET,EFUNRET    Save function return address         12250000
         L     R9,EARGLIST         Get pointer to the arg list          12260000
*-------------------------------------------------------------*         12270000
* Retrieve the first argument of a rexx function and          *         12280000
* frame it in an 8 byte, blank-padded field.                  *         12290000
*-------------------------------------------------------------*         12300000
         USING PARMBLOK,R9                                              12310000
         LA    R1,FNARG1                                                12320000
         MVI   0(R1),C' '          Pre-blank the field                  12330000
         MVC   1(8-1,R1),0(R1)                                          12340000
         SPACE 1                                                        12350000
         SR    R2,R2                                                    12360000
         LTR   R3,R9               Any argument list around??           12370000
         BZR   R14                 Return if no argument                12380000
         L     R3,PARM1LEN         First argument length                12390000
         LTR   R3,R3               Save it for later                    12400000
         BNPR  R14                 Return if no argument                12410000
         L     R2,PARM1ADR         First argument address               12420000
         SPACE 1                                                        12430000
         CH    R3,*+10             If greater than                      12440000
         BNH   *+8                   the maximum count,                 12450000
         LA    R3,8                    use the maximum                  12460000
         SPACE 1                                                        12470000
         BCTR  R3,0                                                     12480000
         MVC   0(*-*,R1),0(R2)     Move argument to frame               12490000
         EX    R3,*-6                                                   12500000
*                               *-----------------------*               12510000
         L     R2,PARM2ADR      *  Second ARGument      *               12525990
         L     R3,PARM2LEN      *    pointers to R2,R3  *               12531980
         BR    R14              *-----------------------*               12540000
         DROP  R9,R13                                                   12550000
         TITLE 'DMSLFN:  Common complete EVALBLOK routine'              12560000
*-------------------------------------------------------------*         12570000
* At this point the EVALBLOK is filled in. The registers      *         12580000
* are assumed to be as follows:                               *         12590000
* R5 - the address of the EVALBLOK                            *         12600000
*                                                             *         12610000
*-------------------------------------------------------------*         12620000
         SPACE 2                                                        12630000
EBLOCK   DS    0H                                                       12640000
         USING EVALBLOK,R5         Addressing for EVALBLOK              12650000
         L     R4,SAVEFRET         Get back return addr.                12660000
         ST    R5,0(R4)            Pass address back to caller          12670000
         SLR   R15,R15             Set return code 0                    12680000
         B     LFRETURN            Abandon ship                         12694990
         DROP  R5                                                       12700000
         TITLE 'DMSLFN: Common get EVALBLOK subroutines'                12710000
*-------------------------------------------------------------*         12720000
* This subroutine obtains an EVALBLOK.                        *         12730000
* The assumed input is:                                       *         12740000
*        - R1: length of EVDATA (return data length)          *         12750000
*        - R14: return address                                *         12760000
*                                                             *         12770000
* The output is:                                              *         12780000
*        - R0, R1, & R2 undefined                             *         12790000
*        - R3: number of bytes of data to be returned         *         12800000
*        - R4: number of doublewords in entire EVALBLOK       *         12810000
*        - R5: address of the EVALBLOK                        *         12820000
*        - R15: undefined                                     *         12830000
*        - other registers are unchanged.                     *         12840000
*                                                             *         12850000
* If storage is not available, an error message is optionally *         12860000
* displayed and return is taken to the caller with a non-zero *         12870000
* return code.                                                *         12880000
*-------------------------------------------------------------*         12890000
         SPACE 2                                                        12900000
GETEVAL  DS    0H                                                       12910000
         LR    R3,R1               Hold byte count                      12920000
         LA    R0,EVCTLEN+7(,R1)   Add in overhead + rounding           12930000
         SRL   R0,3                Make it doublewords                  12940000
         LR    R4,R0               Return number of doublewords         12950000
*                                  in entire EVALBLOK.                  12960000
         DMSFREE DWORDS=(0),ERR=NOSTORE  Get the storage                12970000
         LR    R5,R1               Save A(EVALBLOK)                     12980000
         USING EVALBLOK,R5                                              12990000
*                                  Now clear the storage block          13000000
         LR    R15,R3              Save R3                              13010000
         LR    R0,R5               Addr of storage block in R0          13020000
         LR    R1,R4               Length of storage in R1              13030000
         SLL   R1,3                Make it bytes!                       13040000
         LA    R3,0                length to 0, pad of '00'x            13050000
         MVCL  R0,R2               Clear the block                      13060000
         LR    R3,R15              Restore R3                           13070000
         ST    R3,EVLEN            Set it in EVALBLOK                   13080000
         ST    R4,EVSIZE           Total block size (DW's)              13090000
         BR    R14                 Return to caller                     13100000
         EJECT                                                          13110000
*-------------------------------------------------------------*         13120000
* This subroutine obtains an EVALBLOK with EVDATA page        *         13130000
* aligned.                                                    *         13140000
* The assumed input is:                                       *         13150000
*        - R5: offset into the EVALBLOK of the location of    *         13160000
*              the page boundary. (Note that this value is    *         13170000
*              assumed to be no greater than the length of    *         13180000
*              EVDATA passed in register 1                    *         13190000
*        - otherwise the same as for REXV500                  *         13200000
*                                                             *         13210000
* The output is:                                              *         13220000
*        - same as for REXV500                                *         13230000
*                                                             *         13240000
* If storage is not available, an error message is optionally *         13250000
* displayed and return is taken to the caller with a non-zero *         13260000
* return code.                                                *         13270000
*-------------------------------------------------------------*         13280000
         SPACE 2                                                        13290000
REXV520  DS    0H                                                       13300000
         LR    R4,R1               Save original request for            13310000
*                                  later.                               13320000
* R1 contains the size of the block requested, including the            13330000
* bumper.  We must now add in the bumper length again and also          13340000
* twice the length of the eval block control information.  To           13350000
* this we add 1 page and then request this amount of storage            13360000
* from DMSFRE.  This must be done to ensure that we will be             13370000
* able to get the needed block of storage with the proper               13380000
* alignment.                                                            13390000
         LA    R1,2*EVCTLEN+7(R1)  Add twice ctl len and round          13400000
         SRL   R1,3                Make it doublewords                  13410000
         LA    R0,(4096/8)(,R1)    Add in a page's worth of             13420000
*                                  doublewords.                         13430000
         DMSFREE DWORDS=(0),ERR=NOSTORE Get the storage                 13440000
         SLL   R0,3                Number of bytes obtained             13450000
         ALR   R0,R1               Address of first byte beyond         13460000
*                                  end of obtained area.                13470000
         ST    R0,WORKFW1          Save address of end of area          13480000
* Now find the first page boundary which follows the number             13490000
* of bytes which must precede the page boundary.                        13500000
*                                  plus area for return code &          13510000
*                                  CC.                                  13520000
         LA    R0,4095(R5,R1)      Round up to next...                  13530000
         N     R0,=X'FFFFF000'       page boundary.                     13540000
         SLR   R0,R5               Get back to beginning of             13550000
*                                  EVALBLOK.                            13560000
         LR    R5,R0               Get it where it is to be             13570000
*                                  returned.                            13580000
         SR    R0,R1               Is this where we started?            13590000
         BZ    REXV525             Br if yes - there is no              13600000
*                                  storage to be FRETed                 13610000
*                                  preceeding the EVALBLOK.             13620000
         SRL   R0,3                Convert to doublewords               13630000
* Note: The above can only be done in such a cavalier manner            13640000
*       because the difference between the beginning of the             13650000
*       EVALBLOK and the beginning of EVDATA is a doubleword            13660000
*       multiple. If this ever changes, BEWARE - the above              13670000
*       instruction will not fill the bill.                             13680000
         DMSFRET DWORDS=(0),LOC=(1) Return the storage in front         13690000
*                                  of the EVALBLOK.                     13700000
REXV525  DS    0H                                                       13710000
         LR    R0,R5               Copy EVALBLOK address                13720000
         LA    R4,EVCTLEN+7(,R4)   Round up original request            13730000
         N     R4,=X'FFFFFFF8'       to doublewords.                    13740000
         ALR   R0,R4               Address of byte past end of          13750000
*                                  EVALBLOK.                            13760000
         C     R0,WORKFW1          Same as end of entire area?          13770000
         BE    REXV530             Br if yes - whew!                    13780000
         LR    R1,R0               Storage to be freed                  13790000
         S     R0,WORKFW1          Negative of bytes to be              13800000
*                                  freed.                               13810000
         LPR   R0,R0               Make it positive                     13820000
         SRL   R0,3                Make it doublewords                  13830000
*                                  Return storage following             13840000
         DMSFRET DWORDS=(0),LOC=(1) the EVALBLOK.                       13850000
         SPACE 1                                                        13860000
REXV530  DS    0H                  Now clear the storage block          13870000
         LR    R15,R3              Save R3                              13880000
         LR    R0,R5               Addr of storage block in R0          13890000
         LR    R1,R4               Length of storage in R1              13900000
         LA    R3,0                length to 0, pad of '00'x            13910000
         MVCL  R0,R2               Clear the block                      13920000
         LR    R3,R15              Restore R3                           13930000
         SRL   R4,3                Return number of doublewords         13940000
*                                  in entire EVALBLOK.                  13950000
         BR    R14                 Return to caller                     13960000
         TITLE 'Common Error Processing Routines'                       13970000
*-------------------------------------------------------------*         13980000
* Error handling routines.                                    *         13990000
* Note that in order to avoid the generation of relocatable   *         14000000
* address constants, the TYPLIN PLIST is "hand built" rather  *         14010000
* than using WRTERM.                                          *         14020000
*-------------------------------------------------------------*         14030000
         SPACE 3                                                        14040000
BADPL    DS    0H                  Something's wrong with PLIST         14050000
         LA    R1,MSG1             Get message address                  14069990
         LA    R2,L'MSG1           Get message length                   14080000
         B     DISPMSG             Go display the message               14090000
         SPACE 1                                                        14100000
NOSTORE  DS    0H                  DMSFREE not successfull              14110000
         LA    R1,MSG2             Get message address                  14129990
         LA    R2,L'MSG2           Get message length                   14140000
         TM    DISPMSGS,L'DISPMSGS Display messages?                    14150000
         BZ    NODISPL1            Br if not                            14160000
DISPMSG  DS    0H                                                       14170000
         MVC   TYPLIN(TYPPATLN),TYPPAT Set pattern plist                14180000
         STCM  R1,B'0111',TYPBUFF  Set it in plist                      14190000
         STH   R2,TYPLEN           Set it in plist                      14200000
         OI    TYPLIN+13,X'40'     Request error message edit           14210000
         LA    R1,TYPLIN           Point at plist                       14220000
         SVC   CMS202              Give it to CMS                       14230000
         DC    AL4(1)              Ignore errors                        14240000
NODISPL1 DS    0H                                                       14250000
ERROR    DS    0H                                                       14260000
         LA    R15,4               Set non-zero return code             14270000
         B     LFRETURN            Return                               14284990
         TITLE 'DMSLFN:  Constants and literals'                        14290000
         DS    0D                  Align the following                  14300000
         LTORG ,                   Literal pool                         14310000
         EJECT                                                          14320000
STARMSG  DC    CL8'*MSG'           CP message services name             14330000
IUCVNAME DC    CL8'DMSLFN'         IUCV name for CMS support            14340000
MASKDISA DC    X'00'                                                    14350000
MASKENAB DC    X'FF'                                                    14360000
         SPACE 2                                                        14370000
TRHEX    DC    C'0123456789ABCDEF' Printable hex digits                 14380000
TRHEXTB  EQU   TRHEX-240           Allow direct addressing              14390000
         SPACE 2                                                        14400000
WAITABLE DS    0F                                                       14410000
WRDR     DC    AL1(L'WAITRDR,3),C'RDR'                                  14420000
WMSG     DC    AL1(L'WAITMSG,3),C'MSG'                                  14430000
WSMSG    DC    AL1(L'WAITSMSG,4),C'SMSG'                                14440000
WTIMER   DC    AL1(L'WAITIMER,5),C'TIMER'                               14450000
WCONSL   DC    AL1(L'WAITCONS,5),C'CONSL'                               14455000
         DC    AL1(0,0)                                                 14460000
         SPACE 2                                                        14470000
         DS    0D                  Align the following                  14480000
TYPPAT   DC CL8'TYPLIN',X'01',AL3(0),C'B',X'00',AL2(0)                  14490000
TYPPATLN EQU   *-TYPPAT                                                 14500000
         SPACE 1                                                        14510000
RETEDPAT DC    X'40202020202020202120' Edit mask to suppress            14520000
*                                  leading zeros on return code.        14530000
EXECCOMM DC    CL8'EXECCOMM'           * EXECCOMM function              14530100
         SPACE 1                                                        14530200
LFRETPAT L     R14,LFNRETAD        Restore Return address               14530300
         B     0(,R14)               and return to caller               14530400
LFRETLEN EQU   *-LFRETPAT          Restore Return address               14530500
         TITLE 'DMSLFN:  Common symbolic assignments'                   14530600
CMS202   EQU   202                 CMS SVC 202                          14530700
ARG1     EQU   8,8                 First agrument                       14530800
ARG2     EQU   16,8                Second agument                       14530900
PARML    EQU   8                   Length of entry in old PLIST         14531000
         SPACE 1                                                        14531100
* NUCEXT PLIST Flags:                                                   14531200
SERVICE  EQU   X'40'                                                    14531300
SYSTEM   EQU   X'80'                                                    14531400
CLEAR    EQU   X'00'                                                    14531500
         SPACE 2                                                        14531600
*-- DSECT for the function plist ------------------------------         14531700
EFPLIST  DSECT                                                          14531800
ECOMVERB DS    F                   COMVERB pointer                      14531900
EBEGARGS DS    F                   pointer to argument string           14532000
EENDARGS DS    F                   pointer to arg string end            14532100
EFBLOCK  DS    F                   fileblok pointer (0)                 14532200
EARGLIST DS    F                   pointer to function args             14532300
EFUNRET  DS    F                   location of return data              14532400
         SPACE 2                                                        14532500
*-- DSECT for the returned data block -------------------------         14532600
EVALBLOK DSECT                                                          14532700
EVBPAD1  DS    F                   Reserved                             14532800
EVSIZE   DS    F                   Total block size in DW's             14532900
EVLEN    DS    F                   Length of Data (in bytes)            14533000
EVBPAD2  DS    F                   Reserved                             14533100
EVCTLEN  EQU   *-EVALBLOK          Length of preceeding section         14533200
EVDATA   DS    0D                  First byte of data                   14533300
EVDATAW1 DS    F                   First word of data                   14533400
EVDATAW2 DS    F                   Second word of data                  14533500
EVDATAW3 DS    F                   Third word of data                   14533600
EVDATAW4 DS    F                   Fourth word of data                  14533700
EVDATAW5 DS    F                   Fifth word of data                   14533800
         EJECT                                                          14533900
*-- DSECT for input parameters  ------------------------------*         14534000
PARMBLOK DSECT                                                          14534100
PARM1ADR DS    F                   Address of parameter 1               14534200
PARM1LEN DS    F                   Length of parameter 1                14534300
PARMNTRY EQU   *-PARMBLOK          Length of table entry                14534400
PARM2ADR DS    F                   Address of parameter 2               14534500
PARM2LEN DS    F                   Length of parameter 2                14534600
PARM3ADR DS    F                   Address of parameter 3               14534700
PARM3LEN DS    F                   Length of parameter 3                14534800
PARM4ADR DS    F                   Address of parameter 4               14534900
PARM4LEN DS    F                   Length of parameter 4                14535000
PARM5ADR DS    F                   Address of parameter 5               14535100
PARM5LEN DS    F                   Length of parameter 5                14535200
PADR     EQU   0,4                 Offset in each pair to               14535300
*                                  parameter's address.                 14535400
PLEN     EQU   4,4                 Offset in each pair to               14535500
*                                  parameter's length.                  14535600
         AGO   .NOCONSA                                        CONSREMV 14535605
         EJECT                                                          14535700
*-- DSECT for CONSOLE Macro OPEN function---------------------*         14535800
         CQYSECT ,                                                      14535900
.NOCONSA ANOP                                                  CONSREMV 14535905
         EJECT                                                          14536000
         SHVBLOCK ,                    * Shared Variable Block          14536100
         EJECT                                                          14536200
         SCBLOCK ,                     * Subcom Control Block           14536300
         REGEQU                                                         14536400
         NUCON                                                          14536500
         AIF   (&VMCF).VMCF9                                   UPDTVMCF 14536590
         COPY  IPARML                                                   14536600
         AGO   .NDVMCF9                                        UPDTVMCF 14536605
.VMCF9   ANOP                                                  UPDTVMCF 14536610
         COPY  VMCBLOKS                                        UPDTVMCF 14536615
*                                                              UPDTVMCF 14536620
EXTUAREA DSECT                                                 UPDTVMCF 14536625
EXTUGPRS DC    16F'0'        General registers at interrupt    UPDTVMCF 14536630
EXTUFRS  DC    4D'0'         Floating point regs at interrupt  UPDTVMCF 14536635
EXTUPSW  DC    D'0'          External Old PSW at interrupt     UPDTVMCF 14536640
EXTUSAVE DC    18F'0'        Save area for handler routine     UPDTVMCF 14536645
*                            by R13 when control passed to     UPDTVMCF 14536650
*                            handler                           UPDTVMCF 14536655
         DS    0F            Need fullword boundary            UPDTVMCF 14536660
*                                                              UPDTVMCF 14536665
.NDVMCF9 ANOP                                                  UPDTVMCF 14536670
         AGO   .NOCONS4                                        CONSREMV 14536690
         TITLE 'DMSLFN:  Work area for each open CONSOLE path'          14536700
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 14536800
* Work area for each active CONSOLE path                              * 14536900
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 14537000
CNPTH    DSECT                                                          14537100
CNPTHNXT DC    A(0)                Address of next CONWORK area         14537200
CNPTHVDA DC    F'0'                Path virtual device address          14537300
CNPTHINQ DC    A(0)                Interrupt reflect queue              14537400
CNPTHNML DC    F'0'                Length of path name                  14537500
CNPTHFLG DC    X'00'                                                    14537600
CNPWAIT  EQU   CNPTHFLG,X'80'      $WAIT requested on this path         14537700
CNPTHNAM EQU   *                   Start of path name                   14537800
.NOCONS4 ANOP                                                  CONSREMV 14537805
         TITLE 'DMSLFN:  Common data areas'                             14540000
DMSLFNWK DSECT                                                          14550000
LFNBASE1 DS    A                   (FREEGO-DMSLFN) behind freestor      14560990
LFNBASE2 DS    A                   LFNBASE1 + 4096                      14561980
LFNRETAD DS    A                   Return address to caller             14562970
LFRETURN L     R14,LFNRETAD        Restore return address               14563960
         B     0(,R14)               and return to caller               14564950
         SPACE 1                                                        14570000
CNPTHQUE DC    A(0)                CONWORK queue pointer                14575000
CONCOMP  DC    F'0'                Connection Complete ECB              14580000
MSGIN    DC    F'0'                Message has arrived ECB              14590000
         SPACE 1                                                        14600000
SWITCHES DC    X'00'               Internal switches                    14610000
DISPMSGS EQU   SWITCHES,X'80'      Display error messages               14620000
IONOTOPR EQU   SWITCHES,X'40'      Line 1 SIO CC=3 not operational      14630000
IONWAITD EQU   SWITCHES,X'20'      Don't wait on line interrupt         14640000
IOSENSEP EQU   SWITCHES,X'10'      SENSE operation in progress          14650000
         SPACE 2                                                        14660000
WAITFLAG DC    X'00'                                                    14670000
WAITRDR  EQU   WAITFLAG,X'80'      Waiting for READER interrupt         14680000
WAITMSG  EQU   WAITFLAG,X'40'      Waiting for MSG    interrupt         14690000
WAITSMSG EQU   WAITFLAG,X'20'      Waiting for SMSG   interrupt         14700000
WAITIMER EQU   WAITFLAG,X'10'      Waiting for TIMER  interrupt         14710000
WAITCONS EQU   WAITFLAG,X'08'      Waiting for CONSL  interrupt         14721990
WAITANY  EQU   WAITFLAG,X'FF'      Waiting for anything at all          14723980
         SPACE 2                                                        14725970
HNDLFLAG DC    X'00'                                                    14727960
HNDLRDR  EQU   HNDLFLAG,X'80'      Set for a READER interrupt           14729950
         AIF   (&VMCF).VMCFA                                   UPDTVMCF 14729955
HNDLIUCV EQU   HNDLFLAG,X'40'      Set for an IUCV  interrupt           14731940
         AGO   .NDVMCFA                                        UPDTVMCF 14731945
.VMCFA   ANOP                                                  UPDTVMCF 14731950
HNDLVMCF EQU   HNDLFLAG,X'40'      Set for a VMCF interrupt    UPDTVMCF 14731955
.NDVMCFA ANOP                                                  UPDTVMVF 14731960
HNDTIMER EQU   HNDLFLAG,X'20'      Set for a TIMER  interrupt           14733930
         SPACE 2                                                        14740000
HAVEFLAG DC    X'00'                                                    14750000
HAVTIMER EQU   HAVEFLAG,X'80'      Have a TIMER  interrupt              14760000
         DS    0F                                                       14770000
HAVECON  DC    F'0'                CONSL interrupt queue anchor         14782990
HAVEMSG  DC    F'0'                MSG queue anchor                     14785980
HAVESMSG DC    F'0'                SMSG queue anchor                    14790000
         SPACE 1                                                        14829990
LFNWKCLR EQU   *-DMSLFNWK          Fields behind this line are cleared  14860000
         SPACE 1                                                        14870000
IOLINEGO DC    (IOLINELN/2)H'0'                                         14880000
IORDRGO  DC    (IORDRLN/2)H'0'                                          14890000
TIMUPGO  DC    (TIMUPLN/2)H'0'                                          14900000
         AGO   .NOCONS5                                        CONSREMV 14904990
CONSEGO  DC    (CONSELN/2)H'0'                                          14905000
.NOCONS5 ANOP                                                  CONSREMV 14905005
         SPACE 1                                                        14910000
INTERVAL DS    F                   Holds STIMER delay interval          14939990
MSGRETAD DS    A                   Holds IUCV Interrupt return address  14959980
         DS    0D                                                       14990000
         AIF   (&VMCF).VMCFB                                   UPDTVMCF 14999990
IUCVPLST DC    40X'00'             IUCV parameter list storage          15000000
         AGO   .NDVMCFB                                        UPDTVMCF 15000005
.VMCFB   ANOP                                                  UPDTVMCF 15000010
CR0WORK  DS    F                  CR0 work area                UPDTVMCF 15000015
HNDXCALL DS    0D                                              UPDTVMCF 15000020
         DS    CL8                HNDEXT macro expansion       UPDTVMCF 15000025
         DS    A                  HNDEXT macro expansion       UPDTVMCF 15000030
*                                                              UPDTVMCF 15000035
MSINTRPT DS    0D                                              UPDTVMCF 15000040
         DS    XL(MSINPATL)       HNDEXT handler routine       UPDTVMCF 15000045
*                                                              UPDTVMCF 15000050
VMCFPLST DS    0D                                              UPDTVMCF 15000055
         DS    (VMCPLEN)D         VMCF Parameter list storage  UPDTVMCF 15000060
*                                                              UPDTVMCF 15000065
VMCMAREA DS    0D                 VMCF Communications Msg Hdr  UPDTVMCF 15000070
         DS    CL(VMCMLEN)                                     UPDTVMCF 15000075
SMSGTEXT DS    CL129              SMSG received here           UPDTVMCF 15000080
SMSGPRML EQU   *-VMCMAREA                                      UPDTVMCF 15000085
*                                                              UPDTVMCF 15000090
DIAG0DAT DS    4D                 Diagnose 0 response buffer   UPDTVMCF 15000095
DIAG0LEN EQU   *-DIAG0DAT                                      UPDTVMCF 15000100
.NDVMCFB ANOP                                                  UPDTVMVF 15000105
         EJECT                                                          15014990
WORKCL16 DS    CL16                                                     15020000
WORKDW1  EQU   WORKCL16,8          Work area                            15030000
WORKFW1  EQU   WORKCL16,4          Work area                            15040000
WORKFW2  EQU   WORKCL16+4,4        Work area                            15050000
CVTSAVE  DS    16F                 Save area for conversion routines    15060000
         SPACE 1                                                        15070000
RETCODE  DS    CL10                Return code                          15080000
         SPACE 2                                                        15090000
SAVEFRET DS    F                   Function return address              15100000
FNARG1   DS    CL8                 Function first argument              15110000
         SPACE 2                                                        15124990
MACAREA  DS    0D                  Align the following plists           15130000
         SPACE 1                                                        15140000
*-- DSECT for NUCEXT plist -----------------------------------*         15150000
DNLIST   DS    CL8 'NUCEXT'        Name                                 15160000
DNLNAME  DS    CL8 'RXLOCFN'       Function name                        15170000
DNLMASK  DS    X '00'              Mask                                 15180000
DNLKEY   DS    X '04'  SYSTEM for RXLOCFN   Key (04 - system,           15190000
*                                  E4 - user)                           15200000
DNLFLAG  DS    AL1 (SYSTEM)        NUCEXT Flag                          15210000
         DS    X '00'              Spare flags                          15220000
DNLADDR  DS    A                   Entry point address                  15230000
*                                  (CANCEL = 0)                         15240000
DNLUSER  DS    AL4 (*-*)           user word                            15250000
DLSTART  DS    A                   Start address                        15260000
DLNLLEN  DS    AL4 (FREELEN)       Length                               15270000
         SPACE 2                                                        15280000
         ORG   MACAREA                                                  15290000
HNDINTL  DC    CL8'HNDINT'         Handle interrupt CMS plist           15300000
         DC    CL4'SET'                                                 15310000
         DC    CL4'RDR1'                                                15320000
HNDINTA  DC    A(*-*)              Handler routine address              15330000
         DC    XL2'000C'                                                15340000
         DC    CL1'ASAP'                                                15350000
         DC    C'C'                                                     15360000
         DC    XL4'FFFFFFFF'                                            15370000
HNDINTLN EQU   *-HNDINTL                                                15380000
         AIF   (&VMCF).VMCFC                                   UPDTVMCF 15394985
         EJECT                                                          15394990
         ORG   MACAREA                                                  15400000
HNDIUCVL DS    (HLEN)X             HNDIUCV MF=L build area              15410000
         SPACE 1                                                        15420000
         ORG   MACAREA                                                  15430000
CMSIUCVL DS    (CLEN)X             CMSIUCV MF=L build area              15440000
         SPACE 1                                                        15450000
         ORG   MACAREA                                                  15460000
WAITECBL DS    (WLEN)X             WAITECB MF=L build area              15470000
.VMCFC ANOP                                                    UPDTVMVF 15470005
         AGO   .NOCONS6                                        CONSREMV 15470990
         SPACE 1                                                        15471000
         ORG   MACAREA                                                  15472000
CONSOLEL CONSOLE MF=L              CONSOLE MF=L build area              15473000
.NOCONS6 ANOP                                                  CONSREMV 15473005
         SPACE 1                                                        15474000
         ORG   MACAREA                                                  15475000
         DS    0F                      * Allign Shared Variable List    15476000
SHRLIST  DC    (SHVBLEN)X'00'          * Shared Variable list           15477000
SHRPLIST DC    (EARGLIST-EFPLIST)X'00' * 'EXECCOMM'call plist           15478000
         SPACE 2                                                        15480000
         ORG   MACAREA                                                  15490000
TYPLIN   DC    CL8'TYPLIN',X'01',AL3(0),C'B',X'00',AL2(0)               15500000
TYPBUFF  EQU   TYPLIN+9,3                                               15510000
TYPLEN   EQU   TYPLIN+14,2                                              15520000
         SPACE 2                                                        15530000
         ORG   MACAREA                                                  15540000
SCALLEFP DS    6F                  Extended plist workarea              15550000
SCALLTKP DC    CL8'EXEC'           Tokenized plist workarea             15560000
SCALLSEG DC    CL8'CALLEE'                                              15570000
         DC    8X'FF'                                                   15580000
         EJECT                                                          15590000
         ORG   MACAREA                                                  15600000
TWRTPLST DC    CL8'TAPEIO'         Handle TAPEIO CMS plist              15610000
         DC    CL8'WRITE'                                               15620000
         DC    CL4'TAP1'                                                15630000
         DC    AL1(0)                                                   15640000
TWRTADDR DC    AL3(*-*)            TAPE buffer address                  15650000
TWRTLEN  DC    A(*-*)              TAPE buffer length                   15660000
         DC    F'0'                                                     15670000
TWRTPLSL EQU   *-TWRTPLST                                               15680000
         SPACE 2                                                        15690000
         ORG   MACAREA                                                  15700000
DIAGA0   DC    CL24' '             RACF Diagnose plist area             15710000
         ORG   ,                                                        15720000
         SPACE 2                                                        15734990
ENABLE   EQU   X'27'               Enable CCW opcode                    15740000
DISABLE  EQU   X'2F'               Disable CCW opcode                   15750000
WRITE    EQU   X'01'               Write CCW opcode                     15760000
READ     EQU   X'02'               Read CCW opcode                      15770000
READNTO  EQU   X'0A'               Read CCW with no Timeout             15780000
READINHB EQU   X'0E'               Read CCW with password masking       15790000
SENSE    EQU   X'04'               Sense CCW opcode                     15800000
         SPACE 1                                                        15810000
CC       EQU   X'40'               Command Chain CCW flag               15820000
SILI     EQU   X'20'               Suppress Incorrect Length CCW flag   15830000
         SPACE 1                                                        15840000
LINECSW  DS    D                                                        15850000
SENSBYTE DC    X'00'                                                    15860000
         DS    0D                                                       15870000
CCWENABL CCW   ENABLE,0,SILI,1                        Enable            15880000
         SPACE 1                                                        15890000
CCWDISAB CCW   DISABLE,0,SILI,1                       Disable           15900000
         SPACE 1                                                        15910000
CCWWRITE CCW   WRITE,SENDBUF,CC+SILI,L'SENDBUF        Write data        15920000
CCWREAD  CCW   READ,RECVBUF,SILI,L'RECVBUF            Read response     15930000
         SPACE 1                                                        15940000
CCWSENSE CCW   SENSE,SENSBYTE,SILI,1                  Read sense byte   15950000
         SPACE 3                                                        15960000
SENDBUF  DS    CL256                                                    15970000
         SPACE 1                                                        15980000
RECVBUF  DS    CL8192                                                   15994990
         DS    0D                                                       16000000
LFNWKLEN EQU   (*-DMSLFNWK)/8                                           16010000
         EJECT                                                          16219990
DMSLFN   CSECT                                                          16580000
         SPACE 1                                                        16590000
*   pattern PLIST for invoking 'NUCEXT'                                 16600000
NLIST    DS    0D                  NUCEXT Plist                         16610000
         DC    CL8'NUCEXT'         Name                                 16620000
RXLOCFN  DC    CL8'RXLOCFN'        Function name                        16630000
         DC    X'FF'               System mask enabled                  16640000
         DC    X'04'               System key                           16650000
         DC    AL1(SYSTEM)         NUCEXT Flag                          16660000
         DC    X'00'               Spare flags                          16670000
         DC    A(0)                Entry point address                  16680000
         DC    AL4(*-*)            private                              16690000
         DC    A(0)                Start address                        16700000
         DC    F'0'                Length                               16710000
LNLIST   EQU   *-NLIST             Length of list                       16720000
         SPACE 2                                                        16730000
*-------------------------------------------------------------*         16740000
* List of functions included in this pack, with their offsets           16750000
FUNLNAME EQU   4,8                 Offset & length of name              16760000
FUNOFFS  EQU   0,4                 Offset to the routine                16770000
FUNLIST  DC    A($SMSG-DMSLFN),CL8'RX$SMSG'                             16780000
LENTRY   EQU   *-FUNLIST           Length of a single entry             16790000
         AIF   (&VMCF).VMCFD                                   UPDTVMCF 16799990
         DC    A($MSG-DMSLFN),CL8'RX$MSG'                               16800000
.VMCFD ANOP                                                    UPDTVMVF 16800005
         DC    A($TAPE-DMSLFN),CL8'RX$TAPE'                             16820000
         DC    A($WAIT-DMSLFN),CL8'RX$WAIT'                             16830000
         DC    A($TIMER-DMSLFN),CL8'RX$TIMER'                           16840000
         DC    A($ACGRP-DMSLFN),CL8'RX$ACGRP'                           16850000
         AGO   .NOCONS8                                        CONSREMV 16854990
         DC    A($CONSL-DMSLFN),CL8'RX$CONSL'                           16855000
.NOCONS8 ANOP                                                  CONSREMV 16855005
         DC    A($ASCLN-DMSLFN),CL8'RX$ASCLN'                           16860000
         DC    A($ASCR-DMSLFN),CL8'RX$ASCR'                             16870000
         DC    A($ASCW-DMSLFN),CL8'RX$ASCW'                             16880000
         DC    A($ASCWR-DMSLFN),CL8'RX$ASCWR'                           16890000
         DC    A($ASCWP-DMSLFN),CL8'RX$ASCWP'                           16900000
EFUNLIST DS    0H                  End of the funlist proper            16910000
         DC    A(*-*)              End fence                            16920000
         TITLE 'DMSLFN:  Common Convert ECBDIC Hex to Binary'           16930000
*-------------------------------------------------------------*         16940000
* This routine is a copy of the CP DMKCVTHB routine to convert*         16950000
* an EBCDIC string of hexadecimal characters into its binary  *         16960000
* equivalent.                                                 *         16970000
*                                                             *         16980000
* The expected input is:                                      *         16990000
*        - R0: length of field                                *         17000000
*        - R1: address of first byte of field                 *         17010000
*        - R14: the return address                            *         17020000
*        - R15: address of this routine                       *         17030000
*                                                             *         17040000
* The output is:                                              *         17050000
*        - R1: fullword binary equivalent of input if cc=0,   *         17060000
*          otherwise undefined.                               *         17070000
*        - all other registers are unchanged                  *         17080000
*                                                             *         17090000
* If errors are encountered in the input data, an error       *         17100000
* message is optionally displayed and return is taken to      *         17110000
* caller with non-zero return code. In this case the contents *         17120000
* of register 15 are destroyed.                               *         17130000
*                                                             *         17140000
* Operation:                                                  *         17150000
*        - Save registers                                     *         17160000
*        - Get next EBCDIC hex digit.                         *         17170000
*        - If digit >= "0" and <= "9", subtract X'F0';        *         17180000
*           Otherwise, OR the character with X'40' to convert *         17190000
*           it to uppercase, and if it falls in the range     *         17200000
*           "A" to "F" inclusive, subtract X'B7'.                       17210000
*           Otherwise indicate character error in field and   *         17220000
*            return with non-zero return code.                *         17230000
*        - Accumulate binary digits in R0.                    *         17240000
*        - Loop through entire field.                         *         17250000
*        - Restore registers and return                       *         17260000
*-------------------------------------------------------------*         17270000
         SPACE 3                                                        17280000
REXV600  DS    0H                                                       17290000
         STM   R0,R3,CVTSAVE       Save registers                       17310000
         LR    R3,R0               Save field length                    17320000
         SLR   R2,R2               Clear reg                            17330000
         LR    R0,R2               ...                                  17340000
REXV610  DS    0H                                                       17350000
         IC    R2,0(,R1)           Get digit                            17360000
         CLI   0(R1),C'0'          Greater than zero?                   17370000
         BL    REXV620             Br if not - try A-F                  17380000
           CLI   0(R1),C'9'          Greater than nine?                 17390000
           BH    REXV640             Br if yes - error                  17400000
           SL    R2,=A(C'0')         Make digit a hex number            17410000
           B     REXV630             Continue                           17420000
         SPACE 1                                                        17430000
REXV620  DS    0H                                                       17440000
         O     R2,=A(X'40')        Ensure upper case                    17450000
         CLM   R2,B'0001',=C'A'    Less than "A"?                       17460000
         BL    REXV640             Br if yes - error                    17470000
         CLM   R2,B'0001',=C'F'    Greater than "F"?                    17480000
         BH    REXV640             Br if yes - error                    17490000
         SL    R2,=A(C'A'-10)      Make char a hex number               17500000
REXV630  DS    0H                                                       17510000
         CLM   R0,B'1000',=X'0F'   Check for overflow into              17520000
*                                  High order nibble                    17530000
         BH    ERROR               Oops, we have an overflow!           17540000
*  NB:  The check above will catch a hex number which is too            17550000
*       large while at the same time allowing for virtually an          17560000
*       infinite number of leading zeros.                               17570000
         SLL   R0,4                Assemble next digit                  17580000
         ALR   R0,R2               ...                                  17590000
         LA    R1,1(,R1)           Bump pointer                         17600000
         BCT   R3,REXV610          Loop through entire field            17610000
*        Drop thru when no more digits to convert                       17620000
         ST    R0,CVTSAVE+4        Result where R1 will get it          17630000
         SR    R0,R0               Set condition code = 0               17640000
         LM    R0,R3,CVTSAVE       Restore registers                    17650000
         BR    R14                 Return                               17660000
         SPACE 2                                                        17670000
REXV640  DS    0H                                                       17680000
         TM    DISPMSGS,L'DISPMSGS Display messages?                    17690000
         BZ    NODISPL3            Br if not                            17700000
         LA    R1,MSG3             Get message address                  17720000
         MVC   TYPLIN(TYPPATLN),TYPPAT Set pattern plist                17730000
         STCM  R1,B'0111',TYPBUFF  Set it in PLIST                      17740000
         LA    R2,L'MSG3           Get message length                   17750000
         STH   R2,TYPLEN           Set it in PLIST                      17760000
         OI    TYPLIN+13,X'40'     Request message editing              17770000
         LA    R1,TYPLIN           Point at PLIST                       17780000
         SVC   CMS202              Give it to CMS                       17790000
         DC    AL4(1)              Ignore errors                        17800000
NODISPL3 DS    0H                  Here to skip message display         17820000
         LM    R0,R3,CVTSAVE       Restore registers                    17830000
         LTR   R14,R14             Set non-zero condition code.         17844990
         BR    R14                 Return to caller                     17850000
     TITLE 'DMSLFN:  Common Convert ECBDIC Decimal to Binary'           17870000
*-------------------------------------------------------------*         17880000
* This routine is a copy of the CP DMKCVTDB routine to convert*         17890000
* an EBCDIC string of decimal characters into its binary      *         17900000
* equivalent.                                                 *         17910000
* The expected input is:                                      *         17920000
*        - R0: length of field                                *         17930000
*        - R1: address of first byte of field                 *         17940000
*        - R15: address of this routine                       *         17950000
*                                                             *         17960000
* The output is:                                              *         17970000
*        - R0: undefined                                      *         17980000
*        - R1: fullword binary equivalent of input            *         17990000
*        - all other registers are unchanged                  *         18000000
*        - the condition code is zero                         *         18010000
*                                                             *         18020000
* If errors are encountered in the input data, an error       *         18030000
* message is optionally displayed and return is taken to      *         18040000
* caller with non-zero condition code.                        *         18050000
*                                                             *         18060000
* Operation:                                                  *         18070000
*        - Save registers.                                    *         18080000
*        - If R0 greater than 9 digits, indicate error.       *         18090000
*        - Validity check all decimal digits.                 *         18100000
*        - Pack field.                                        *         18110000
*        - Convert result to binary.                          *         18120000
*        - Restore registers and return                       *         18130000
*-------------------------------------------------------------*         18140000
         SPACE 3                                                        18150000
REXV650  DS    0H                                                       18160000
         STM   R1,R2,CVTSAVE       Save registers                       18180000
         C     R0,=F'9'            More than 9 digits?                  18190000
         BH    REXV690             Br if yes - error                    18200000
         LR    R2,R0               Get length of field                  18210000
         BCTR  R2,0                Decrement for EX                     18220000
REXV660  DS    0H                                                       18230000
         CLI   0(R1),C'0'          Less than zero?                      18240000
         BL    REXV690             Br if yes - error                    18250000
         CLI   0(R1),C'9'          Greater than nine?                   18260000
         BH    REXV690             Br if yes - error                    18270000
         LA    R1,1(,R1)           Point at next digit                  18280000
         BCT   R0,REXV660          Continue                             18290000
         L     R1,CVTSAVE          Restore address                      18300000
         EX    R2,PACK             Pack the value                       18310000
         CVB   R1,WORKDW1          Convert value to binary              18320000
         SR    R2,R2               Set condition code = 0               18330000
         L     R2,CVTSAVE+4        Restore register                     18340000
         BR    R14                 Return                               18350000
         SPACE 1                                                        18360000
PACK     PACK  WORKDW1,0(0,R1)     EXecuted PACK instruction            18370000
         SPACE 2                                                        18380000
REXV690  DS    0H                                                       18390000
         TM    DISPMSGS,L'DISPMSGS Display messages?                    18400000
         BZ    NODISPL4            Br if not                            18410000
         LA    R1,MSG4             Get message address                  18430000
         MVC   TYPLIN(TYPPATLN),TYPPAT Set pattern plist                18440000
         STCM  R1,B'0111',TYPBUFF  Set it in PLIST                      18450000
         LA    R1,L'MSG4           Get message length                   18460000
         STH   R1,TYPLEN           Set it in PLIST                      18470000
         OI    TYPLIN+13,X'40'     Request message editing.             18480000
         LA    R1,TYPLIN           Point at PLIST                       18490000
         SVC   CMS202              Give it to CMS                       18500000
         DC    AL4(1)              Ignore errors                        18510000
NODISPL4 DS    0H                  Br target to skip message            18530000
         L     R2,CVTSAVE+4        Restore register                     18540000
         LTR   R14,R14             Set non-zero condition code          18554990
         BR    R14                 Return to caller                     18560000
         SPACE 2                                                        18580000
MSG1     DC    C'DMSLFN070E Invalid parameter'                          18590000
MSG2     DC    C'DMSLFN450E Machine storage exhausted'                  18600000
MSG3     DC    C'DMSLFN462E Invalid Hex constant'                       18610000
MSG4     DC    C'DMSLFN466E Invalid whole number'                       18620000
         LTORG ,                                                        18630000
     TITLE 'DMSLFN:  Constants and translate tables'                    18640000
NOPARITY DC    (L'SENDBUF)X'7F'    AND mask to remove  parity           18650000
MKPARITY DC    (L'SENDBUF)X'80'    OR mask to set mark parity           18660000
*                                                                       18670000
*        TTY UASCII-8 LEVEL TERMINAL CODE -> EBCDIC                     18680000
*                                                                       18690000
ASCI2EBC DS    0X                                                       18700000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       18710000
         DC    X'00007C7C404079791010D7D7F0F09797' 00                   18720000
         DC    X'1616C8C84D4D88881818E7E7F8F8A7A7' 10                   18730000
         DC    X'3737C4C45B5B84843C3CE3E3F4F4A3A3' 20                   18740000
         DC    X'0C0CD3D36B6B93931C1CE0E04C4C4F4F' 30                   18750000
         DC    X'0202C2C27F7F82821212D9D9F2F29999' 40                   18760000
         DC    X'2525D1D15C5C91913F3FE9E97A7AA9A9' 50                   18770000
         DC    X'2E2EC6C6505086863232E5E5F6F6A5A5' 60                   18780000
         DC    X'0E0ED5D54B4B95951E1E5F5F6E6EA1A1' 70                   18790000
         DC    X'0101C1C15A5A81811111D8D8F1F19898' 80                   18800000
         DC    X'0505C9C95D5D89891919E8E8F9F9A8A8' 90                   18810000
         DC    X'2D2DC5C56C6C85853D3DE4E4F5F5A4A4' A0                   18820000
         DC    X'0D0DD4D4606094941D1DBDBD7E7ED0D0' B0                   18830000
         DC    X'0303C3C37B7B83831313E2E2F3F3A2A2' C0                   18840000
         DC    X'0B0BD2D24E4E92922727ADAD5E5EC0C0' D0                   18850000
         DC    X'2F2FC7C77D7D87872626E6E6F7F7A6A6' E0                   18860000
         DC    X'0F0FD6D6616196961F1F6D6D6F6F0707' F0                   18870000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       18880000
*                                                                       18890000
*        EBCDIC -> TTY UASCII-8 LEVEL TERMINAL CODE                     18900000
*                                                                       18910000
EBC2ASCI DS    0X                                                       18920000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       18930000
         DC    X'018141C1FF91FFFFFFFFFFD131B171F1' 00                   18940000
         DC    X'098949C9FF5111011999FFFF39B979F9' 10                   18950000
         DC    X'FFFFFFFFFF51E9D9FFFFFFFFFFA161E1' 20                   18960000
         DC    X'FFFF69FFFFFFFF21FFFFFFFF29A9FF59' 30                   18970000
         DC    X'05FFFFFFFFFFFFFFFFFFFF753D15D53F' 40                   18980000
         DC    X'65FFFFFFFFFFFFFFFFFF85255595DD7B' 50                   18990000
         DC    X'B5F5FFFFFFFFFFFFFFFF3F35A5FB7DFD' 60                   19000000
         DC    X'FFFFFFFFFFFFFFFFFF075DC503E5BD45' 70                   19010000
         DC    X'FF8747C727A767E71797FFFFFFFFFFFF' 80                   19020000
         DC    X'FF57D737B777F70F8F4FFFFFFFFFFFFF' 90                   19030000
         DC    X'FF7FCF2FAF6FEF1F9F5FFFFFFFDBFFFF' A0                   19040000
         DC    X'FFFFFFFFFFFFFFFFFFFFFFFFFFBBFFFF' B0                   19050000
         DC    X'DE8343C323A363E31393FFFFFFFFFFFF' C0                   19060000
         DC    X'BF53D333B373F30B8B4BFFFFFFFFFFFF' D0                   19070000
         DC    X'3BFFCB2BAB6BEB1B9B5BFFFFFFFFFFFF' E0                   19080000
         DC    X'0D8D4DCD2DAD6DED1D9DFFFFFFFFFFFF' F0                   19090000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       19100000
         EJECT                                                          19110000
         ORG   *-256         Substitute even parity table               19124990
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       19130000
         DC    X'008141C0599059FF595959D130B171F0' 0                    19140000
         DC    X'098848C9595011001899595939B878F9' 1                    19150000
         DC    X'595959595950E8D85959595959A060E1' 2                    19160000
         DC    X'59596959595959215959595929A95959' 3                    19170000
         DC    X'05595959595959595959DB743C14D47B' 4                    19180000
         DC    X'6559595959595959595984245595DD3A' 5                    19190000
         DC    X'B4F559595959595959593F35A5FA7DFC' 6                    19200000
         DC    X'595959595959595959065CC503E4BD44' 7                    19210000
         DC    X'598747C627A666E7179659DE59595959' 8                    19220000
         DC    X'5956D736B777F60F8E4E59BE59595959' 9                    19230000
         DC    X'597ECF2EAF6FEE1E9F5F595959595959' A                    19240000
         DC    X'59595959595959595959595959BB5959' B                    19250000
         DC    X'DE8242C322A363E2129359595959593A' C                    19260000
         DC    X'BE53D233B272F30A8B4B595959595959' D                    19270000
         DC    X'3A59CA2BAA6AEB1B9A5A595959595959' E                    19280000
         DC    X'0C8D4DCC2DAC6CED1D9C595959595959' F                    19290000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       19300000
         SPACE 2                                                        19310000
BITFLIP  DS    0X                                                       19320000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       19330000
         DC    X'008040C020A060E0109050D030B070F0' 0                    19340000
         DC    X'088848C828A868E8189858D838B878F8' 1                    19350000
         DC    X'048444C424A464E4149454D434B474F4' 2                    19360000
         DC    X'0C8C4CCC2CAC6CEC1C9C5CDC3CBC7CFC' 3                    19370000
         DC    X'028242C222A262E2129252D232B272F2' 4                    19380000
         DC    X'0A8A4ACA2AAA6AEA1A9A5ADA3ABA7AFA' 5                    19390000
         DC    X'068646C626A666E6169656D636B676F6' 6                    19400000
         DC    X'0E8E4ECE2EAE6EEE1E9E5EDE3EBE7EFE' 7                    19410000
         DC    X'018141C121A161E1119151D131B171F1' 8                    19420000
         DC    X'098949C929A969E9199959D939B979F9' 9                    19430000
         DC    X'058545C525A565E5159555D535B575F5' A                    19440000
         DC    X'0D8D4DCD2DAD6DED1D9D5DDD3DBD7DFD' B                    19450000
         DC    X'038343C323A363E3139353D333B373F3' C                    19460000
         DC    X'0B8B4BCB2BAB6BEB1B9B5BDB3BBB7BFB' D                    19470000
         DC    X'078747C727A767E7179757D737B777F7' E                    19480000
         DC    X'0F8F4FCF2FAF6FEF1F9F5FDF3FBF7FFF' F                    19490000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       19500000
         EJECT                                                          19510000
PARITYO  DS    0X                                                       19520000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       19530000
         DC    X'800102830485860708898A0B8C0D0E8F' 0                    19540000
         DC    X'109192139415169798191A9B1C9D9E1F' 1                    19550000
         DC    X'20A1A223A42526A7A8292AAB2CADAE2F' 2                    19560000
         DC    X'B03132B334B5B63738B9BA3BBC3D3EBF' 3                    19570000
         DC    X'40C1C243C44546C7C8494ACB4CCDCE4F' 4                    19580000
         DC    X'D05152D354D5D65758D9DA5BDC5D5EDF' 5                    19590000
         DC    X'E06162E364E5E66768E9EA6BEC6D6EEF' 6                    19600000
         DC    X'70F1F273F47576F7F8797AFB7CFDFE7F' 7                    19610000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       19620000
         SPACE 2                                                        19630000
PARITYE  DS    0X                                                       19640000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       19650000
         DC    X'008182038405068788090A8B0C8D8E0F' 0                    19660000
         DC    X'901112931495961718999A1B9C1D1E9F' 1                    19670000
         DC    X'A02122A324A5A62728A9AA2BAC2D2EAF' 2                    19680000
         DC    X'30B1B233B43536B7B8393ABB3CBDBE3F' 3                    19690000
         DC    X'C04142C344C5C64748C9CA4BCC4D4ECF' 4                    19700000
         DC    X'50D1D253D45556D7D8595ADB5CDDDE5F' 5                    19710000
         DC    X'60E1E263E46566E7E8696AEB6CEDEE6F' 6                    19720000
         DC    X'F07172F374F5F67778F9FA7BFC7D7EFF' 7                    19730000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       19740000
         DS    0D                  Get to doubleword boundary           19760000
FREELEN  EQU   *-FREEGO            Bytes of free store code.            19775990
FREELEND EQU   (*-FREEGO+7)/8      Doublewords of free store            19781980
*                                  code.                                19790000
         TITLE 'DMSLFN: Initialization code (transient area)'           19800000
LFNINIT  DS    0D                                                       19810000
         SR    R11,R11             No workarea allocated yet            19830000
         LR    R5,R14              Save return address                  19844990
         LA    R15,12              Preset RC in case bad plist          19850000
         SLR   R2,R2               Assume it's NUCEXT 'RXLOCFN'         19860000
         CLI   ARG1(R1),X'FF'      Any arguments?                       19870000
         BE    GOLOAD              Br if not - go install               19880000
         CLC   ARG1(8,R1),=CL8'LOAD'   Is this explicit load?           19890000
         BNER  R5                  Br if not - go complain              19904990
*        Note:  We do not have to handle RESET because the              19910000
*               package has not yet been loaded                         19920000
         SPACE 1                                                        19930000
*-> LOAD request, so check function name against FUNLIST                19940000
         SPACE 1                                                        19950000
         LA    R6,LENTRY           Length of FUNLIST entry              19960000
         LA    R2,FUNLIST          Start of function table              19979990
         LA    R7,EFUNLIST-FUNLIST(,R2) End of function table           19990000
CHECK    DS    0H                                                       20000000
         CLC   ARG2(,R1),FUNLNAME(R2) Names match?                      20010000
         BE    GOLOAD              Br if yes - go do                    20020000
*                                  appropriate NUCEXTing.               20030000
         BXLE  R2,R6,CHECK         Continue testing if more             20040000
         LA    R15,1               Indicate function not found          20050000
         BR    R5                  Not in list - return                 20064990
         SPACE 1                                                        20070000
*=> NUCEXT "RXLOCFN" as well as specific function (e.g. if              20080000
*   LOAD specified on invocation).                                      20090000
         SPACE 1                                                        20100000
GOLOAD   DS    0H                                                       20110000
         SR    R11,R11                                                  20120000
         LA    R0,LFNWKLEN                                              20130000
         DMSFREE DWORDS=(0),TYPE=NUCLEUS,ERR=NOSTOREI                   20140000
         LR    R11,R1                                                   20150000
         SPACE 1                                                        20160000
         SPKA  0                   Set nucleus key                      20170000
         LA    R0,LFNWKLEN         Account for NUCLEUS type storage     20180000
         A     R0,NUCXFRES            allocated outside of the          20190000
         ST    R0,NUCXFRES               area described in the SCBLOCK  20200000
         SPACE 1                                                        20210000
         XC    DMSLFNWK(LFNWKCLR),DMSLFNWK Initialize cleared area      20220000
         EJECT                                                          20230000
         LA    R0,FREELEND         Length of code in DWs                20240000
*                                  Get the storage                      20250000
         DMSFREE DWORDS=(0),TYPE=NUCLEUS,ERR=NOSTOREI                   20260000
         LA    R8,FREEGO           Start of free storage code           20270000
         LA    R9,FREELEND         Length of code in DWs                20280000
         SLL   R9,3                "      "  "    "  bytes              20290000
         LR    R7,R9               Copy length for MVCL                 20300000
         LR    R4,R9               Save for later use                   20310000
         LR    R3,R1                      ""                            20320000
         LR    R6,R1               Free storage area start              20330000
         MVCL  R6,R8               Move code to free storage            20340000
         SPACE 1                                                        20350000
         MVC   LFRETURN(LFRETLEN),LFRETPAT Copy instructions to LFNWK   20355000
         MVC   IOLINEGO(IOLINELN),$IOLINE Copy interrupt handler        20360000
         MVC   IORDRGO(IORDRLN),$IORDR    "    "         "              20370000
         MVC   TIMUPGO(TIMUPLN),$TIMUP    "    "         "              20380000
         AGO   .NOCONS9                                        CONSREMV 20384990
         MVC   CONSEGO(CONSELN),$CONSE    "    "         "              20385000
.NOCONS9 ANOP                                                  CONSREMV 20385005
         SPACE 1                                                        20390000
         MVC   CCWENABL(CCWPATLN),CCWPAT Initialize CCW's               20400000
         L     R15,CCWWRITE        Relocate address                     20410000
         ALR   R15,R11               in ASCII line CCWs                 20420000
         ST    R15,CCWWRITE                                             20430000
         L     R15,CCWREAD                                              20440000
         ALR   R15,R11                                                  20450000
         ST    R15,CCWREAD                                              20460000
         L     R15,CCWSENSE                                             20470000
         ALR   R15,R11                                                  20480000
         ST    R15,CCWSENSE                                             20490000
         SPACE 1                                                        20500000
         LA    R15,FREEGO-DMSLFN   Back up and set                      20510000
         SLR   R3,R15                 a fake base register              20520000
         ST    R3,LFNBASE1               behind copied code             20531990
         LA    R15,2048(,R3)                                            20533980
         LA    R15,2048(,R15)      Second base                          20535970
         ST    R15,LFNBASE2                                             20537960
         EJECT                                                          20540000
         LA    R15,NLIST                                                20550000
         MVC   DNLIST(LNLIST),0(R15) Setup pattern plist                20560000
         ST    R1,DNLADDR          Entry point address                  20570000
         ST    R1,DLSTART          Start address                        20580000
         MVI   DNLFLAG,SYSTEM+SERVICE Request service call              20590000
         ST    R4,DLNLLEN          Length                               20600000
         ST    R11,DNLUSER                                              20610000
         LA    R1,DNLIST            -> PLIST                            20620000
         SVC   CMS202                                                   20630000
         DC    AL4(1)              Fall through if error                20640000
         LTR   R15,R15             Did everything go smoothly?          20650000
         BNZ   INIXIT              No, return directly.                 20660000
         SPACE 2                                                        20670000
*-> See if we have a function....                                       20680000
         LTR   R2,R2               Install "RXLOCFN" only?              20690000
         BZR   R5                  Br if yes - return to caller         20704990
*        R15 already 0 from above....Use to clear fields                20710000
         ST    R15,DLSTART          ..start address                     20720000
         ST    R15,DLNLLEN          ..length                            20730000
         MVI   DNLFLAG,SYSTEM        .. no service calls!               20740000
         SPACE 1                                                        20750000
* R2 points to FUNLIST entry to be installed.                           20760000
* R3 points to start of NUCXLOADed area.                                20770000
         A     R3,FUNOFFS(,R2)     Calculate true start address         20780000
         ST    R3,DNLADDR          Add to startup PSW                   20790000
         MVC   DNLNAME,FUNLNAME(R2) Copy startup name                   20800000
*   Issue SVC...                                                        20810000
         LA    R1,DNLIST            -> PLIST                            20820000
         SVC   CMS202                                                   20830000
         DC    AL4(1)              Immediate exit on error              20840000
         BR    R5                  Return to caller                     20854990
         SPACE 2                                                        20860000
NOSTOREI DS    0H                                                       20870000
         LA    R15,16                                                   20880000
INIXIT   DS    0H                                                       20890000
         LTR   R1,R11              Allocated workarea yet??             20900000
         BZR   R5                  No, just return                      20914990
         LR    R11,R15             Hold RC for a second                 20920000
         SPACE 1                                                        20930000
         LA    R15,LFNWKLEN        Account for NUCLEUS type storage     20940000
         L     R0,NUCXFRES            allocated outside of the          20950000
         SLR   R0,R15                    area described in the SCBLOCK  20960000
         ST    R0,NUCXFRES                                              20970000
         SPACE 1                                                        20980000
         LA    R0,LFNWKLEN                                              20990000
         DMSFRET DWORDS=(0),LOC=(1)                                     21000000
         LR    R15,R11             Restore RC                           21010000
         BR    R5                                                       21021990
         LTORG ,                                                        21023980
         DC    (8192-(*-DMSLFN))X'00' Pad out to 8K transient area size 21025970
         END                                                            21030000