     TITLE 'DMSNXT: Load text for a Nucleus Extension'                  00010000
**************************************************************          00020000
* Establish a Nucleus Extension from a TEXT file. Current    *          00030000
*        MODULEs are non-relocatable, so we use TEXT files   *          00040000
*        for Extension establishment                         *          00050000
**************************************************************          00060000
DMSNXT   CSECT                                                          00070000
         USING NUCON,0                                                  00080000
         STM   R14,R12,12(R13)                                          00090000
         LR    R12,R15                                                  00100000
         USING DMSNXT,R12                                               00110000
*                                                                       00120000
         LA    R3,8(,R1)          Point to name in Plist                00130000
         CLI   0(R3),X'FF'        Present?                              00140000
         BE    NONAME             No, Name is missing                   00150000
         CLI   0(R3),C'('                                               00160000
         BE    NONAME             No, Name is missing                   00170000
         MVC   EXTNAME,0(R3)      Hold it here                          00180000
         MVC   TEXTNAME,0(R3)       and here                            00190000
         LA    R3,8(,R3)          Skip to next parameter                00200000
*                                                                       00210000
         CLI   0(R3),X'FF'        Any options?                          00220000
         BE    OPTSET             No, that's OK                         00230000
         CLI   0(R3),C'('                                               00240000
         BE    HAVEOPT            Process options if so                 00250000
         MVC   TEXTNAME,0(R3)     TEXTNAME is not EXTNAME               00260000
         LA    R3,8(,R3)          Skip to next parameter                00270000
*                                                                       00280000
         CLI   0(R3),X'FF'        Any options?                          00290000
         BE    OPTSET             No, that's OK                         00300000
         CLI   0(R3),C'('                                               00310000
         BE    HAVEOPT            Process options if so                 00320000
         B     INVOPT             Invalid argument                      00330000
*                                                                       00340000
HAVEOPT  DS    0H                                                       00350000
         LA    R3,8(,R3)          Skip to 1st Option name               00360000
         CLI   0(R3),X'FF'        Any options?                          00370000
         BE    OPTSET             No, that's OK                         00380000
OPTLKUP  DS    0H                                                       00390000
         LA    R15,7(,R3)         Point to byte 8 of option             00400000
         CLI   0(R15),C' '        Is is blank                           00410000
         BNE   *+8                Yes skip out                          00420000
         BCT   R15,*-8            Go test previous byte                 00430000
*                                                                       00440000
         LA    R15,1(,R15)                                              00450000
         SR    R15,R3             User supplied option length           00460000
         BCTR  R15,0                 minus one                          00470000
*                                                                       00480000
         LA    R2,OPTTBL          Start of option table                 00490000
         LA    R4,OPTTBLNE        Number of entries                     00500000
OPTLKUP2 DS    0H                                                       00510000
         CLM   R15,B'0001',8(R2)  Check against entry min size          00520000
         BL    OPTLKUP3           Provided name too short               00530000
         CLC   0(*-*,R2),0(R3)                                          00540000
         EX    R15,*-6            Does this option name match?          00550000
         BNE   OPTLKUP3           If, not, go check next                00560000
*                                                                       00570000
         OC    OPTFLAG,9(R2)      Set option bit                        00580000
*                                                                       00590000
         LA    R3,8(,R3)          Step to next token                    00600000
         CLI   0(R3),X'FF'        Any more options?                     00610000
         BNE   OPTLKUP            Go process if so                      00620000
         B     OPTSET             Continue below                        00630000
*                                                                       00640000
OPTLKUP3 DS    0H                                                       00650000
         LA    R2,OPTENTLN(,R2)   Skip to next tbl entry                00660000
         BCT   R4,OPTLKUP2          and go check that one               00670000
         B     INVOPT             No match on supplied option           00680000
*                                                                       00690000
OPTSET   DS    0H                 All option bits are set               00700000
*                                                                       00710000
         NUCEXT QUERY,NAME=EXTNAME Does it exist?                       00720000
         LTR   R15,R15                                                  00730000
         BNZ   LOADIT             Skip if not                           00740000
         LR    R2,R1              SCBLOCK address                       00750000
         USING SCBLOCK,R2                                               00760000
*                                                                       00770000
         CLC   SCBNAME,EXTNAME    Check for correct name                00780000
         BNE   ABEND1             Something failed                      00790000
         TM    OPTFLAG,OPTPUSH    Override what is there?               00800000
         BZ    ALREADY            No, say already loaded                00810000
*                                                                       00820000
* We don't know how much storage to allocate, so we do a regular        00830000
* load to determine the amount to allocate.                             00840000
LOADIT   DS    0H                                                       00850000
         L     R3,MAINHIGH        Here is a safe load area              00860000
         ST    R3,TEMPSAVE                                              00870000
         UNPK  TEMPSAVE+8(9),TEMPSAVE(5) Convert to                     00880000
         TR    TEMPSAVE+8(8),HEXTAB-C'0'   printable hex                00890000
         LM    R0,R1,TEMPSAVE+8   Address in hex chars                  00900000
         SLDL  R0,16              Make it                               00910000
         ICM   R1,B'0011',=CL2' '    six hex digits                     00920000
         STM   R0,R1,TEXTLDAD     Set Load address in cmd               00930000
         IPK   ,                                                        00940000
         SPKA  0                  Switch to Key 0                       00950000
         OI    MODFLGS,SYSLOAD    Skip loader address checks            00960000
         LA    R1,TEXTLOAD                                              00970000
         SVC   202                Load the TEXT file                    00980000
         DC    AL4(1)                                                   00990000
         LTR   R15,R15                                                  01000000
         BZ    LOADOK             Skip if if OK                         01010000
         SPKA  0(R2)              Back to User protect key              01020000
         B     LOADERR            Tell caller about LOAD error          01030000
*                                                                       01040000
LOADOK   DS    0H                                                       01050000
         L     R4,LOCCNT          Next load point is the end            01060000
*                                    of what we just loaded             01070000
         XC    LOCCNT,LOCCNT      Zero it for next load                 01080000
         SPKA  0(R2)              Back to User protect key              01090000
         LR    R2,R4              LOCCNT back to R2                     01100000
         SR    R2,R3              Calculate size we loaded              01110000
         LA    R4,7(,R2)                                                01120000
         SRL   R4,3               Size in doublewords                   01130000
         LR    R0,R4                                                    01140000
         TM    OPTFLAG,OPTSYS     If SYSTEM use NUCLEUS storage         01150000
         BO    ALLOCNUC           Else USER                             01160000
         DMSFREE DWORDS=(0),TYPE=USER,ERR=NOSTOR                        01170000
         B     ALLOCOK                                                  01180000
ALLOCNUC DS    0H                                                       01190000
         DMSFREE DWORDS=(0),TYPE=NUCLEUS,ERR=NOSTOR                     01200000
ALLOCOK  DS    0H                                                       01210000
         LR    R3,R1              Load area address                     01220000
*                                                                       01230000
         ST    R3,TEMPSAVE                                              01240000
         UNPK  TEMPSAVE+8(9),TEMPSAVE(5) Convert to                     01250000
         TR    TEMPSAVE+8(8),HEXTAB-C'0'   printable hex                01260000
         LM    R0,R1,TEMPSAVE+8   Address in hex chars                  01270000
         SLDL  R0,16              Make it                               01280000
         ICM   R1,B'0011',=CL2' '    six hex digits                     01290000
         STM   R0,R1,TEXTLDAD     Set Load address in cmd               01300000
         IPK   ,                                                        01310000
         SPKA  0                                                        01320000
         OI    MODFLGS,SYSLOAD    Skip loader address checks            01330000
         LA    R1,TEXTLOAD                                              01340000
         SVC   202                Load the TEXT file                    01350000
         DC    AL4(1)                                                   01360000
         LTR   R15,R15                                                  01370000
         BZ    SETUPNX            Worked. Go establish Ext.             01380000
         SPKA  0(R2)              Back to user key                      01390000
*                                                                       01400000
         LR    R5,R15             Hold LOAD rc                          01410000
         LR    R1,R3              Allocated area address                01420000
         LR    R0,R4                             size in dwds           01430000
         DMSFRET DWORDS=(0),LOC=(1)                                     01440000
         LR    R15,R5             LOAD rc                               01450000
         B     LOADERR            Tell caller about LOAD error          01460000
*                                                                       01470000
SETUPNX  DS    0H                                                       01480000
         XC    LOCCNT,LOCCNT      Clear out the evidence                01490000
         SPKA  0(R2)              Back to user key                      01500000
*                                                                       01510000
         SLL   R4,3               Length back to bytes                  01520000
         L     R2,STRTADDR        Entry point address                   01530000
         NUCEXT SET,NAME=EXTNAME,ENTRY=(R2),                           *01540000
               ORIGIN=((R3),(R4)),SYSTEM=(OPTFLAG,OPTSYS),             *01550000
               SERVICE=(OPTFLAG,OPTSERV),ENDCMD=(OPTFLAG,OPTENDCM),    *01560000
               PERM=(OPTFLAG,OPTPERM)                                   01570000
         LTR   R15,R15                                                  01580000
         BZ    EXIT0              Exit if successful                    01590000
*                                                                       01600000
         LR    R5,R15             Hold RC                               01610000
         SRL   R4,3               Length back to dwds                   01620000
         LR    R1,R3              Allocated area address                01630000
         LR    R0,R4                             size in dwds           01640000
         DMSFRET DWORDS=(0),LOC=(1)                                     01650000
*                                                                       01660000
         LINEDIT TEXT='NUCEXT return code .....',                      *01670000
               SUB=(DEC,(R5))                                           01680000
         LA    R15,24             Not found RC                          01690000
         B     GOBACK             Done                                  01700000
*                                                                       01710000
NONAME   DS    0H                                                       01720000
         LINEDIT TEXT='No filename specified'                           01730000
         LA    R15,24                                                   01740000
         B     GOBACK             Done                                  01750000
*                                                                       01760000
NOSTOR   DS    0H                                                       01770000
         LINEDIT TEXT='Insufficient storage available'                  01780000
         LA    R15,24                                                   01790000
         B     GOBACK             Done                                  01800000
*                                                                       01810000
INVOPT   DS    0H                                                       01820000
         LINEDIT TEXT='Invalid option: ........',                      *01830000
               SUB=(CHARA,((R3),8))                                     01840000
         LA    R15,24             Not found RC                          01850000
         B     GOBACK             Done                                  01860000
*                                                                       01870000
LOADERR  DS    0H                                                       01880000
         LR    R3,R15                                                   01890000
         LINEDIT TEXT='LOAD command return code .....',                *01900000
               SUB=(DEC,(R3))                                           01910000
         LA    R15,24             Not found RC                          01920000
         B     GOBACK             Done                                  01930000
*                                                                       01940000
ALREADY  DS    0H                                                       01950000
         LINEDIT TEXT='........ already loaded',                       *01960000
               SUB=(CHARA,EXTNAME)                                      01970000
         LA    R15,24             Not found RC                          01980000
         B     GOBACK             Done                                  01990000
*                                                                       02000000
EXIT0    DS    0H                                                       02010000
         SR    R15,R15                                                  02020000
GOBACK   DS    0H                                                       02030000
         L     R14,12(,R13)                                             02040000
         LM    R0,R12,20(R13)                                           02050000
         BR    R14                                                      02060000
  TITLE 'DMSNXT: Constants and work areas'                              02070000
HEXTAB   DC    C'0123456789ABCDEF' TRANSLATE TABLE                      02080000
*------------------------------------------------------------*          02090000
*                                                            *          02100000
* The option table format is:                                *          02110000
*        Option name               8 characters              *          02120000
*        Minimum name length - 1   1 byte numeric            *          02130000
*        Option bit          -     Flag set for option       *          02140000
*                                                            *          02150000
*------------------------------------------------------------*          02160000
OPTTBL   DS    0D  Name      Minimum length - 1, Flag Bit               02170000
         DC    CL8'SYSTEM  ',AL1(2-1,OPTSYS)                            02180000
OPTENTLN EQU   *-OPTTBL          Length of an entry                     02190000
         DC    CL8'SERVICE ',AL1(2-1,OPTSERV)                           02200000
         DC    CL8'PERMANEN',AL1(4-1,OPTPERM)                           02210000
         DC    CL8'ENDCMD  ',AL1(2-1,OPTENDCM)                          02220000
         DC    CL8'PUSH    ',AL1(1-1,OPTPUSH)                           02230000
OPTTBLNE EQU   (*-OPTTBL)/OPTENTLN Number of entries                    02240000
*                                                                       02250000
OPTFLAG  DC    X'00'             Option flag byte                       02260000
OPTSYS   EQU   X'80'             SYSTEM                                 02270000
OPTSERV  EQU   X'40'             SERVICE                                02280000
OPTPERM  EQU   X'20'             PERMANENT                              02290000
OPTENDCM EQU   X'10'             ENDCMD                                 02300000
OPTPUSH  EQU   X'08'             PUSH                                   02310000
*                                                                       02320000
* CMS LOAD command                                                      02330000
*                                                                       02340000
TEXTLOAD DS    0D                                                       02350000
         DC    CL8'LOAD'                                                02360000
TEXTNAME DC    CL8' '             Name of TEXT file to load             02370000
         DC    CL8'('                                                   02380000
         DC    CL8'NOMAP'                                               02390000
         DC    CL8'ORIGIN'                                              02400000
TEXTLDAD DC    CL8' '             Load address for TEXT file            02410000
         DC    8X'FF'                                                   02420000
*                                                                       02430000
EXTNAME  DC    CL8' '             Nucleus Extension name                02440000
*                                                                       02450000
TEMPSAVE DS    CL16               Conversion work area                  02460000
*                                                                       02470000
ABEND1   ABEND 1                                                        02480000
         EJECT ,                                                        02490000
         REGEQU ,                                                       02500000
         SCBLOCK ,                                                      02510000
         NUCON ,                                                        02520000
         END                                                            02530000