RES      TITLE 'DMSRES - CMS RESIDENT CORE LIBRARY PROCESSOR'           00010000
*MODULE NAME -                                                          00020000
*                                                                       00030000
*        DMSRES                                                         00040000
*                                                                       00050000
*FUNCTION -                                                             00060000
*                                                                       00070000
*        TO ASSIST A USER IN MAINTAINING A RESIDENT CORE LIBRARY.       00080000
*                                                                       00090000
*ENTRY POINTS -                                                         00100000
*                                                                       00110000
*        DMSRES                                                         00120000
*                                                                       00130000
*ENTRY CONDITIONS -                                                     00140000
*                                                                       00150000
*        R1  - A(CMS PLIST)                                             00160000
*        R13 - A(SAVE AREA)                                             00170000
*        R14 - RETURN ADDRESS                                           00180000
*        R15 - ENTRY POINT ADDRESS                                      00190000
*                                                                       00200000
*EXIT CONDITIONS -                                                      00210000
*                                                                       00220000
*        R15 - RETURN CODE:                                             00230000
*              = 0 -> FUNCTION COMPLETED.                               00240000
*              > 0 -> FUNCTION NOT COMPLETED.                           00250000
*                                                                       00260000
*MODULE ATTRIBUTES -                                                    00270000
*                                                                       00280000
*        TRASIENT AREA, SYSTEM KEY, SERIALLY REUSEABLE, CALLED VIA SVC  00290000
*        202 AS FOLLOWS:                                                00300000
*                                                                       00310000
* R1 ->  DC  CL8'RESLIB'                                                00320000
*        DC  CL8'ALLOCATE'         (ALLOCATE PROTECTED STORAGE)         00330000
*        DC  CL8'<PAGES>'          (NUMBER OF 4K PAGES TO ALLOCATE, MUS 00340000
*                                  MUST BE 1 TO 256)                    00350000
*        DC  CL8'('                (OPTION SEPARATOR)                   00360000
*        DC  CL8'KEY <NN>'         (STORAGE PKEY TO ASSIGN TO AREA)     00370000
*        DC  CL8'PERM'             (PROTECT AGAINST DEL *)              00380000
*        DC  XL8'FF'                                                    00390000
*                                                                       00400000
* R1 ->  DC  CL8'RESLIB'                                                00410000
*        DC  CL8'DELETE'           (DELETE PREVIOUS ALLOC OR LOAD)      00420000
*        DC  CL8'<ID | *>          (ALLOCATE OR LOAD ID.  IF *, THEN    00430000
*                                  DELETE ALL BUT PERM SPACE)           00440000
*        DC  XL8'FF'                                                    00450000
         EJECT                                                          00460000
* R1 ->  DC  CL8'RESLIB'                                                00470000
*        DC  CL8'LIST'             (DISPLAY ONE OR MORE ENTRIES)        00480000
*        DC  CL8'<ID | *>          (ALLOCATE OR LOAD ID.  IF *, THEN    00490000
*                                  DISPLAY ALL ENTRIES)                 00500000
*        DC  CL8'('                (OPTION SEPARATOR)                   00510000
*        DC  CL8'STACK'            (STACK OUTPUT FIFO, NOTYPE DFLT)     00520000
*        DC  CL8'TYPE'             (TYPE THE DISPLAY, NORMAL DFLT)      00530000
*        DC  CL8'NOTYPE'           (SUPPRESS TYPE OUT)                  00540000
*        DC  XL8'FF'                                                    00550000
*                                                                       00560000
* R1 ->  DC  CL8'RESLIB'                                                00570000
*        DC  CL8'LOAD'             (LOAD A PROGRAM INTO PROT STORE)     00580000
*        DC  CL8'<ID>'             (FNAME OF TEXT BECOMES AREA ID)      00590000
*        DC  CL8'('                (OPTION SEPARATOR)                   00600000
*        DC  CL8'NAME <NAME>'      (TRUE NAME OF ENTRY)                 00610000
*        DC  CL8'PERM'             (PROTECT FROM DEL *)                 00620000
*        DC  CL8'SYSTEM'           (LEAVE AREA IN KEY F.  WHEN CALLED,  00630000
*                                  PSW KEY=0, MASK=DISABLED. ELSE STORE 00640000
*                                  KEY=E, PSW KEY=E, MASK=ENABLED)      00650000
*        DC  XL8'FF'                                                    00660000
*                                                                       00670000
*GENERAL COMMAND SYNTAX:                                                00680000
*                                                                       00690000
*                  ALLOCATE  <ID>         <( NAME . KEY . PERM < ) >>   00700000
*                  DELETE    <ID | * >                                  00710000
*                  LIST      <ID | * >    <( STACK TYPE NOTYPE  < ) >>  00720000
*      RESLIB      LOAD      <ID>         <( PERM SYSTEM NAME ...< ) >> 00730000
*                                                                       00740000
*MINIMUM ABBREVIATIONS -                                                00750000
*                                                                       00760000
*   ALLOCATE -> A          DELETE   -> D          LIST     -> L         00770000
*   LOAD     -> LO                                                      00780000
*                                                                       00790000
*   KEY      -> KEY        NAME     -> NAME       NOTYPE   -> NOT       00800000
*   PERM     -> PERM       STACK    -> STACK      SYSTEM   -> SYS       00810000
*   TYPE     -> T                                                       00820000
         EJECT                                                          00830000
*NOTES -                                                                00840000
*                                                                       00850000
*        1. THIS ROUTINE MUST BE LOADED IN THE TRANSIENT AREA AND       00860000
*           GENERATED WITH A NAME OF RESLIB WITH THE SYSTEM OPTION.     00870000
*                                                                       00880000
*        2. THE ALLOCATE, LOAD, AND LIST FUNCTION RETURN THE ADDRESS    00890000
*           OF THE RELEVANT AREA IN R1.                                 00900000
*                                                                       00910000
*        3. DUPLICATE OPTIONS ARE ACCEPTED.  THE RIGHTMOST IS USED.     00920000
*                                                                       00930000
*LOCALLY ISSUED MESSAGES:                                               00940000
*                                                                       00950000
* DMSRES003E INVALID OPTION '........'  RC=24                           00960000
* DMSRES005E NO 'KEY | NAME' SPECIFIED  RC=24                           00970000
* DMSRES014E INVALID FUNCTION '........'  RC=24                         00980000
* DMSRES026W '........' NOT IN LIBRARY  RC=4                            00990000
* DMSRES026E INVALID ........ '........' FOR '........' FUNCTION RC=24  01000000
* DMSRES027W NO PRIVATE CORE IMAGE LIBRARY  RC=4                        01010000
* DMSRES029E INVALID PARAMETER '....' IN THE '....' OPTION FIELD  RC=24 01020000
* DMSRES047E NO FUNCTION SPECIFIED  RC=24                               01030000
* DMSRES050E PARAMETER MISSING AFTER ........  RC=24                    01040000
* DMSRES070E INVALID PARAMETER '........'  RC=24                        01050000
* DMSRES109S VIRTUAL STORAGE CAPACITY EXCEEDED  RC=104                  01060000
* DMSRES224E '........ ALREADY IN USE'  RC=24                           01070000
*                                                                       01080000
*LOGIC -                                                                01090000
*                                                                       01100000
*        DOCUMENTED AT EACH MAJOR PORTION OF THE PROGRAM.               01110000
         SPACE 3                                                        01120000
*********************************************************************** 01130000
*                                                                     * 01140000
*     S E T C    D E P E N D I N G    O N    C M S    L E V E L       * 01150000
*                                                                     * 01160000
*********************************************************************** 01170000
         SPACE                                                          01180000
         GBLC  &STATE                                                   01190000
&STATE   SETC  'ASTATE'            FOR REL < 6.0 OR ANY W/O BSEP | SEP  01200000
*STATE   SETC  'AESTATE'           FOR REL >=6.0 WITH BSEP OR SEP       01210000
         EJECT                                                          01220000
*STEP 1: PERFORM ENTRY INITIALIZATION                                   01230000
*                                                                       01240000
DMSRES   CSECT                                                          01250000
         PRINT NOGEN                                                    01260000
         USING NUCON,R0                                                 01270000
         USING FUNCBLOK,R3                                              01280000
         USING LIBNTRY,R7                                               01290000
         USING *,R12                                                    01300000
         SPACE                                                          01310000
         LR    R12,R15             SET BASE REGISTER                    01320000
         LR    R11,R14             SAVE RETURN ADDRESS                  01330000
         LA    R8,8(,R1)           SET PLIST POINTER                    01340000
         MVI   FBITS,0             CLEAR THE FBITS                      01350000
         MVI   OBITS,0             CLEAR THE OBITS                      01360000
         MVI   LKEY,X'0E'          SET USER KEY                         01370000
         SPACE                                                          01380000
*STEP 2: SETUP TO SCAN FOR FUNCTION NAME                                01390000
*                                                                       01400000
         BAL   R10,GETLEN          GET LEN-1                            01410000
         LM    R3,R5,=A(FUNCTAB,FUNCTABL,FUNCTABE)  GET FUNCTION PNTRS  01420000
         SPACE                                                          01430000
*STEP 3: SCAN FOR A VALID FUNCTION                                      01440000
*                                                                       01450000
CHKFUNC1 EX    R1,CLCFUNC          IF FUNCTION NAMES THE SAME           01460000
         BE    GOTFUNC             THEN PROCESS IT                      01470000
         BXLE  R3,R4,CHKFUNC1      ELSE KEEP LOOKING                    01480000
         SPACE                                                          01490000
*STEP 4: NO VALID FUNCTION NAME FOUND.  CHECK TYPE OF ERR MSG TO GIVE   01500000
*                                                                       01510000
         CLC   0(2,R8),=C'('       IF OPTION LIST FOUND                 01520000
         BE    NOFUNC              THEN NO FUNCTION SPECIFIED           01530000
         CLI   0(R8),X'FF'         ELSE END OF PLIST                    01540000
         BE    NOFUNC              THEN NO FUNCTION FOUND               01550000
         B     BADFUNC             ELSE IT IS AN INVALID ONE            01560000
         EJECT                                                          01570000
*STEP 5: CHECK IF REMAINDER OF PLIST IS TO BE PROCESSED                 01580000
*                                                                       01590000
GOTFUNC  LA    R8,8(,R8)           POINT TO START OF PARMS              01600000
         TM    FUNCFLAG,NOFPROC    IF NO PLIST PROCESSING               01610000
         BO    FUNCXEQ             THEN EXECUTE THE FUNCTION            01620000
         SPACE                                                          01630000
*STEP 6: CHECK IF ENTRY ID SPECIFIED AND IF SO, GET IT                  01640000
*                                                                       01650000
         BAL   R10,SCANP           SCAN PLIST FOR END                   01660000
         BZ    CHKNAME             IF END, THEN CHECK IF FNAME NEEDED   01670000
         MVC   LOADTXTN(8),0(R8)   ELSE GET FNAME                       01680000
         LA    R8,8(,R8)           POINT TO NEXT TOKEN                  01690000
         B     CHKXEQ              AND CHECK FOR FURTHER PROCESSING     01700000
         SPACE                                                          01710000
*STEP 7: NO <ID> SPECIFIED, CHECK IF THIS IS ACCEPTABLE                 01720000
*                                                                       01730000
CHKNAME  TM    FUNCFLAG,SKPNAME    IF NAME NOT OPTIONAL                 01740000
         BNO   NOPARM              THEN ERROR                           01750000
         MVC   LOADTXTN(2),=C'* '  ELSE INDICATE STAR                   01760000
         SPACE                                                          01770000
*STEP 8: CHECK IF IMMEDIATE XEQ REQUIRED OR OPTION CHECKING             01780000
*                                                                       01790000
CHKXEQ   TM    FUNCFLAG,IXEQ       IF NOT IMMED XEQ                     01800000
         BNO   GETOP               THEN PROCESS THE OPTIONS             01810000
         B     FUNCXEQ             ELSE EXECUTE THE FUNCTION            01820000
         EJECT                                                          01830000
*********************************************************************** 01840000
*                                                                     * 01850000
*          O P T I O N    L I S T    P R O C E S S I N G              * 01860000
*                                                                     * 01870000
*********************************************************************** 01880000
         SPACE                                                          01890000
*STEP 1: CHECK IF WE ACTUALLY HAVE A VALID OPTION LIST                  01900000
*                                                                       01910000
GETOP    CLI   0(R8),X'FF'         IF END OF PLIST                      01920000
         BE    FUNCXEQ             THEN START XEQ                       01930000
         CLC   0(2,R8),=C'( '      IF TOKEN ^= '('                      01940000
         BNE   CONFLCTP            THEN INVALID PARAMETER               01950000
         SPACE                                                          01960000
*STEP 2: BUMP TO NEXT TOKEN AND CHECK IF OPTION LIST HAS ENDED          01970000
*                                                                       01980000
GETOP1   LA    R8,8(,R8)           BUMP TO NEXT TOKEN                   01990000
         CLI   0(R8),X'FF'         IF END OF PLIST                      02000000
         BE    FUNCXEQ             THEN EXCUTE FUNCTION                 02010000
         CLC   0(2,R8),=C') '      IF CLOSE PAREN                       02020000
         BE    FUNCXEQ             THEN EXECUTE FUNCTION                02030000
         SPACE                                                          02040000
*STEP 3: PREPARE TO SCAN THE OPTION TABLE                               02050000
*                                                                       02060000
         LA    R2,7(,R8)           POINT TO LAST BYTE OF OPTION         02070000
         BAL   R10,GETLEN          GET LEN-1                            02080000
         LM    R5,R7,=A(OPTABLE,OPTABLN,OPTABND)  GET TBL PNTRS         02090000
         USING OPTBLOK,R5                                               02100000
         SPACE                                                          02110000
*STEP 4: SCAN FOR VALID OPTION                                          02120000
*                                                                       02130000
GETOP2   CLM   R1,B'0001',OPTLEN   IF OUR STRING IS TO SHORT            02140000
         BL    GETOP2A             THEN SKIP IT                         02150000
         EX    R1,CLCOPT           ELSE IF OPTION NAMES COMPARE         02160000
         BE    GETOP3              THEN FOUND OPTION                    02170000
GETOP2A  BXLE  R5,R6,GETOP2        ELSE LOOK AT NEXT ONE                02180000
         B     BADOPT              INVALID OPTION                       02190000
         SPACE                                                          02200000
*STEP 5: CHECK IF OPTION VALID FOR FUNCTION AND SET INDICATOR IF SO     02210000
*                                                                       02220000
GETOP3   MVC   0(1,R13),FUNCOPT    GET VALID OPTION BITS                02230000
         NC    0(1,R13),OPTVALID   IF OPTION NOT ONE OF THEM            02240000
         BZ    CONFLCTO            THEN OPTION/FUNCTION CONFLICT        02250000
         NC    OBITS(1),OPTMASK    REMOVE TOGGLE OPTIONS                02260000
         OC    OBITS(1),OPTBITS    SET OPTION INDICATOR                 02270000
         EJECT                                                          02280000
*STEP 6: CHECK FOR 'NAME' OPTION AND PROCESS                            02290000
*                                                                       02300000
         CLC   CHKNAMO(8),0(R5)    IF NOT THE NAME OPTION               02310000
         BNE   GETOP4              THEN CHECK FOR KEY OPTION            02320000
         LA    R8,8(,R8)           ELSE POINT TO NEXT OPTION            02330000
         BAL   R10,SCANP           CHECK IF END OF PLIST HERE           02340000
         BZ    NOPTV               IF SO, THEN NAME NOT SPECIFIED       02350000
         MVC   NEWNAME(8),0(R8)    ELSE SET NEW NAME                    02360000
         B     GETOP1              GET NEXT OPTION                      02370000
         SPACE                                                          02380000
*STEP 7: CHECK IF 'KEY' SPECIFIED AND PROCESS                           02390000
*                                                                       02400000
GETOP4   CLC   CHKKEY(8),0(R8)     IF KEY NOT SPECIFIED                 02410000
         BNE   GETOP1              THEN GET NEXT OPTION                 02420000
         LA    R8,8(,R8)           ELSE POINT TO NEXT TOKEN             02430000
         BAL   R10,SCANP           CHECK IF AT END OF PLIST             02440000
         BZ    NOPTV               IF AT END, THEN ERROR                02450000
         BAL   R10,GETLEN          ELSE GET LEN-1 OF TOKEN              02460000
         BAL   R10,GETNUM          CONVERT IT                           02470000
         BNZ   BADVAL              IF INVALID, THEN ERROR               02480000
         CH    R15,=H'15'          IF KEY > X'0F'                       02490000
         BH    BADVAL              THEN INVALID                         02500000
         STC   R15,LKEY            ELSE SET KEY VALUE                   02510000
         B     GETOP1              AND GET NEXT OPTION                  02520000
         DROP  R5                                                       02530000
         EJECT                                                          02540000
*********************************************************************** 02550000
*                                                                     * 02560000
*     A L L O C A T E    F U N C T I O N    P R O C E S S I N G       * 02570000
*                                                                     * 02580000
*********************************************************************** 02590000
         SPACE                                                          02600000
*STEP 1: GET THE NUMBER OF PAGES TO BE ALLOCATED                        02610000
*                                                                       02620000
ALO      LA    R8,LOADTXTN         POINT TO NUMBER OF PAGES             02630000
         BAL   R10,GETLEN          GET LEN-1                            02640000
         BAL   R10,GETNUM          CONVERT IT TO BINARY                 02650000
         BNZ   CONFLCTP            IF INVALID, THEN EXIT                02660000
         STH   R15,SAVENUM         SAVE THE NUMBER                      02670000
         SPACE                                                          02680000
*STEP 2: CHECK IF USER TRYING TO ALLOCATE DUPLICATE ID                  02690000
*                                                                       02700000
         TM    OBITS,OPTNAM        IF NAME NOT SPECIFIED                02710000
         BNO   ALO01               THEN SKIP DUP ID CHECK               02720000
         MVC   LOADTXTN(8),NEWNAME ELSE SUPPLY NAME                     02730000
         BAL   R10,SCANTAB         FIND ID IN LIB TABLE                 02740000
         BZ    DUPID               IF FOUND, THEN ERROR                 02750000
         SPACE                                                          02760000
*STEP 3: ALLOCATE A NEW LIB TABLE ENTRY AND CHECK IF UNIQUE ID NEEDED   02770000
*                                                                       02780000
ALO01    SR    R0,R0               GET FREE LIB ENTRY                   02790000
         BAL   R10,SCANTABA        VIA SPECIAL SEARCH                   02800000
         BNZ   NOSTOR              IF NONE, THEN TABLE IS FULL          02810000
         TM    OBITS,OPTNAM        IF NAME SPECIFIED                    02820000
         BO    ALO03               THEN SKIP THE ID GENERATION          02830000
         LR    R5,R15              SAVE THE ENTRY NUMBER                02840000
         STM   R0,R7,STSAVE        SAVE SOME REGS                       02850000
         NI    FBITS,255-SEEKADR   RESET SEEK BIT                       02860000
         SPACE                                                          02870000
*STEP 4: CONSTRUCT A UNIQUE ID FOR THE USER                             02880000
*                                                                       02890000
ALO02    STCK  DTEMP               SAVE CURRENT TOD                     02900000
         STC   R5,DTEMP+7          INSERT ENTRY ID                      02910000
         UNPK  0(9,R13),DTEMP+4(5) BREAK OUT ALL DIGITS                 02920000
         MVC   LOADTXTN(8),0(R13)  MOVE OVER RELEVANT PORTION           02930000
         NC    LOADTXTN(8),=8X'0F' ISOLATE THE DIGITS                   02940000
         TR    LOADTXTN(8),=C'ABCDEFGHJKMNPQRS'   CREATE NAME           02950000
         BAL   R10,SCANTAB         FIND THE ENTRY                       02960000
         BZ    ALO02               IF FOUND, GENERATE A NEW ONE         02970000
         MVC   NEWNAME(8),LOADTXTN ELSE MAKE THIS THE NAME              02980000
         LM    R0,R7,STSAVE        RESTORE THE REGS                     02990000
         EJECT                                                          03000000
*STEP 5: ALLOCATE STORAGE BASED ON NUMBER OF PAGES WANTED               03010000
*                                                                       03020000
ALO03    LH    R2,SAVENUM          GET NUMBER OF PAGES                  03030000
         SLL   R2,12               MULTIPLY BY 4096                     03040000
         BAL   R10,GETCORE         GET THE STORAGE                      03050000
         BNZ   NOSTOR              IF NOT ENOUGH FREE AREA, ERROR       03060000
         SPACE                                                          03070000
*STEP 6: ENTER THE AREA IN THE LIB TABLE AND RETURN EPA TO USER         03080000
*                                                                       03090000
         LR    R1,R3               R1 <- EPA (SAME AS START LOC)        03100000
         BAL   R10,ADDNTRY         ADD THE ENTRY                        03110000
         BAL   R10,RETNTRY         RETURN IT TO USER VIA R1             03120000
         B     EXIT00              ALL DONE                             03130000
         EJECT                                                          03140000
*********************************************************************** 03150000
*                                                                     * 03160000
*        D E L E T E    F U N C T I O N    P R O C E S S I N G        * 03170000
*                                                                     * 03180000
*********************************************************************** 03190000
         SPACE                                                          03200000
*STEP 1: CHECK IF '*' SPECIFIED INDICATING ALL NON-PERM DELETES         03210000
*                                                                       03220000
DELT     CLC   LOADTXTN(2),=C'* '  IF STAR NOT GIVEN                    03230000
         BNE   DELT03              THEN DELETE ONLY ONE ENTRY           03240000
         BAL   R14,GETLIB          ELSE GET A(LIB TABLE)                03250000
         BNZ   EXIT00              IF NONE, THEN ALL DONE               03260000
         LA    R5,LIBMAXN          ELSE DELETE ALL POSSIBLE ENTRIES     03270000
         SPACE                                                          03280000
*STEP 2: DELETE ALL APPLICABLE ENTRIES                                  03290000
*                                                                       03300000
DELT01   CLI   LIBID,0             IF NULL ENTRY HIT                    03310000
         BE    EXIT00              THEN ALL DONE                        03320000
         TM    LIBFLAGS,LIBPERM    IF THIS IS NOT A PERM ENTRY          03330000
         BNO   DELT02              THEN DELETE                          03340000
         LA    R7,LIBSIZE(,R7)     ELSE POINT TO NEXT ENTRY             03350000
         BCT   R5,DELT01           AND CHECK IT OUT                     03360000
         B     EXIT00              ALL DONE                             03370000
         SPACE                                                          03380000
*STEP 3: FREE THE ENTRY STORAGE AND DELETE FROM LIB TABLE               03390000
*                                                                       03400000
DELT02   LM    R2,R3,LIBLEN        GET LEN & ADDRESS                    03410000
         BAL   R10,RELCORE         RELEASE THE STORAGE                  03420000
         BAL   R10,RELNTRY         RELEASE THE LIB TABLE ENTRY          03430000
         BNZ   DELT01              IF MORE LEFT, CHECK THEM OUT         03440000
         B     EXIT00              ELSE ALL DONE                        03450000
         SPACE                                                          03460000
*STEP 4: FIND MATCHING ENTRY ID ENTRY IN LIB TABLE                      03470000
*                                                                       03480000
DELT03   BAL   R10,SCANTAB         SCAN LIB TABLE                       03490000
         BNZ   NOTXT               IF NOT FOUND, THEN ERROR             03500000
         SPACE                                                          03510000
*STEP 5: ENTRY FOUND, RELEASE ITS STORAGE AND DELETE THE TABLE ENTRY    03520000
*                                                                       03530000
         BAL   R10,RELCORE         RELEASE ENTRY STORAGE                03540000
         BAL   R10,RELNTRY         RELEASE THE ENTRY                    03550000
         B     EXIT00              AND EXIT WITH RC=0                   03560000
         EJECT                                                          03570000
*********************************************************************** 03580000
*                                                                     * 03590000
*        L O A D    F U N C T I O N    P R O C E S S I N G            * 03600000
*                                                                     * 03610000
*********************************************************************** 03620000
         SPACE                                                          03630000
*STEP 1: CHECK IF NAME TO BE ENTERED IS A DUPLICATE                     03640000
*                                                                       03650000
LOADF    MVC   STSAVE(8),LOADTXTN  SAVE CURRENT NAME                    03660000
         TM    OBITS,OPTNAM        IF 'NAME' NOT SPECIFIED              03670000
         BNO   *+10                THEN ALL IS WELL                     03680000
         MVC   LOADTXTN(8),NEWNAME ELSE SET NEW NAME                    03690000
         BAL   R10,SCANTAB         TRY TO FIND THE ENTRY                03700000
         BZ    DUPID               IF FOUND, THEN ERROR                 03710000
         MVC   NEWNAME(8),LOADTXTN ELSE SET THE ENTRY NAME              03720000
         MVC   LOADTXTN(8),STSAVE  RESTORE LOAD NAME                    03730000
         SPACE                                                          03740000
*STEP 2: GET A LIB TABLE ENTRY & LOAD ROUTINE INTO LOW STORAGE FIRST    03750000
*        SO THAT WE CAN COMPUTE THE AMOUNT OF STORAGE NEEDED FOR IT.    03760000
*                                                                       03770000
         SR    R0,R0               LOOK FOR EMPTY SLOT                  03780000
         BAL   R10,SCANTABA        VIA SCANTAB ONCE MORE                03790000
         BNZ   NOSTOR              IF NONE, TABLE IS FULL               03800000
         L     R3,MAINHIGH         ELSE GET A CLEAR STORAGE AREA        03810000
         BAL   R10,LOADTXT         DO INITIAL LOAD                      03820000
         BNZ   EXITRC              IF ERROR, EXIT W/ LOADER RC          03830000
         SPACE                                                          03840000
*STEP 3: COMPUTE THE AMOUNT OF STORAGE NEEDED BASED OF STARTING         03850000
*        LOCATION AND ENDING LOCATION AS COMPUTE BY THE LOADER.         03860000
*                                                                       03870000
         LR    R2,R0               R2 <- ENDING ADDRESS                 03880000
         SR    R2,R3               SIZE = LOCCNT - START ADDRESS        03890000
         TM    OBITS,OPTSYS        IF SYSTEM OPTION NOT SPECIFIED       03900000
         BNO   *+8                 THEN KEY VALUE IS CORRECT            03910000
         MVI   LKEY,X'0F'          ELSE SET STORAGE TO KEY X'F'         03920000
         BAL   R10,GETCORE         ALLOCATE STORAGE                     03930000
         BNZ   NOSTOR              IF NONE, THEN ERROR                  03940000
         SPACE                                                          03950000
*STEP 4: LOAD THE FILE IN HIGH STORAGE ONCE AGAIN.  IF ERROR, RELEASE   03960000
*        THE STORAGE WE GOT BEFORE WE EXIT.                             03970000
*                                                                       03980000
         BAL   R10,LOADTXT         LOAD THE FILE                        03990000
         BZ    LOADF01             IF IT WAS LOADED, WE ARE ALL SET     04000000
         LR    R9,R15              ELSE GET RC                          04010000
         BAL   R10,RELCORE         RELEASE THE STORAGE                  04020000
         LR    R15,R9              RESTORE THE LOADER RC                04030000
         B     EXITRC              AND EXIT                             04040000
         SPACE                                                          04050000
*STEP 5: ADD NEW ENTRY INTO THE LIB TABLE AND RETURN ADDR TO USER       04060000
*                                                                       04070000
LOADF01  L     R1,STRTADDR         GET ENTRY POINT ADDRESS              04080000
         BAL   R10,ADDNTRY         ADD IT TO THE LIB TABLE              04090000
         BAL   R10,RETNTRY         SUPPLY EPA VIA R1                    04100000
         OI    LIBFLAGS,LIBCMD     FLAG AS A RESIDENT COMMAND           04110000
         B     EXIT00              AND EXIT                             04120000
         EJECT                                                          04130000
*********************************************************************** 04140000
*                                                                     * 04150000
*         L I S T    F U N C T I O N    P R O C E S S I N G           * 04160000
*                                                                     * 04170000
*********************************************************************** 04180000
         SPACE                                                          04190000
*STEP 1: SET CORRECT OPTIONS BASED ON SPECIFIED OPTIONS                 04200000
*                                                                       04210000
LST      TM    OBITS,OPTYPE+OPNTYPE     IF TYPE | NOTYPE SPECIFIED      04220000
         BNZ   LST00               THEN OPTIONS ARE SET                 04230000
         OI    OBITS,OPTYPE        ELSE FORCE TYPING                    04240000
         TM    OBITS,OPTSTK        IF STACK NOT SPECIFIED               04250000
         BNO   LST00               THEN OPTIONS ARE SET                 04260000
         NI    OBITS,255-OPTYPE    ELSE RESET TYPING                    04270000
         OI    OBITS,OPNTYPE       AND INDICATE NOTYPING                04280000
         SPACE                                                          04290000
*STEP 2: CHECK IF '*' SPECIFIED FOR FNAME (IF IT WAS, USER WANTS A      04300000
*        COMPLETE LIST OF THE LIB TABLE).  ELSE TYPE SINGLE ENTRY.      04310000
*                                                                       04320000
LST00    CLC   LOADTXTN(2),=C'* '  IF STAR SPECIFIED                    04330000
         BE    LST01               THEN GIVE COMPLETE LIST              04340000
         BAL   R10,SCANTAB         ELSE FIND THE MATCHING ENTRY         04350000
         BNZ   NOTXTL              IF NONE, THEN ERROR                  04360000
         BAL   R10,RETNTRY         ELSE RETURN EPA FOR USER             04370000
         BAL   R10,TYPENTRY        TYPE THE INFO                        04380000
         B     EXIT00              AND EXIT WITH RC = 0                 04390000
         SPACE                                                          04400000
*STEP 3: SCAN COMPLETE LIB TABLE TYPING ALL VALID ENTRIES               04410000
*                                                                       04420000
LST01    LA    R5,LIBMAXN          DO ALL OF THE ENTRIES                04430000
         BAL   R14,GETLIB          GET A(LIB TABLE)                     04440000
         BNZ   NOTXTA              IF NONE, GIVE WARNING MESSAGE        04450000
         SPACE                                                          04460000
LST01A   CLI   LIBID,0             IF ENTRY IS NULL                     04470000
         BE    LST01B              THE SKIP IT                          04480000
         BAL   R10,TYPENTRY        ELSE TYPE IT                         04490000
         SPACE                                                          04500000
LST01B   LA    R7,LIBSIZE(,R7)     ELSE POINT TO NEXT ENTRY             04510000
         BCT   R5,LST01A           AND TYPE IT IF NOT NULL              04520000
         SPACE                                                          04530000
*STEP 4: CHECK IF ANYTHING ACTUALLY TYPED AND EXIT CORRECTLY            04540000
*                                                                       04550000
         TM    FBITS,HDR           IF SOMETHING WAS TYPED               04560000
         BO    EXIT00              THEN EXIT NORMALLY                   04570000
         TM    OBITS,OPTYPE        IF NOTYPE IN EFFECT                  04580000
         BNO   EXIT04              THEN JUST EXIT                       04590000
         B     NOTXTA              ELSE ISSUE ERROR MESSAGE             04600000
         EJECT                                                          04610000
*********************************************************************** 04620000
*                                                                     * 04630000
*            E  R  R  O  R    M  E  S  S  A  G  E  S                  * 04640000
*                                                                     * 04650000
*********************************************************************** 04660000
         SPACE                                                          04670000
* DMSRES003E                                                            04680000
*                                                                       04690000
BADOPT   DMSERR  TEXT='INVALID OPTION ''........''',NUM=3,LET=E,       X04700000
               SUB=(CHARA,(R8))                                         04710000
         B     EXIT24                                                   04720000
         SPACE                                                          04730000
* DMSRES005E                                                            04740000
*                                                                       04750000
NOPTV    DMSERR  TEXT='NO ''....'' SPECIFIED',NUM=5,LET=E,             X04760000
               SUB=(CHARA,(R5))                                         04770000
         B     EXIT24                                                   04780000
         SPACE                                                          04790000
* DMSRES014E                                                            04800000
*                                                                       04810000
BADFUNC  DMSERR  TEXT='INVALID FUNCTION ''........''',NUM=14,LET=E,    X04820000
               SUB=(CHARA,(R8))                                         04830000
         B     EXIT24                                                   04840000
         SPACE                                                          04850000
* DMSRES026W                                                            04860000
*                                                                       04870000
NOTXTL   TM    OBITS,OPTYPE        IF TYPE IS SUPPRESSED                04880000
         BNO   EXIT04              THEN SKIP THE MESSAGE                04890000
NOTXT    DMSERR  TEXT='''........'' NOT IN LIBRARY',NUM=26,LET=W,      X04900000
               SUB=(CHARA,LOADTXTN)                                     04910000
         B     EXIT04                                                   04920000
         SPACE                                                          04930000
* DMSRES026E                                                            04940000
*                                                                       04950000
CONFLCTO LA    R2,=CL9'OPTION'     OPTION/FUNCTION CONFLICT             04960000
         B     CONFLCT                                                  04970000
CONFLCTP LA    R2,=CL9'PARAMETER'  PARAMETER/FUNCTION CONFLICT          04980000
         SPACE                                                          04990000
CONFLCT  DMSERR  TEXT='INVALID ......... ''........'' FOR ''........'' X05000000
               FUNCTION',NUM=26,LET=E,SUB=(CHARA,(R2),CHARA,(R8),      X05010000
               CHARA,FUNCNAME),RENT=NO                                  05020000
         B     EXIT24                                                   05030000
         SPACE                                                          05040000
* DMSRES027W                                                            05050000
*                                                                       05060000
NOTXTA   TM    OBITS,OPTYPE        IF NOTYPING WANTED                   05070000
         BNO   EXIT04              THEN JUST EXIT                       05080000
         DMSERR  TEXT='NO PRIVATE CORE IMAGE LIBRARY',NUM=27,LET=W      05090000
         B     EXIT04                                                   05100000
         EJECT                                                          05110000
* DMSRES029E                                                            05120000
*                                                                       05130000
BADVAL   DMSERR  TEXT='INVALID PARAMETER ''........'' IN THE OPTION ''.X05140000
               .......'' FIELD',NUM=29,LET=E,RENT=NO,                  X05150000
               SUB=(CHARA,(R8),CHARA,(R5))                              05160000
         B     EXIT24                                                   05170000
         SPACE                                                          05180000
* DMSRES047E                                                            05190000
*                                                                       05200000
NOFUNC   DMSERR  TEXT='NO FUNCTION SPECIFIED',NUM=47,LET=E              05210000
         B     EXIT24                                                   05220000
         SPACE                                                          05230000
* DMSRES050E                                                            05240000
*                                                                       05250000
NOPARM   DMSERR  TEXT='PARAMETER MISSING AFTER ........',NUM=50,LET=E, X05260000
               SUB=(CHARA,FUNCNAME)                                     05270000
         B     EXIT24                                                   05280000
         SPACE                                                          05290000
* DMSRES109S                                                            05300000
*                                                                       05310000
NOSTOR   DMSERR  TEXT='VIRTUAL STORAGE CAPACITY EXCEEDED',NUM=109,LET=S 05320000
         B     EXIT104                                                  05330000
         SPACE                                                          05340000
* DMSRES224E                                                            05350000
*                                                                       05360000
DUPID    DMSERR  TEXT='........ ALREADY IN USE',NUM=224,LET=E,         X05370000
               SUB=(CHARA,LOADTXTN)                                     05380000
         B     EXIT24                                                   05390000
         SPACE                                                          05400000
* EXIT HERE FOR RC = 0                                                  05410000
*                                                                       05420000
EXIT00   SR    R15,R15             RC = 0                               05430000
EXITRC   BR    R11                 RETURN TO CMS                        05440000
         SPACE                                                          05450000
* EXIT HERE FOR RC = 4                                                  05460000
*                                                                       05470000
EXIT04   LA    R15,4               RC = 4                               05480000
         BR    R11                 RETURN                               05490000
         SPACE                                                          05500000
* EXIT HERE FOR RC = 24                                                 05510000
*                                                                       05520000
EXIT24   LA    R15,24              RC = 24                              05530000
         BR    R11                 EXIT                                 05540000
         SPACE                                                          05550000
* EXIT HERE FOR RC = 104                                                05560000
*                                                                       05570000
EXIT104  LA    R15,104             RC = 104                             05580000
         BR    R11                 EXIT                                 05590000
         EJECT                                                          05600000
*SUBROUTINE -                                                           05610000
*        SCANTAB                                                        05620000
*        SCANTABA                                                       05630000
*                                                                       05640000
*FUNCTION -                                                             05650000
*        SCAN THE LIB TABLE FOR A NAME (SCANTAB) OR ADDRESS (SCANTABA)  05660000
*                                                                       05670000
*ENTRY CONDITIONS -                                                     05680000
*        R10 - RETURN ADDRESS                                           05690000
*              ADDITIONALLY:                                            05700000
*              IF FBITS = SEEKADR THEN R0 CONTAINS ADDRESS TO SEEK FOR. 05710000
*                         THIS ADDRESS CORRESPONDS TO THE LIBADR FIELD. 05720000
*              IF FBITS ^ SEEKADR THEN AREA LOADTXTN CONTAINS AN 8 CHAR 05730000
*                         NAME TO BE FOUND IN THE LIB TABLE.            05740000
*                                                                       05750000
*EXIT CONDITIONS -                                                      05760000
*        CC = 0 -> ENTRY FOUND, REGISTERS CONTAIN:                      05770000
*                  R1 - A(MODULE ENTRY POINT)                           05780000
*                  R2 - LENGTH OF STORAGE AREA ALLOCATED                05790000
*                  R3 - A(STORAGE AREA ALLOCATED)                       05800000
*                  R7 - A(LIB TABLE ENTRY)                              05810000
*                  R15- UNIQUE ENTRY NUMBER                             05820000
*                                                                       05830000
*        CC ^ 0 -> MATCHING ENTRY NOT FOUND.                            05840000
*                                                                       05850000
*NOTES -                                                                05860000
*        1. IF THERE IS NO LIB TABLE ALLOCATED, THIS ROUTINE WILL GET   05870000
*           ONE.  THE LIB TABLE IS 4K LONG AND HOLDS ALL THE NAME TO    05880000
*           ADDRESS MAPPINGS.  DONE ONLY IF R0 = 0 AND SEEKADR SET ON.  05890000
*                                                                       05900000
*        2. IN ALL CASES, R0 - R3, R7, R14, R15 ARE MODIFIED.           05910000
*                                                                       05920000
*        3. EXIT MAY BE MADE DIRECTLY TO VARIOUS ERROR MESSAGES.        05930000
*                                                                       05940000
*        4. ENTRY SCANTABA MAY BE USED TO SET THE SEEKADR BIT ON.       05950000
         SPACE                                                          05960000
*STEP 1: GET A(LIB TABLE) AND CHECK IF ALLOCATED YET                    05970000
*                                                                       05980000
SCANTABA OI    FBITS,SEEKADR       SET ADDRESS SEARCH ON                05990000
         SPACE                                                          06000000
SCANTAB  BAL   R14,GETLIB          GET A(LIB TABLE)                     06010000
         BZ    SCANTAB1            IF PRESENT, START SCAN               06020000
         SPACE                                                          06030000
*STEP 2: ALLOCATE A LIB TABLE ONLY IF SEARCHING FOR A FREE ENTRY        06040000
*                                                                       06050000
         LTR   R0,R0               IF NOT SEARCHING FOR 0 ENTRY         06060000
         BNZR  R10                 THEN RETURN, NOTHING FOUND           06070000
         TM    FBITS,SEEKADR       IF SEEKING BY ADDRESS                06080000
         BO    SCANTAB0            THEN GO ALLOCATE LIB TABLE           06090000
         LTR   R12,R12             ELSE SET CC^0                        06100000
         BR    R10                 AND RETURN                           06110000
         EJECT                                                          06120000
*STEP 3: LIB TABLE IS NOT YET ALLOCATED, ALLOCATE IT                    06130000
*                                                                       06140000
SCANTAB0 L     R2,=F'4096'         GET 4K FOR LIB TABLE                 06150000
         IC    R7,LKEY             GET WANTED KEY                       06160000
         MVI   LKEY,0              PLACE LIB TABLE IN KEY 0             06170000
         ST    R10,0(,R13)         SAVE THE RPA REG                     06180000
         BAL   R10,GETCORE         ALLOCATE THE STORAGE                 06190000
         L     R10,0(,R13)         RESTORE RPA REG                      06200000
         STC   R7,LKEY             RESTORE WANTED KEY                   06210000
         BNZ   NOSTOR              IF NOT ALLOCATED, THEN ERROR         06220000
         SPACE                                                          06230000
*STEP 4: LOAD SPECIAL COMMAND PROCESSING ROUTINE AT START OF LIB TABLE  06240000
*                                                                       06250000
         MVC   ASTATE2(4),&STATE   SET STATE ADDRESS IN CODE            06260000
         ST    R3,&STATE           SET ANCHOR IN NUCON                  06270000
         LR    R0,R3               R0 <- A(LIB TABLE)                   06280000
         LA    R1,DMSRESRL         R1 <- LENGTH(CODE)                   06290000
         LA    R14,DMSRESRC        R14 <- A(LOCAL CODE)                 06300000
         LR    R15,R1              R15 <- LENGTH(CODE)                  06310000
         MVCL  R0,R14              MOVE CODE OVER                       06320000
         LR    R7,R0               SET STARTING ADDR OF LIBTABLE        06330000
         SR    R0,R0               CLEAR R0 ONCE AGAIN                  06340000
         SPACE                                                          06350000
*STEP 5: SCAN THE LIB TABLE FOR THE MATCHING ENTRY                      06360000
*                                                                       06370000
SCANTAB1 LA    R15,LIBMAXN         SCAN MAX ENTRIES                     06380000
         SPACE                                                          06390000
SCANTAB2 LM    R1,R3,LIBEPA        ASSUME ENTRY WILL MATCH              06400000
         TM    FBITS,SEEKADR       IF SEEKING BY ADDRESS                06410000
         BO    SCANTAB3            THEN PERFORM ADDRESS MATCH           06420000
         CLC   LIBID(8),LOADTXTN   ELSE IF NAMES MATCH                  06430000
         BER   R10                 THEN RETURN W/ INFO                  06440000
         CLI   LIBID,X'01'         IF LIBENTRY IS NULL                  06450000
         BLR   R10                 THEN RETURN, END OF TABLE            06460000
         B     SCANTAB4            ELSE GO TO NEXT ENTRY                06470000
         SPACE                                                          06480000
SCANTAB3 CL    R0,LIBADR           IF ADDRESSES MATCH                   06490000
         BER   R10                 THEN RETURN WITH INFO                06500000
         CLI   LIBID,X'01'         IF LIBENTRY IS NULL                  06510000
         BLR   R10                 THEN RETURN, END OF TABLE            06520000
         SPACE                                                          06530000
*STEP 6: BUMP TO NEXT LIB TABLE ENTRY AND PROCESS                       06540000
*                                                                       06550000
SCANTAB4 LA    R7,LIBSIZE(,R7)     BUMP TO NEXT ENTRY                   06560000
         BCT   R15,SCANTAB2        SCAN THE TABLE                       06570000
         BR    R10                 RETURN, NOT FOUND, CC^=0             06580000
         EJECT                                                          06590000
*SUBROUTINE -                                                           06600000
*        ADDNTRY                                                        06610000
*                                                                       06620000
*FUNCTION -                                                             06630000
*        TO COMPLETE A LIB TABLE ENTRY                                  06640000
*                                                                       06650000
*ENTRY CONDITIONS -                                                     06660000
*        R1  - A(MODULE E.P.A)                                          06670000
*        R2  - LENGTH OF STORAGE AREA                                   06680000
*        R3  - A(STORAGE AREA)                                          06690000
*        R7  - A(LIB TABLE ENTRY TO BE USED)                            06700000
*              ADDITIONALLY: AREA AT NEWNAME CONTAINS THE FNAME;        06710000
*              LKEY CONTAINS THE STORAGE PROTECT KEY.                   06720000
*                                                                       06730000
*EXIT CONDITIONS -                                                      06740000
*        NONE.                                                          06750000
*                                                                       06760000
*NOTES -                                                                06770000
*        1. LIBFLAGS ARE SET ACCORDING TO INDICATORS IN OBITS.          06780000
         SPACE                                                          06790000
*STEP 1: COMPLETE THE LIB TABLE ENTRY                                   06800000
*                                                                       06810000
ADDNTRY  MVC   LIBID(8),NEWNAME    SUPPLY REAL NAME                     06820000
         STM   R1,R3,LIBEPA        SET EPA, LEN, ADDR                   06830000
         MVC   LIBKEY(1),LKEY      SET THE PKEY                         06840000
         MVI   LIBFLAGS,0          CLEAR FLAGS                          06850000
         SPACE                                                          06860000
*STEP 2: SET ENTRY FLAGS                                                06870000
*                                                                       06880000
         TM    OBITS,OPTPERM       IF NOT PERM ENTRY                    06890000
         BNO   *+8                 THEN SKIP THE SET                    06900000
         OI    LIBFLAGS,LIBPERM    ELSE INDICATE PERM                   06910000
         TM    OBITS,OPTSYS        IF NOT SYSTEM SPACE                  06920000
         BNOR  R10                 THEN RETURN, ALL DONE                06930000
         OI    LIBFLAGS,LIBSYS     ELSE INDICATE SYSTEM SPACE           06940000
         BR    R10                 AND RETURN                           06950000
         EJECT                                                          06960000
*SUBROUTINE -                                                           06970000
*        GETCORE                                                        06980000
*                                                                       06990000
*FUNCTION -                                                             07000000
*        TO ALLOCATE ONE OR MORE PAGES OF NUCLEUS HIGH STORAGE          07010000
*        PROTECTED PRIVATE (HIDDEN FROM CMS) STORAGE.                   07020000
*                                                                       07030000
*ENTRY CONDITIONS -                                                     07040000
*        R2  - LENGTH, IN BYTES, TO BE ALLOCATED.                       07050000
*        R10 - RETURN ADDRESS                                           07060000
*                                                                       07070000
*EXIT CONDITIONS -                                                      07080000
*        CC = 0 -> STORAGE ALLOCATED, REGISTERS CONTAIN:                07090000
*                  R2 - LENGTH, IN BYTES, ACTUALLY ALLOCATED.           07100000
*                  R3 - A(STORAGE AREA) ALLOCATED.                      07110000
*        CC ^ 0 -> INSUFFICIENT STORAGE.                                07120000
*                                                                       07130000
*NOTES -                                                                07140000
*        1. R0 - R3, R14, R15 MODIFIED.                                 07150000
         SPACE                                                          07160000
*STEP 1: ROUND REQUESTORS LENGTH TO NEAREST 4K SIZE.  WE CAN ONLY       07170000
*        ALLOCATE STORAGE IN UNITS OF PAGES.                            07180000
*                                                                       07190000
GETCORE  LA    R2,4095(,R2)        ADD A TAD LESS THAN 4K               07200000
         SRL   R2,12               SHIFT DOWN                           07210000
         SLL   R2,12               AND UP, WE NOW HAVE A GOOD NUMBER    07220000
         SPACE                                                          07230000
*STEP 2: ADD 4K MORE TO IT SO THAT WE CAN BE ASSURED THAT WHEN WE       07240000
*        TRIM THE EXCESS THE RESULTING AREA WILL WIND UP ON A PAGE      07250000
*        BOUNDARY.  ONCE DONE, ALLOCATE HIGH NUCLEUS STORAGE.           07260000
*                                                                       07270000
         AL    R2,=F'4096'         ADD 4K TO REQUESTED SIZE             07280000
         LR    R0,R2               COPY IT                              07290000
         SRL   R0,3                CONVERT TO DWORDS FOR DMSFREE        07300000
         DMSFREE DWORDS=(0),TYPE=NUCLEUS,AREA=HIGH,ERR=GETCORE6         07310000
         SPACE                                                          07320000
*STEP 3: CHECK IF CMS ALLOCATED ON A PAGE BOUNDARY.  IF IT DID THEN     07330000
*        WE JUST NEED TO TRIM THE TOP 4K OFF.  ELSE, WE MUST TRIM       07340000
*        STORAGE ON BOTH SIDE OF THE AREA.                              07350000
*                                                                       07360000
         LA    R1,0(,R1)           CLEAR TOP BYTE                       07370000
         LA    R3,4095(,R1)        ADD A TAD LESS THAN 4K TO ADDRESS    07380000
         N     R3,=X'00FFF000'     STRIP LOW 12 BITS                    07390000
         CLR   R1,R3               IF RESULT IS NOT THE SAME AS ORGINAL 07400000
         BNE   GETCORE2            THEN AREA WAS NOT ON PAGE BOUNDARY   07410000
         EJECT                                                          07420000
*STEP 4: RELEASE THE 1ST 4K OF THE STORAGE AREA AND ADJUST THE          07430000
*        STRTING ADDRESS AND LENGTH BY THE SAME AMOUNT.                 07440000
*                                                                       07450000
         L     R0,=F'4096'         GET 4K                               07460000
         ALR   R3,R0               ADJUST STARTING ADDRESS              07470000
         SLR   R2,R0               DECREASE THE LENGTH BY 4K            07480000
         SRL   R0,3                COMPUTE DWORDS TO RELEASE            07490000
         DMSFRET  DWORDS=(0),LOC=(1)    FREE 1ST 4K                     07500000
         B     GETCORE3            GO FINISH UP                         07510000
         SPACE                                                          07520000
*STEP 5: RELEASE AS MUCH STORAGE AS NECESSARY (LESS THAN 4K GAURENTEED) 07530000
*        SO THAT THE ALLOCATED STORAGE AREA START ON A PAGE BNDRY.      07540000
*        NOTE THAT WE HAVE IN R3 THE ADDRESS WE WOULD LIKE THE AREA     07550000
*        TO START AT AND R1 CONTAINS THE ORGINAL ADDRESS.  THUS THE     07560000
*        DIFFERENCE WILL BE THE AMOUNT WE HAVE TO RELEASE.              07570000
*                                                                       07580000
GETCORE2 LR    R0,R3               R0 <- WANTED STARTING ADDRESS        07590000
         SR    R0,R1               LESS ACTUAL ADDRESS YIELDS EXCESS    07600000
         SR    R2,R0               SUBTRACT EXCESS FROM AREA LENGTH     07610000
         SRL   R0,3                COMPUTE DWORDS                       07620000
         DMSFRET  DWORDS=(0),LOC=(1)    FREE THE STORAGE AREA           07630000
         SPACE                                                          07640000
*STEP 6: WE MUST NOW FREE THE EXCESS AT THE END OF OUR STORAGE AREA.    07650000
*        THIS IS EASILY COMPUTED SINCE WE KNOW THAT THE LENGTH OF THE   07660000
*        STORAGE AREA MUST BE EXACTLY A MULTIPLE OF 4K, WE NEED ONLY    07670000
*        TO RELEASE THE AMOUNT INDICATED IN THE LOW ORDER 12 BITS OF    07680000
*        THE ACTUAL LENGTH QUANTITY AND ADJUST THE LENGTH BY THAT       07690000
*        AMOUNT.  THIS THE STORAGE AREA WILL BE IN PAGE CIRCUMSCRIBED   07700000
*        BOUNDARIES.                                                    07710000
*                                                                       07720000
         LR    R0,R2               R0 <- CURRENT LENGTH OF AREA         07730000
         N     R0,=F'4095'         ISOLATE LOW ORDER 12 BITS            07740000
         SR    R2,R0               SUBTRACT EXCESS OF ORIGINAL LENGTH   07750000
         LR    R1,R3               R1 <- A(STORAGE AREA)                07760000
         ALR   R1,R2               POINT TO STARTING AREA TO FREE       07770000
         SRL   R0,3                GET DWORDS                           07780000
         DMSFRET  DWORDS=(0),LOC=(1)    FREE THE STORAGE AREA           07790000
         SPACE                                                          07800000
*STEP 7: WE MUST NOW ADJUST THE AMOUNT CMS KEEPS TRACK OF AS SYSTEM     07810000
*        ALLOCATED BY THE AMOUNT WE HAVE ALLOCATED FOR OURSELVES.       07820000
*        THIS WILL PREVENT CMS FROM EVER MISSING THE STORAGE AREA.      07830000
*                                                                       07840000
GETCORE3 L     R15,ADMSFRT         GET A(FRETAB)                        07850000
         USING FRDSECT,R15                                              07860000
         L     R1,FREELOW1         GET ORIGINAL HIGH WATER MARK         07870000
         SLR   R1,R2               ADJUST BY THE AMOUNT WE ALLOCATED    07880000
         ST    R1,FREELOW1         AND UPDATE IT                        07890000
         DROP  R15                                                      07900000
         EJECT                                                          07910000
*STEP 8: CLEAR THE STORAGE AREA TO ZEROES                               07920000
*                                                                       07930000
         LR    R0,R3               R0 <- A(AREA)                        07940000
         LR    R1,R2               R1 <- L(AREA)                        07950000
         SR    R15,R15             ZERO FOR PAD MVCL                    07960000
         MVCL  R0,R14              CLEAR THE AREA                       07970000
         SPACE                                                          07980000
*STEP 9: SET PROTECT KEYS AND RETURN                                    07990000
*                                                                       08000000
         BAL   R14,SETKEY          SET PKEYS                            08010000
         SR    R15,R15             SET CC=0                             08020000
         BR    R10                 AND RETURN                           08030000
         SPACE                                                          08040000
*STEP 10: ON ERROR, RETURN WITH CC ^= 0                                 08050000
*                                                                       08060000
GETCORE6 LTR   R12,R12             SET CC ^ 0                           08070000
         BR    R10                 AND RETURN                           08080000
         EJECT                                                          08090000
*SUBROUTINE -                                                           08100000
*        SETKEY                                                         08110000
*                                                                       08120000
*FUNCTION -                                                             08130000
*        TO SET STORAGE PROTECT KEYS                                    08140000
*                                                                       08150000
*ENTRY CONDITIONS -                                                     08160000
*        R2  - LENGTH(AREA) IN BYTES                                    08170000
*        R3  - A(AREA)                                                  08180000
*        R14 - RETURN ADDRESS                                           08190000
*        *** - LKEY CONTAINS THE PROTECT KEY RIGHT JUSTIFIED.           08200000
*                                                                       08210000
*EXIT CONDITIONS -                                                      08220000
*        NONE.                                                          08230000
         SPACE                                                          08240000
*STEP 1: SET UP FOR SSK INSTRUCTION                                     08250000
*                                                                       08260000
SETKEY   LR    R0,R2               R0 <- L(AREA)                        08270000
         SRL   R0,11               CONVERT TO NUMBER OF PAGES * 2       08280000
         LR    R1,R3               R1 <- A(AREA)                        08290000
         IC    R15,LKEY            GET PROTECT KEY                      08300000
         SLL   R15,4               SHIFT INTO CORRECT POSITION          08310000
         SPACE                                                          08320000
*STEP 2: SET STORAGE TO CORRECT PROTECT KEY                             08330000
*                                                                       08340000
SETKEY01 SSK   R15,R1              SET PROTECT KEY                      08350000
         LA    R1,2048(,R1)        NEXT 2K BOUNDARY                     08360000
         BCT   R0,SETKEY01         DO ALL PAGES                         08370000
         BR    R14                 AND RETURN                           08380000
         EJECT                                                          08390000
*SUBROUTINE -                                                           08400000
*        RELNTRY                                                        08410000
*                                                                       08420000
*FUNCTION -                                                             08430000
*        TO RELEASE A LIBRARY ENTRY AND IF LAST ONE RELEASED, TO        08440000
*        TO RELEASE THE LIBRARY DIRECTORY PAGE.                         08450000
*                                                                       08460000
*ENTRY CONDITIONS -                                                     08470000
*        R7  - A(LIB ENTRY) TO FREE                                     08480000
*        R10 - RETURN ADDRESS                                           08490000
*                                                                       08500000
*EXIT CONDITIONS -                                                      08510000
*        CC = 0 -> LIBRARY DIRECTORY PAGE RELEASED, R7 IS ZERO.         08520000
*        CC ^ 0 -> LIBRARY ENTRY RELEASED, DIRECTORY NOT EMPTY.         08530000
*                  R7 HOLDS NEXT ENTRY ADDRESS.                         08540000
*                                                                       08550000
*NOTES -                                                                08560000
*        1. R0 - R3, R14, R15 MODIFIED.                                 08570000
         SPACE                                                          08580000
*STEP 1: COMPUTE NUMBER OF BYTES LEFT AFTER CURRENT ENTRY               08590000
*                                                                       08600000
RELNTRY  LA    R1,LIBTLEN          R1 <- LEN(LIB TAB)                   08610000
         AL    R1,&STATE           R1 <- A(LAST LIB TABLE BYTE)-PREFIX  08620000
         LA    R1,DMSRESRL(,R1)    R1 <- A(LAST LIB TABLE BYTE) + 1     08630000
         SLR   R1,R7               R1 <- ENDLOC - CURLOC (NUM BYTES)    08640000
         LR    R0,R7               R0 <- A(CURRENT ENTRY)               08650000
         SPACE                                                          08660000
*STEP 2: COMPUTE NUMBER OF BYTES TO BE MOVED AT ENTRY+1                 08670000
*                                                                       08680000
         LA    R14,LIBSIZE         R1 <- SIZE(EACH ENTRY)               08690000
         LR    R15,R1              R15<- TOTAL LENGTH INC CUR_ENTRY     08700000
         SLR   R15,R14             R15<- TOTAL LENGTH AFTER CURRENT ENT 08710000
         ALR   R14,R0              R14<- A(NEXT ENTRY)                  08720000
         SPACE                                                          08730000
*STEP 3: COMPRESS OUT THE DELETED ENTRY AND CHECK IF LIB TABLE EMPTY    08740000
*                                                                       08750000
         MVCL  R0,R14              COMPRESS LIB TABLE                   08760000
         L     R3,&STATE           R3 <- A(LIB TABLE)                   08770000
         CLI   DMSRESRL(R3),0      IF FIRST ENTRY IS NOT NULL           08780000
         BNER  R10                 THEN RETURN, ALL DONE                08790000
         SPACE                                                          08800000
*STEP 4: LIB TABLE IS EMPTY, RELEASE ITS STORAGE                        08810000
*                                                                       08820000
         MVC   &STATE.(4),ASTATE2-DMSRESRC(R3)    RESET STATE ADDRESS   08830000
         L     R2,=F'4096'         GET SIZE(LIB TABLE)                  08840000
         ST    R10,0(,R13)         SAVE RPA                             08850000
         BAL   R10,RELCORE         RELEASE THE STORAGE                  08860000
         L     R10,0(,R13)         RESTORE RPA                          08870000
         SR    R7,R7               NULL OUT ENTRY POINTER               08880000
         BR    R10                 RETURN WITH CC = 0                   08890000
         EJECT                                                          08900000
*SUBROUTINE -                                                           08910000
*        RETNTRY                                                        08920000
*                                                                       08930000
*FUNCTION -                                                             08940000
*        TO PLACE A VALUE IN THE CALLER'S REG 1.                        08950000
*                                                                       08960000
*ENTRY CONDITIONS -                                                     08970000
*        R1  - VALUE TO BE RETURNED                                     08980000
*        R10 - RETURN ADDRESS                                           08990000
*                                                                       09000000
*EXIT CONDITIONS -                                                      09010000
*        NONE.                                                          09020000
*                                                                       09030000
*NOTES -                                                                09040000
*        1. R15 MODIFIED.                                               09050000
         SPACE                                                          09060000
*STEP 1: RETURN VALUE TO CALLER                                         09070000
*                                                                       09080000
RETNTRY  L     R15,ASVCSECT        GET A(SVCSECT)                       09090000
         L     R15,CURRALOC-SVCSECT(,R15)    GET A(SSAVE)               09100000
         ST    R1,EGPR1-SSAVE(,R15)     SET NEW VALUE                   09110000
         BR    R10                 AND RETURN                           09120000
         EJECT                                                          09130000
*SUBROUTINE -                                                           09140000
*        SCANP                                                          09150000
*                                                                       09160000
*FUNCTION -                                                             09170000
*        TO CHECK IF WE ARE POINTING TO THE END OF THE PARAMS.          09180000
*                                                                       09190000
*ENTRY CONDITIONS -                                                     09200000
*        R8  - A(CURRENT TOKEN)                                         09210000
*        R10 - RETURN ADDRESS                                           09220000
*                                                                       09230000
*EXIT CONDITIONS -                                                      09240000
*        CC = 0 -> END OF PARAM DATA FOUND.                             09250000
*        CC ^ 0 -> MORE PARAM DATA EXISTS                               09260000
         SPACE                                                          09270000
*STEP 1: SET CC BASED ON CONTENTS OF TOKEN                              09280000
*                                                                       09290000
SCANP    CLI   0(R8),X'FF'         IF PLIST END                         09300000
         BER   R10                 THEN RETURN W/ CC=0                  09310000
         CLC   0(2,R8),=C'( '      IF OPTION LIST STARTING              09320000
         BR    R10                 THEN RETURN, AS CC IS SET            09330000
         EJECT                                                          09340000
*SUBROUTINE -                                                           09350000
*        GETLIB                                                         09360000
*                                                                       09370000
*FUNCTION -                                                             09380000
*        TO GET A(LIB TABLE)                                            09390000
*                                                                       09400000
*ENTRY CONDITIONS -                                                     09410000
*        R14 - RETURN ADDRESS                                           09420000
*                                                                       09430000
*EXIT CONDITIONS -                                                      09440000
*        CC = 0 -> LIB TABLE ALLOCATED; R7 HOLDS THE ADDRESS.           09450000
*        CC ^ 0 -> LIB TABLE NOT ALLOCATED; R7 MEANINGLESS.             09460000
         SPACE                                                          09470000
*STEP 1: GET THE A(LIB TABLE PREFIX) AND COMPUTE THE TRUE ADDRESS       09480000
*                                                                       09490000
GETLIB   L     R7,&STATE           GET A(CODE AREA)                     09500000
         CLC   0(4,R7),DMSRESRC    Is RES table initialized?   HRC415DS 09500100
         BNER  R14                 Return if not set up yet    HRC415DS 09500200
         LA    R7,DMSRESRL(,R7)    POINT TO START OF TABLE              09510000
         SPACE                                                          09520000
*STEP 2: CHECK IF LIB TABLE TRULY ALLOCATED                             09530000
*                                                                       09540000
         CL    R7,AUSRAREA         IF A(LIB TABLE) < USER AREA          09550000
         BLR   R14                 THEN RETURN                          09560000
         CL    R7,VMSIZE           IF A(LIB TABLE) > LAST LOC           09570000
         BHR   R14                 THEN RETURN                          09580000
         CLR   R14,R14             ELSE SET CC = 0                      09590000
         BR    R14                 AND RETURN                           09600000
         EJECT                                                          09610000
*SUBROUTINE -                                                           09620000
*        GETLEN                                                         09630000
*                                                                       09640000
*FUNCTION -                                                             09650000
*        TO COMPUTE THE LEN-1 OF A TOKEN.                               09660000
*                                                                       09670000
*ENTRY CONDITIONS -                                                     09680000
*        R8  - A(TOKEN TO SCAN)                                         09690000
*        R10 - RETURN ADDRESS                                           09700000
*                                                                       09710000
*EXIT CONDITIONS -                                                      09720000
*        R1  - LENGTH-1(TOKEN)                                          09730000
*        R2  - A(LAST NON-BLANK CHAR) IN TOKEN                          09740000
         SPACE                                                          09750000
*STEP 1: SCAN BACKWARDS FOR FIRTS NON-BLANK                             09760000
*                                                                       09770000
GETLEN   LA    R1,7                SET UP FOR LEN COMP                  09780000
         LA    R2,7(,R8)           POINT TO LAST CHAR IN TOKEN          09790000
         SPACE                                                          09800000
GETLENA  CLI   0(R2),C' '          IF CHAR ^= ' '                       09810000
         BNER  R10                 THEN DONE, FOUND THE LEN-1           09820000
         BCTR  R2,0                ELSE BACK UP 1 CHAR                  09830000
         BCT   R1,GETLENA          AND CHECK CHAR OUT (DEC COUNT)       09840000
         BR    R10                 ALL DONE, RETURN                     09850000
         EJECT                                                          09860000
*SUBROUTINE -                                                           09870000
*        GETNUM                                                         09880000
*                                                                       09890000
*FUNCTION -                                                             09900000
*        TO COMPUTE THE BINARY VALUE OF AN EBCDIC STRING.               09910000
*                                                                       09920000
*ENTRY CONDITIONS -                                                     09930000
*        R1  - LEN-1(TOKEN)                                             09940000
*        R8  - A(TOKEN) TO CONVERT                                      09950000
*        R10 - RETURN ADDRESS                                           09960000
*                                                                       09970000
*EXIT CONDITIONS -                                                      09980000
*        CC = 0 -> NUMBER CONVERTED, R15 HOLDS VALUE.                   09990000
*        CC ^ 0 -> NUMBER INVALID OR GREATER THAN 256.                  10000000
*                                                                       10010000
*NOTES -                                                                10020000
*        1. R0 IS MODIFIED.                                             10030000
         SPACE                                                          10040000
*STEP 1: PREPARE TO SCAN FOR INVALID DIGITS                             10050000
*                                                                       10060000
GETNUM   LA    R0,1(,R1)           GET FULL LENGTH                      10070000
         LR    R15,R8              R15 <- A(TOKEN)                      10080000
         SPACE                                                          10090000
*STEP 2: MAKE SURE ALL DIGITS ARE VALID                                 10100000
*                                                                       10110000
GETNUM1  CLI   0(R15),C'0'         IF CHAR < '0'                        10120000
         BLR   R10                 THEN INVALID                         10130000
         CLI   0(R15),C'9'         IF CHAR > '9'                        10140000
         BHR   R10                 THEN INVALID                         10150000
         LA    R15,1(,R15)         ELSE BUMP TO NEXT ONE                10160000
         BCT   R0,GETNUM1          AND CHECK NEXT ONE OUT               10170000
         SPACE                                                          10180000
*STEP 3: CONVERT THE ACTUAL STRING TO BINARY                            10190000
*                                                                       10200000
         EX    R1,PACK             PACK THE VALUE                       10210000
         CP    0(8,R13),=PL2'256'  IF VALUE > 256                       10220000
         BHR   R10                 THEN INVALID                         10230000
         CVB   R15,0(,R13)         ELSE CONVERT TO BINARY               10240000
         LA    R0,1                GET A COMPARE CONSTANT               10250000
         CR    R15,R0              IF VALUE < 1                         10260000
         BLR   R10                 THEN ZERO AND IS INVALID             10270000
         SR    R0,R0               ELSE SET CC = 0                      10280000
         BR    R10                 AND RETURN                           10290000
         EJECT                                                          10300000
*SUBROUTINE -                                                           10310000
*        RELCORE                                                        10320000
*                                                                       10330000
*FUNCTION -                                                             10340000
*        TO RELEASE PRIVATE STORAGE GOTTEN BY GETCORE.                  10350000
*                                                                       10360000
*ENTRY CONDITIONS -                                                     10370000
*        R2  - AMOUNT OF BYTES, TRUE, TO BE FREED.                      10380000
*        R3  - A(STORAGE AREA) TO BE FREED.                             10390000
*        R10 - RETURN ADDRESS.                                          10400000
*                                                                       10410000
*EXIT CONDITIONS -                                                      10420000
*        NONE.                                                          10430000
         SPACE                                                          10440000
*STEP 1: RESET THE PROTECT KEYS AND FREE THE STORAGE AREA               10450000
*                                                                       10460000
RELCORE  MVI   LKEY,X'0F'          SET KEY X'F0'                        10470000
         BAL   R14,SETKEY          SET THE PKEYS                        10480000
         LR    R0,R2               COPY BYTES                           10490000
         SRL   R0,3                GET DWORDS                           10500000
         LR    R1,R3               GET ADDRESS                          10510000
         DMSFRET  DWORDS=(0),LOC=(1)                                    10520000
         SPACE                                                          10530000
*STEP 2: ADJUST THE CMS FREETAB SO THAT CMS WILL GET ITS STORAGE        10540000
*        BACK.  IF WE DID NOT, CMS WOULD DIE.                           10550000
*                                                                       10560000
         L     R15,ADMSFRT         GET A(FREETAB)                       10570000
         USING FRDSECT,R15                                              10580000
         L     R1,FREELOW1         GET LOW WATER MARK                   10590000
         ALR   R1,R2               ADJUST IT UPWARDS                    10600000
         ST    R1,FREELOW1         UPDATE IT                            10610000
         BR    R10                 AND RETURN                           10620000
         DROP  R15                                                      10630000
         EJECT                                                          10640000
*SUBROUTINE -                                                           10650000
*        LOADTXT                                                        10660000
*                                                                       10670000
*FUNCTION -                                                             10680000
*        TO LOAD A TEXT DECK INTO PRIVATE STORAGE.                      10690000
*                                                                       10700000
*ENTRY CONDITIONS -                                                     10710000
*        R3  - ADDRESS AT WHICH THE ROUTINE IS TO BE LOADED.            10720000
*        R10 - RETURN ADDRESS                                           10730000
*                                                                       10740000
*EXIT CONDITIONS -                                                      10750000
*        CC = 0 -> ROUTINE LOADED.  REGISTERS CONTAIN:                  10760000
*                  R0 - A(NEXT LOAD POINT)                              10770000
*                  R1 - ENTRY POINT ADDRESS FROM THE LOADER.            10780000
*        CC ^ 0 -> ERROR DURING LOAD.                                   10790000
*                                                                       10800000
*NOTES -                                                                10810000
*        1. IN ALL CASES, R0, R1, R14, R15 ARE MODIFIED.                10820000
         SPACE                                                          10830000
*STEP 1: PLUG IN THE ORIGIN ADDRESS INTO THE COMMAND LINE               10840000
*                                                                       10850000
LOADTXT  LINEDIT  TEXT='........',BUFFA=LOADTXTA,DOT=NO,DISP=NONE,     X10860000
               SUB=(HEX,(R3))                                           10870000
         MVI   LOADTXTA,C' '       REMOVE THE LENGTH FIELD              10880000
         SPACE                                                          10890000
*STEP 2: INDICATE THAT IT IS OK TO LOAD  ANYWHERE AND ISSUE THE LOAD    10900000
*        COMMAND VIA SVC 202.  NOTE THAT THE CALLER MUST HAVE FILLED    10910000
*        IN THE NAME OF THE TEXT DECK TO BE LOADED AT LOADTXTN.         10920000
*                                                                       10930000
         OI    MODFLGS,SYSLOAD     TELL LOADER TO SKIP CHECKS           10940000
         LA    R1,LOADTXTC         POINT TO COMMAND LINE                10950000
         SVC   202                 ISSUE COMMAND SVC                    10960000
         DC    AL4(*+4)                                                 10970000
         SPACE                                                          10980000
*STEP 3: PICK UP THE EPA THAT THE LOADER LEFT IN NUCON AND ZERO OUT     10990000
*        THE LOCATION COUNTER SO THAT THE NEXT LOAD DOES NOT FAIL       11000000
*        BECAUSE THE LOADER WILL TRY TO LOAD AFTER THAT LOC.  THEN      11010000
*        EXIT BASED ON THE RC FROM THE LOADER.                          11020000
*                                                                       11030000
         L     R0,LOCCNT           GET NEXT LOAD POINT                  11040000
         L     R1,STRTADDR         GET EPA                              11050000
         XC    LOCCNT(4),LOCCNT    ZERO OUT LOC COUNTER                 11060000
         LTR   R15,R15             SET CC BASED ON RC                   11070000
         BR    R10                 AND RETURN                           11080000
         EJECT                                                          11090000
*SUBROUTINE -                                                           11100000
*        TYPENTRY                                                       11110000
*                                                                       11120000
*FUNCTION -                                                             11130000
*        TO TYPE OR STACK A LIB TABLE ENTRY                             11140000
*                                                                       11150000
*ENTRY CONDITIONS -                                                     11160000
*        R7  - A(LIB TABLE ENTRY)                                       11170000
*        R10 - RETURN ADDRESS                                           11180000
*                                                                       11190000
*EXIT CONDITIONS -                                                      11200000
*        IF SOMETHING WAS STACKED OR TYPED, HDR FLAG IS SET.            11210000
*                                                                       11220000
*NOTES -                                                                11230000
*        1. THE CALLER MUST INDICATE IF TYPING OR STACKING IS           11240000
*           WANTED BY THE OPTSTK & OPTYPE FLAG IN OBITS.                11250000
*                                                                       11260000
*        2. R0 - R4, R14, R15 MODIFIED.                                 11270000
         SPACE                                                          11280000
*STEP 1: CHECK IF A HEADER LINE IS TO BE TYPED.                         11290000
*                                                                       11300000
TYPENTRY TM    FBITS,HDR           IF WE TYPED A HDR                    11310000
         BO    TYPENTRX            THEN SKIP TYPING IT AGAIN            11320000
         OI    FBITS,HDR           ELSE INDICATE WE HAVE TYPED          11330000
         TM    OBITS,OPNTYPE       IF NOTYPE IS REQUESTED               11340000
         BO    TYPENTRX            THEN SKIP THE HEADER LINE            11350000
         WRTERM  'ENTRY ID  E.P.A.  PAGE  AMT  KEY  ATTRIBUTES'         11360000
         SPACE                                                          11370000
*STEP 2: GATHER ALL INFORMATION TO BE TYPED OR STACKED                  11380000
*                                                                       11390000
TYPENTRX TM    OBITS,OPTYPE+OPTSTK IF NOTYPE & NOSTACK                  11400000
         BZR   R10                 THEN ALL DONE                        11410000
         MVC   STSAVE(8),=8C' '    ELSE CLEAR AREA                      11420000
         TM    LIBFLAGS,LIBPERM    IF FLAG NOT SET                      11430000
         BNO   *+10                THEN NOT PERM                        11440000
         MVC   STSAVE(4),=C'PERM'  ELSE INDICATE PERM                   11450000
         TM    LIBFLAGS,LIBSYS     IF INDICATOR NOT SET                 11460000
         BNO   *+10                THEN NOT SYSTEM ROUTINE              11470000
         MVC   STSAVE+5(3),=C'SYS' ELSE INDICATE SYSTEM                 11480000
         LM    R2,R3,LIBLEN        GET LENGTH AND LOC                   11490000
         SRL   R2,12               COMPUTE NUMBER OF PAGES              11500000
         SRL   R3,12               COMPUTE PAGE NUMBER                  11510000
         SR    R4,R4               PREPARE FOR IC                       11520000
         IC    R4,LIBKEY           GET STORAGE KEY                      11530000
         EJECT                                                          11540000
*STEP 3: FORMAT THE DATA TO BE TYPED                                    11550000
*                                                                       11560000
         LINEDIT  TEXT='........  ......   ...  ...   ..  ........',   X11570000
               DOT=NO,COMP=NO,RENT=NO,DISP=NONE,BUFFA=BUFFER,          X11580000
               SUB=(CHARA,LIBID,HEXA,LIBEPA,HEX,(R3),DEC,(R2),         X11590000
               DEC,(R4),CHARA,STSAVE)                                   11600000
         SPACE                                                          11610000
*STEP 4: CHECK IS WE MUST TYPE THE RESULTING DATA                       11620000
*                                                                       11630000
         TM    OBITS,OPTYPE        IF NOTYPING                          11640000
         BNO   TYPENTRW            THEN SKIP THE WRTERM                 11650000
         SR    R2,R2               ELSE PREPARE FOR IC                  11660000
         IC    R2,BUFFER           GET THE ACTUAL LENGTH                11670000
         WRTERM  BUFFER+1,(2)      WRITE THE LINE                       11680000
         SPACE                                                          11690000
*STEP 4: CHECK IF WE MUST STACK THE LINE                                11700000
*                                                                       11710000
TYPENTRW TM    OBITS,OPTSTK        IF STACK NOT WANTED                  11720000
         BNOR  R10                 THEN RETURN                          11730000
         MVC   TYPENTRL(1),BUFFER  ELSE SET THE LENGTH                  11740000
         LA    R1,TYPENTRP         POINT TO STACK PLIST                 11750000
         SVC   202                 STACK THE LINE                       11760000
         BR    R10                 AND RETURN                           11770000
         SPACE 2                                                        11780000
* STACK PLIST                                                           11790000
*                                                                       11800000
TYPENTRP DC    CL8'ATTN',C'FIFO'                                        11810000
TYPENTRL DC    AL4(BUFFER+1)                                            11820000
         EJECT                                                          11830000
*********************************************************************** 11840000
*                                                                     * 11850000
*       S T O R A G E    A R E A S    &    C O N S T A N T S          * 11860000
*                                                                     * 11870000
*********************************************************************** 11880000
         SPACE                                                          11890000
* EXECUTED COMMANDS                                                     11900000
*                                                                       11910000
PACK     PACK  0(8,R13),0(0,R8)    PACK A VALUE                         11920000
CLCOPT   CLC   OPTNAME-OPTBLOK(*-*,R5),0(R8) CHECK OPTIONA NAME         11930000
CLCSYN   CLC   LOADTXTN(*-*),8(R3) LOOK FOR SYNONYM                     11940000
CLCFUNC  CLC   FUNCNAME(*-*),0(R8) CHECK FUNCTION NAME                  11950000
         SPACE                                                          11960000
* LOAD COMMAND LINE                                                     11970000
*                                                                       11980000
LOADTXTC DC    CL8'LOAD'                                                11990000
LOADTXTN DC    8C' ',CL8'(',CL8'NOMAP',CL7'ORIGIN'                      12000000
LOADTXTA DC    9C' ',8X'FF'                                             12010000
         SPACE                                                          12020000
* VALID FUNCTION TABLE                                                  12030000
*                                                                       12040000
FUNCTAB  DC    CL8'ALLOCATE',AL1(NAMOK+PERMOK+KEYOK,0)                  12050000
         B     ALO                 -> FUNCTION                          12060000
         DC    CL8'DELETE',AL1(0,0)                                     12070000
         B     DELT                -> FUNCTION                          12080000
         DC    CL8'LIST',AL1(TYPOK+STKOK,SKPNAME)                       12090000
         B     LST                                                      12100000
FUNCTABE DC    CL8'LOAD',AL1(PERMOK+SYSOK+NAMOK,0)                      12110000
         B     LOADF                                                    12120000
         SPACE                                                          12130000
* VALID OPTION TABLE                                                    12140000
*                                                                       12150000
OPTABLE  DC    CL8'KEY',AL1(KEYOK,OPTKEY,255,2)                         12160000
CHKKEY   EQU   OPTABLE                                                  12170000
CHKNAMO  DC    CL8'NAME',AL1(NAMOK,OPTNAM,255,3)                        12180000
         DC    CL8'NOTYPE',AL1(TYPOK,OPNTYPE,255-OPTYPE,2)              12190000
         DC    CL8'PERM',AL1(PERMOK,OPTPERM,255,3)                      12200000
         DC    CL8'STACK',AL1(STKOK,OPTSTK,255,4)                       12210000
         DC    CL8'SYSTEM',AL1(SYSOK,OPTSYS,255,2)                      12220000
OPTABND  DC    CL8'TYPE',AL1(TYPOK,OPTYPE,255-OPNTYPE,0)                12230000
         EJECT                                                          12240000
* MISC.                                                                 12250000
*                                                                       12260000
SAVENUM  DC    H'0'                SAVE AREA FOR NUMBER                 12270000
NEWNAME  DC    8C' '               NEW NAME FOR NAME OPTION             12280000
LKEY     DC    X'00'               REQUESTED PROTECT KEY                12290000
         SPACE                                                          12300000
OBITS    DC    X'00'               OPTION FLAG BYTE                     12310000
OPTPERM  EQU   X'01'               PERM OPTION IN EFFECT                12320000
OPTSTK   EQU   X'02'               STACK OPTION IN EFFECT               12330000
OPTYPE   EQU   X'04'               TYPE OPTION IN EFFECT                12340000
OPNTYPE  EQU   X'08'               NOTYPE OPTION SPECIFIED              12350000
OPTSYS   EQU   X'10'               SYSTEM OPTION IN EFFECT              12360000
OPTNAM   EQU   X'20'               NAME OPTION IN EFFECT                12370000
OPTKEY   EQU   X'40'               KEY OPTION IN EFFECT                 12380000
         SPACE                                                          12390000
FBITS    DC    X'00'               MORE FLAGS                           12400000
HDR      EQU   X'10'               HEADER HAS BEEN TYPED                12410000
SEEKADR  EQU   X'20'               SCANTAB TO SEARCH VIA ADDRESS        12420000
         SPACE                                                          12430000
BUFFER   DC    50C' '                                                   12440000
DTEMP    DS    1D                  DOUBLEWORD WORK AREA                 12450000
         SPACE                                                          12460000
         LTORG                                                          12470000
         EJECT                                                          12480000
*********************************************************************** 12490000
*                                                                     * 12500000
*      R E S I D E N T    C O M M A N D    P R O C E S S I N G        * 12510000
*                                                                     * 12520000
*********************************************************************** 12530000
         SPACE                                                          12540000
*STEP 1: MAKE SURE THAT ENTRY IS FROM DMSMOD VIA DMSITS                 12550000
*                                                                       12560000
         DS    0D                  ALIGN ON CORRECT BOUNDARY            12570000
         USING *,R15                                                    12580000
DMSRESRC STM   R0,R7,STSAVE        SAVE SOME REGS                       12590000
         LA    R0,0(,R11)          CLEAR TOP BYTE OF RETADDR            12600000
         CL    R0,ACMSRET          IF RETADDR >= DMSITS RPA             12610000
         BNL   FINDRES4            THEN NOT PROPER CALL                 12620000
         CLR   R0,R5               IF RETADDR < DMSITS BASE ADDRESS     12630000
         BNH   FINDRES4            THEN NOT PROPER CALL                 12640000
         SPACE                                                          12650000
*STEP 2: MAKE SURE THAT THIS IS A PROPER DMSMOD CALLING SEQUENCE        12660000
*                                                                       12670000
         CL    R10,AFVS            IF R10 ^- A(FVSECT)                  12680000
         BNE   FINDRES4            THEN INVALID CALL                    12690000
         LA    R0,0(,R7)           GET PARM ADDRESS                     12700000
         L     R3,ASVCSECT         GET A(SVCSECT)                       12710000
         LA    R2,MODLIST-SVCSECT(,R3)  POINT TO DMSITS PLIST           12720000
         CLR   R2,R0               IF NOT CORRECT PLIST                 12730000
         BNE   FINDRES4            THEN BAG IT                          12740000
         SPACE                                                          12750000
*STEP 3: INITIALIZE FOR DMSRESRC PROCESSING                             12760000
*                                                                       12770000
         LA    R7,DMSRESRL(,R15)   POINT TO START OF TABLE              12780000
         LA    R0,LIBMAXN          GET MAX NUMBER OF ENTRIES            12790000
         SPACE                                                          12800000
*STEP 4: ATTEMPT TO FIND RESIDENT COMMAND IN LIB TABLE                  12810000
*                                                                       12820000
FINDRES1 CLC   LIBID(8),8(R1)      IF COMMAND NAMES THE SAME            12830000
         BE    FINDRES2            THEN POSSIBLE MATCH                  12840000
         CLI   LIBID,X'01'         IF END OF LIST FOUND                 12850000
         BL    FINDRES4            THEN COMMAND NOT FOUND               12860000
         LA    R7,LIBSIZE(,R7)     ELSE BUMP TO NEXT ENTRY              12870000
         BCT   R0,FINDRES1         AND LOOK AT IT                       12880000
         B     FINDRES4            COMMAND NOT FOUND                    12890000
         EJECT                                                          12900000
*STEP 5: CHECK IF ENTRY TRULY A COMMAND AND IF SO, PROCESS IT           12910000
*                                                                       12920000
FINDRES2 TM    LIBFLAGS,LIBCMD     IF NOT A COMMAND                     12930000
         BNO   FINDRES4            THEN IGNORE IT                       12940000
         MVC   STRTADDR(4),LIBEPA  ELSE SET ENTRY POINT                 12950000
         NI    PROTFLAG,255-PRFUSYS     ASSUME USER COMMAND             12960000
         TM    LIBFLAGS,LIBSYS     IF NOT SYSTEM                        12970000
         BNO   FINDRES3            THEN ASSUMPTION CORRECT              12980000
         OI    SFLAG-SVCSECT(R3),SFSYS+SFNUC SET APPROPRIATE FLAGS      12990000
         SPACE                                                          13000000
*STEP 5: RETURN TO DMSITS SO THAT COMMAND EXECUTION MAY START           13010000
*                                                                       13020000
FINDRES3 SR    R15,R15                  SET RC = 0                      13030000
         BR    R11                 AND RETURN                           13040000
         SPACE                                                          13050000
*STEP 7: INVALID ENTRY OR COMMAND NOT FOUND, CONTINUE W/ NORMAL XEQ     13060000
*                                                                       13070000
FINDRES4 LM    R0,R7,STSAVE        RESTORE THE REGS                     13080000
         L     R15,ASTATE2         GET A(TRUE STATE ROUTINE)            13090000
         BR    R15                 AND CONTINUE NORMALLY                13100000
         SPACE                                                          13110000
* STORAGE FOR LOCAL ROUTINE                                             13120000
*                                                                       13130000
ASTATE2  DC    A(0)                A(TRUE STATE ROUTINE)                13140000
STSAVE   DS    9F                  SAVE AREA                            13150000
         SPACE                                                          13160000
DMSRESRL EQU   (*-DMSRESRC+7)/8*8  LENGTH OF SPECIAL CODE               13170000
         DROP  R15                                                      13180000
         EJECT                                                          13190000
*********************************************************************** 13200000
*                                                                     * 13210000
*                   L O C A L    D S E C T S                          * 13220000
*                                                                     * 13230000
*********************************************************************** 13240000
         SPACE                                                          13250000
* MAPPING OF FUNCTAB                                                    13260000
*                                                                       13270000
FUNCBLOK DSECT                                                          13280000
FUNCNAME DC    8C' '               NAME OF FUNCTION                     13290000
FUNCOPT  DC    X'00'               VALID OPTIONS FOR FUNCTION           13300000
TYPOK    EQU   X'01'               TYPE/NOTYPE OPTION VALID             13310000
STKOK    EQU   X'02'               STACK OPTION VALID                   13320000
SYSOK    EQU   X'04'               SYSTEM OPTION VALID                  13330000
PERMOK   EQU   X'08'               PERM OPTION VALID                    13340000
NAMOK    EQU   X'10'               NAME OPTION VALID                    13350000
KEYOK    EQU   X'20'               KEY OPTION VALID                     13360000
FUNCFLAG DC    X'00'               PROCESSING OPTIONS                   13370000
IXEQ     EQU   X'01'               EXECUTE IMMEDIATELY                  13380000
NOFPROC  EQU   X'02'               DO NOT SCAN FOR FUNCTION <ID>        13390000
SKPNAME  EQU   X'04'               FUNCTION <ID> IS OPTIONAL            13400000
FUNCXEQ  NOP   0                   EXECUTION BRANCH                     13410000
FUNCTABL EQU   *-FUNCBLOK          LENGTH OF EACH ENTRY                 13420000
         SPACE                                                          13430000
* MAPPING OF OPTION TABLE                                               13440000
*                                                                       13450000
OPTBLOK  CSECT                                                          13460000
OPTNAME  DC    8C' '               NAME OF OPTION                       13470000
OPTVALID DC    X'00'               OPTION/FUNCTION MAPPING FLAGS        13480000
OPTBITS  DC    X'00'               OPTION INDICATORS                    13490000
OPTMASK  DC    X'00'               MASK FOR RESETTING OPTION INDICATORS 13500000
OPTLEN   DC    X'00'               MINIMUM ABBREVIATION AS LEN-1        13510000
OPTABLN  EQU   *-OPTBLOK           LEN(EACH ENTRY)                      13520000
         SPACE                                                          13530000
* MAPPING OF A LIB TABLE ENTRY                                          13540000
*                                                                       13550000
LIBNTRY  DSECT                                                          13560000
LIBID    DC    8C' '               FNAME IN AREA                        13570000
LIBEPA   DC    A(0)                ENTRY POINT ADDRESS                  13580000
LIBFLAGS EQU   LIBEPA              FLAGS AS FOLLOWS:                    13590000
LIBPERM  EQU   X'80'               PERM SPACE                           13600000
LIBSYS   EQU   X'40'               SYSTEM SPACE                         13610000
LIBCMD   EQU   X'20'               COMMAND ROUTINE LOADED               13620000
LIBLEN   DC    A(0)                LENGTH OF STORAGE AREA               13630000
LIBADR   DC    A(0)                ADDRESS OF STORAGE AREA              13640000
LIBKEY   EQU   LIBADR              ASSIGNED STORAGE PROTECT KEY         13650000
LIBSIZE  EQU   *-LIBNTRY           SIZE OF EACH ENTRY                   13660000
LIBTLEN  EQU   4096-DMSRESRL       LENGTH(LIB TABLE)                    13670000
LIBMAXN  EQU   LIBTLEN/LIBSIZE     MAX NUMBER OF ENTRIES                13680000
         EJECT                                                          13690000
         NUCON                                                          13700000
         DMSFRT                                                         13710000
         CMSAVE                                                         13720000
         SVCSECT                                                        13730000
         REGEQU                                                         13740000
         END   DMSRES                                                   13750000