     TITLE 'DMSSEG: SEGMENT command processor'                          00010000
**************************************************************          00020000
* Manage saved segments in a virtual machine.                *          00030000
*        Load a saved segment into the virtual machine.      *          00040000
*        Delete a saved segment from the virtual machine.    *          00050000
* *later Reserve CMS storage for saved segments.             *          00060000
* *later Release CMS storage for saved segments.             *          00070000
**************************************************************          00080000
DMSSGM   CSECT                                                          00090000
         USING NUCON,0                                                  00100000
         STM   R14,R12,12(R13)                                          00110000
         LR    R12,R15                                                  00120000
         USING DMSSGM,R12                                               00130000
*                                                                       00140000
         LA    R3,8(,R1)          Point to call type in plist           00150000
         CLI   0(R3),X'FF'        Present?                              00160000
         BE    NOFUNC             No, Name is missing                   00170000
TYPLKUP  DS    0H                                                       00180000
         LA    R15,7(,R3)         Point to byte 8 of function           00190000
         CLI   0(R15),C' '        Is is blank                           00200000
         BNE   *+8                Yes skip out                          00210000
         BCT   R15,*-8            Go test previous byte                 00220000
*                                                                       00230000
         LA    R15,1(,R15)                                              00240000
         SR    R15,R3             User supplied function name           00250000
         BCTR  R15,0                 length minus one                   00260000
*                                                                       00270000
         LA    R2,FNCTBL          Start of function table               00280000
         LA    R4,FNCTBLNE        Number of entries                     00290000
FNCLKUP2 DS    0H                                                       00300000
         CLM   R15,B'0001',8(R2)  Check against entry min size          00310000
         BL    FNCLKUP3           Provided name too short               00320000
         CLC   0(*-*,R2),0(R3)                                          00330000
         EX    R15,*-6            Does function name match?             00340000
         BNE   FNCLKUP3           If, not, go check next                00350000
*                                                                       00360000
         ICM   R15,B'1111',9(R2)  Get function handler address          00370000
         LA    R3,8(,R3)          Point to segment name                 00380000
         CLI   0(R3),X'FF'        Present?                              00390000
         BE    NONAME             No, Name is missing                   00400000
         MVC   EXTNAME,0(R3)      Set the segment name as               00410000
*                                   the name of the Nucleus             00420000
*                                     Extension                         00430000
         BR    R15                Go process the function               00440000
*                                                                       00450000
FNCLKUP3 DS    0H                                                       00460000
         LA    R2,FNCENTLN(,R2)   Skip to next tbl entry                00470000
         BCT   R4,FNCLKUP2          and go check that one               00480000
         B     INVFUNC            No match on supplied option           00490000
     TITLE 'DMSSEG: SEGMENT command LOAD processor'                     00500000
*------------------------------------------------------------*          00510000
* Look for the runtime library in a saved segment.           *          00520000
*------------------------------------------------------------*          00530000
FNCLOAD  DS    0H                                                       00540000
         LA    R3,8(,R3)          Point past segment name               00550000
         CLI   0(R3),X'FF'        Any options?                          00560000
         BE    FNCLOAD2           None specified, continue              00570000
         CLI   0(R3),C'('         Any options?                          00580000
         BNE   EXTRAN             If not, extraneous operand            00590000
*                                                                       00600000
LDOLKUP1 DS    0H                                                       00610000
         LA    R3,8(,R3)          Point to next option name             00620000
         CLI   0(R3),X'FF'        Any options?                          00630000
         BE    FNCLOAD2           None specified, continue              00640000
* Scan the options                                                      00650000
         LA    R15,7(,R3)         Point to byte 8 of function           00660000
         CLI   0(R15),C' '        Is is blank                           00670000
         BNE   *+8                Yes skip out                          00680000
         BCT   R15,*-8            Go test previous byte                 00690000
*                                                                       00700000
         LA    R15,1(,R15)                                              00710000
         SR    R15,R3             User supplied function name           00720000
         BCTR  R15,0                 length minus one                   00730000
*                                                                       00740000
         LA    R2,LDOTBL          Start of option table                 00750000
         LA    R4,LDOTBLNE        Number of entries                     00760000
LDOLKUP2 DS    0H                                                       00770000
         CLM   R15,B'0001',8(R2)  Check against entry min size          00780000
         BL    LDOLKUP3           Provided name too short               00790000
         CLC   0(*-*,R2),0(R3)                                          00800000
         EX    R15,*-6            Does function name match?             00810000
         BNE   LDOLKUP3           If, not, go check next                00820000
*                                                                       00830000
         OC    LDOFLAG,9(R2)      Set option flag bit                   00840000
         B     LDOLKUP1           Go process next option                00850000
*                                                                       00860000
LDOLKUP3 DS    0H                                                       00870000
         LA    R2,LDOENTLN(,R2)   Skip to next tbl entry                00880000
         BCT   R4,LDOLKUP2          and go check that one               00890000
         B     INVOPT             No match on supplied option           00900000
**                                                                      00910000
FNCLOAD2 DS    0H                                                       00920000
         MVC   NUCEXTQL(NUCXTQPL),NUCEXTQP Init MF=L area               00930000
         NUCEXT QUERY,NAME=EXTNAME,MF=(E,NUCEXTQL) Exist?               00940000
         LTR   R15,R15                                                  00950000
         BZ    ALREADY            Skip if it does                       00960000
*                                                                       00970000
         LA    R6,EXTNAME         Get name of shared segment            00980000
         LA    R7,FINDSYS         Determine if it is loaded             00990000
         DIAG  R6,R7,X'064'         or if it even exists                01000000
         BZ    FNCAVAIL           Exists and is loaded                  01010000
         BP    NOTFOUND           Does not exist or                     01020000
*                                    paging I/O error                   01030000
*        Here if segment has not been loaded                            01040000
*                                                                       01050000
         LA    R8,1(,R7)          Ending address of segment +1          01060000
         SR    R8,R6              Length of the segment                 01070000
         DIAG  R5,0,X'060'        Get virtual machine size              01080000
         CLR   R6,R5              Segment inside our storage?           01090000
         BL    INSIDEVM           Skip next for now                     01100000
*                                 Later we will allow loading           01110000
*                                   inside the virtual machine          01120000
         LA    R6,EXTNAME         Get name of shared segment            01130000
         LA    R7,LOADSHR         Load it as shared                     01140000
         DIAG  R6,R7,X'064'       saved segment                         01150000
         BNZ   LOADFAIL           Sonething unexpected                  01160000
*------------------------------------------------------------*          01170000
*  Here if segment loaded in memory at address in R6         *          01180000
*  Create a Nucleus extension with the segment address.      *          01190000
*------------------------------------------------------------*          01200000
FNCAVAIL DS    0H                                                       01210000
         MVC   NUCEXTSL(NUCXTSPL),NUCEXTSP Init MF=L area               01220000
         NUCEXT SET,NAME=EXTNAME,ENTRY=(R6),                           *01230000
               ORIGIN=(0,(R8)),KEY=(LDOFLAG,LDOSYSTM),                 *01240000
               SYSTEM=(LDOFLAG,LDOSYSTM),                              *01250000
               PERM=(LDOFLAG,LDOSYSTM),MF=(L,NUCEXTSL)                  01260000
* Setting the segment name and bit are not part of the NUCEXT SET       01270000
* macro processing.                                                     01280000
         MVC   36(8,R1),EXTNAME   Set plist Segment name                01290000
         OI    18(R1),X'20'       Set plist Segment bit                 01300000
*                                                                       01310000
         SVC   202                Issue the NUCEXT SET                  01320000
         DC    AL4(1)                                                   01330000
*                                                                       01340000
         LTR   R5,R15                                                   01350000
         BZ    EXIT0              Exit if successful                    01360000
*                                                                       01370000
         LINEDIT TEXT='NUCEXT SET return code .....',                  *01380000
               SUB=(DEC,(R5))                                           01390000
         LA    R15,24             Not found RC                          01400000
         B     GOBACK             Done                                  01410000
     TITLE 'DMSSEG: SEGMENT command DELETE processor'                   01420000
FNCDELET DS    0H                                                       01430000
         MVC    NUCEXTCL(NUCXTCPL),NUCEXTCP Init MF=L area              01440000
         NUCEXT CLR,NAME=EXTNAME,                                      *01450000
               MF=(E,NUCEXTCL)                                          01460000
         LTR   R5,R15                                                   01470000
         BZ    SEGPURGE           Exit if successful                    01480000
         LINEDIT TEXT='NUCEXT CLR return code .....',                  *01490000
               SUB=(DEC,(R5))                                           01500000
         LA    R15,24             Not found RC                          01510000
         B     GOBACK             Done                                  01520000
*                                                                       01530000
SEGPURGE DS    0H                                                       01540000
         LA    R6,EXTNAME         Get name of shared segment            01550000
         LA    R7,PURGESYS        Remove it from this machine           01560000
         DIAG  R6,R7,X'064'                                             01570000
         B     EXIT0              Done                                  01580000
     TITLE 'DMSSEG: SEGMENT command EXITs'                              01590000
*                                                                       01600000
NOFUNC   DS    0H                                                       01610000
         LINEDIT TEXT='No function specified'                           01620000
         LA    R15,24                                                   01630000
         B     GOBACK             Done                                  01640000
*                                                                       01650000
NONAME   DS    0H                                                       01660000
         LINEDIT TEXT='No segment name specified'                       01670000
         LA    R15,24                                                   01680000
         B     GOBACK             Done                                  01690000
*                                                                       01700000
EXTRAN   DS    0H                                                       01710000
         LINEDIT TEXT='Extraneous operand: ........',                  *01720000
               SUB=(CHARA,((R3),8))                                     01730000
         LA    R15,24             Not found RC                          01740000
         B     GOBACK             Done                                  01750000
*                                                                       01760000
INVOPT   DS    0H                                                       01770000
         LINEDIT TEXT='Invalid option: ........',                      *01780000
               SUB=(CHARA,((R3),8))                                     01790000
         LA    R15,24             Not found RC                          01800000
         B     GOBACK             Done                                  01810000
*                                                                       01820000
INVFUNC  DS    0H                                                       01830000
         LINEDIT TEXT='Invalid function: ........',                    *01840000
               SUB=(CHARA,((R3),8))                                     01850000
         LA    R15,24             Not found RC                          01860000
         B     GOBACK             Done                                  01870000
*                                                                       01880000
NOTFOUND DS    0H                                                       01890000
         LINEDIT TEXT='Segment ........ not found',                    *01900000
               SUB=(CHARA,EXTNAME)                                      01910000
         LA    R15,24             Not found RC                          01920000
         B     GOBACK             Done                                  01930000
*                                                                       01940000
LOADFAIL DS    0H                                                       01950000
         LINEDIT TEXT='Segment ........ load failed',                  *01960000
               SUB=(CHARA,EXTNAME)                                      01970000
         LA    R15,24             Not found RC                          01980000
         B     GOBACK             Done                                  01990000
*                                                                       02000000
INSIDEVM DS    0H                                                       02010000
         LINEDIT TEXT='Segment ........ is not loaded because virtual m*02021000
               achine memory is in use',                       HRC427DS*02022000
               SUB=(CHARA,EXTNAME)                                      02040000
         LA    R15,24             Not found RC                          02050000
         B     GOBACK             Done                                  02060000
*                                                                       02070000
ALREADY  DS    0H                                                       02080000
         LINEDIT TEXT='........ already defined',                      *02090000
               SUB=(CHARA,EXTNAME)                                      02100000
         LA    R15,24             Not found RC                          02110000
         B     GOBACK             Done                                  02120000
*                                                                       02130000
EXIT0    DS    0H                                                       02140000
         SR    R15,R15                                                  02150000
GOBACK   DS    0H                                                       02160000
         L     R14,12(,R13)                                             02170000
         LM    R0,R12,20(R13)                                           02180000
         BR    R14                                                      02190000
     TITLE 'DMSSEG: SEGMENT command Data areas'                         02200000
*------------------------------------------------------------*          02210000
*                                                            *          02220000
* The function table format is:                              *          02230000
*        Function name             8 characters              *          02240000
*        Minimum name length - 1   1 byte numeric            *          02250000
*        Function handler    -     4 byte routine address    *          02260000
*                                                            *          02270000
*------------------------------------------------------------*          02280000
FNCTBL   DS    0D  Name      Minimum length - 1, Flag Bit               02290000
         DC    CL8'LOAD    ',AL1(4-1),AL4(FNCLOAD)                      02300000
FNCENTLN EQU   *-FNCTBL          Length of an entry                     02310000
         DC    CL8'DELETE  ',AL1(2-1),AL4(FNCDELET)                     02320000
FNCTBLNE EQU   (*-FNCTBL)/FNCENTLN Number of entries                    02330000
*------------------------------------------------------------*          02340000
*                                                            *          02350000
* The LOAD options table format is:                          *          02360000
*        Option name               8 characters              *          02370000
*        Minimum name length - 1   1 byte numeric            *          02380000
*        Option bit          -     Flag set for option       *          02390000
*                                                            *          02400000
*------------------------------------------------------------*          02410000
LDOTBL   DS    0D  Name      Minimum length - 1, Flag Bit               02420000
         DC    CL8'USER    ',AL1(4-1,LDOUSER)                           02430000
LDOENTLN EQU   *-LDOTBL          Length of an entry                     02440000
         DC    CL8'SYSTEM  ',AL1(6-1,LDOSYSTM)                          02450000
         DC    CL8'SHARE   ',AL1(2-1,LDOSHARE)                          02460000
         DC    CL8'NOSHARE ',AL1(4-1,LDONSHAR)                          02470000
LDOTBLNE EQU   (*-LDOTBL)/LDOENTLN Number of entries                    02480000
*                                                                       02490000
* Diagnose 64 subcodes                                                  02500000
*                                                                       02510000
LOADSHR  EQU   0                 Load segment shared mode               02520000
LOADSYS  EQU   4                 Load segment nonshared mode            02530000
PURGESYS EQU   8                 Release the named segment              02540000
FINDSYS  EQU   12                Find the segment start addr            02550000
*                                                                       02560000
NUCEXTSP NUCEXT SET,NAME='NAME',MF=L                                    02570000
NUCXTSPL EQU    *-NUCEXTSP                                              02580000
NUCEXTCP NUCEXT CLR,NAME='NAME',MF=L                                    02590000
NUCXTCPL EQU    *-NUCEXTCP                                              02600000
NUCEXTQP NUCEXT QUERY,NAME='NAME',MF=L                                  02610000
NUCXTQPL EQU    *-NUCEXTQP                                              02620000
  TITLE 'DMSNXT: Work areas'                                            02630000
NUCEXTSL NUCEXT SET,NAME='NAME',MF=L                                    02640000
NUCEXTCL NUCEXT CLR,NAME='NAME',MF=L                                    02650000
NUCEXTQL NUCEXT QUERY,NAME='NAME',MF=L                                  02660000
*                                                                       02670000
EXTNAME  DC    CL8' '             Nucleus Extension name                02680000
*                                                                       02690000
LDOFLAG  DC    X'00'             Option flag byte                       02700000
LDOUSER  EQU   X'80'             USER                                   02710000
LDOSYSTM EQU   X'40'             SYSTEM                                 02720000
LDOSHARE EQU   X'20'             SHARE                                  02730000
LDONSHAR EQU   X'10'             NOSHARE                                02740000
         EJECT ,                                                        02750000
         REGEQU ,                                                       02760000
         SCBLOCK ,                                                      02770000
         NUCON ,                                                        02780000
         END                                                            02790000