ZUS      TITLE 'DMSZUS     (CMS)       VM/370 - RELEASE 6'              00001000
         SPACE 2                                                        00002000
USERAREA START X'20000'                                                 00003000
         DS    0D                                                       00004000
         END                                                            00005000