ZIT      TITLE 'DMSZIT     (CMS)       VM/370 - RELEASE 6'              00001000
         SPACE 2                                                        00002000
THISISIT START X'0'                                                     00003000
         ENTRY DMSZITEP                                        @V67CBE4 00003300
DMSZITEP EQU   *                                               @V67CBE4 00003600
         DS    0D                                                       00004000
         END                                                            00005000