ZAT      TITLE 'DMSZAT     (CMS)       VM/370 - RELEASE 6'              00001000
         SPACE 2                                                        00002000
TRANSAR  START X'E000'        START OF TRANSIENT AREA                   00003000
         ENTRY TRANSEND                                                 00004000
         DS    0D                                                       00005000
         DS    512D           TRANSIENT AREA = 8K BYTES                 00006000
         DS    512D                                                     00007000
TRANSEND DS    0D                                                       00008000
         END                                                            00009000