DATE     TITLE 'VMFDATE                VM/370 - RELEASE 6'              00001000
VMFDATE  START                                                          00002000
*              FILENAME FILETYPE FILEMODE                               00003000
*INFILE          &1      &2      &3                                     00004000
*OUTFILE         &4      &5      &6                                     00005000
         USING VMFDATE,12                                               00006000
         STM   14,12,12(13)                                             00007000
         LR    12,15                                                    00008000
         LA    15,32          ERROR CODE X'20' IF INSUFFICIENT ARGS.    00009000
         LR    2,1            CHECK FOR FENCE                           00010000
         LA    3,6            NO OF PARAMETERS                          00011000
TEST     TM    8(2),X'FF'                                               00012000
         BO    RETURN         FENCE, INSUFFICIENT ARGS                  00013000
         LA    2,8(2)         NEXT                                      00014000
         BCT   3,TEST                                                   00015000
         MVC   STATE+8(18),8(1) FILENAME FILETYPE MODE                  00016000
         MVC   WRBUF+8(18),32(1)   OUTPUT FILENAME,FILETYPE,MODE        00017000
         LA    1,STATE                                                  00018000
         SVC   X'CA'                                                    00019000
         DC    AL4(*+4)                                                 00020000
         LTR   15,15                                                    00021000
         BNZ   RETURN         ERROR RETURN                              00022000
         L     1,AFST         FST copy location                HRC015DS 00023100
         MVC   NAME(8),0(1)   FILE NAME                                 00024000
         MVC   TYPE(8),8(1)   FILETYPE                                  00025000
         MVC   MODE(2),24(1)  FILEMODE                                  00026000
         UNPK  DATE+1(5),16(3,1)     MMDD                               00027000
         MVC   DATE(2),DATE+1                                           00028000
         MVI   DATE+2,C'/'                                              00029000
         MVI   DATE+5,C'/'                                              00030000
         UNPK  TIME+1(5),18(3,1)     HHMM                               00031000
         MVC   TIME(2),TIME+1                                           00032000
         MVI   TIME+2,C':'                                              00033000
         MVI   TIME+5,C' '                                              00034000
         MVC   YEAR(2),38(1)  YEAR                                      00035000
         USING STATEFST,1                                      HRC015DS 00036100
         L     2,FVSFSTAD     Pointer to ADT                   HRC015DS 00036200
         DROP  1                                               HRC015DS 00036300
         MVC   LABEL(6),0(2)  DISK LABEL                                00037000
         MVC   WRBUF(8),=CL8'WRBUF '                                    00038000
         LA    1,WRBUF                                                  00039000
         SVC   202            WRITE ONE LINE TO FILE                    00040000
         DC    AL4(*+4)       IGNORE ERRORS                             00041000
         MVC   WRBUF(8),=CL8'FINIS'     WE MUST CLOSE THE FILE          00042000
         LA    1,WRBUF        ...JUST IN CASE                           00043000
         SVC   202                                                      00044000
         DC    AL4(*+4)                                                 00045000
RETURN   EQU   *                                                        00046000
         L     14,12(0,13)                                              00047000
         LM    0,12,20(13)                                              00048000
         BR    14             RETURN                                    00049000
         EJECT                                                          00050000
STATE    DS    0D                                                       00051000
         DC    CL8'STATE',2CL8'*-*',CL2'A1',AL2(*-*)                    00052000
AFST     DC    A(*-*)                                          HRC015DS 00053100
WRBUF    DS    0D                                                       00054000
         DC    CL8'WRBUF',CL8'FNAME',CL8'FTYPE',CL2'A1'                 00055000
         DC    H'0',A(OUT),F'80',CL2'F',H'1'                            00056000
OUT      DC    C'*'                                                     00057000
         DC    CL9' '         TO ALIGN FIELDS ON LOAD MAP               00058000
NAME     DC    CL9' '                                                   00059000
TYPE     DC    CL9' '                                                   00060000
MODE     DC    CL3' '                                                   00061000
LABEL    DC    CL7' '                                                   00062000
DATE     DC    CL6' '                                                   00063000
YEAR     DC    CL4' '                                                   00064000
TIME     DC    CL6' '                                                   00065000
         DC    CL132' '                                                 00066000
         LTORG                                                          00067000
         FVS                                                   HRC015DS 00067100
         END   VMFDATE                                                  00068000