BOX      TITLE 'DMKBOX     (CP)        VM/370 - RELEASE 6'              00001000
DMKBOX   CSECT                                                          00002000
         ENTRY DMKBOXBX                                                 00003000
         ENTRY DMKBOXHR                                                 00004000
ID       DC    CL8'DMKBOX'                                              00005000
DMKBOXBX EQU   *                                                        00006000
         DC    CL46'        VV        VV    MM        MM          '     00007000
         DC    CL46'        VV        VV    MMM      MMM          '     00008000
         DC    CL46'        VV        VV    MMMM    MMMM          '     00009000
         DC    CL46'        VV        VV    MM MM  MM MM          '     00010000
         DC    CL46' 3333333333     777777777777MMMM  00000000    '     00011000
         DC    CL46'333333333333    77777777777  MM  0000000000   '     00012000
         DC    CL46'33      VV33    77VV    77      00MM      00  '     00013000
         DC    CL46'         V33     VV    77M      00MM      00  '     00014000
         DC    CL46'          33    VV    77MM      00MM      00  '     00015000
         DC    CL46'       3333VV  VV    77 MM      00MM      00  '     00016000
         DC    CL46'       3333 VVVV     77 MM      00MM      00  '     00017000
         DC    CL46'          33 VV      77 MM      00MM      00  '     00018000
         DC    CL46'          33         77         00        00  '     00019000
         DC    CL46'33        33         77         00        00  '     00020000
         DC    CL46'333333333333         77          0000000000   '     00021000
         DC    CL46' 3333333333          77           00000000    '     00022000
DMKBOXHR DC    CL46' '        SPACE FOR CLASS X PAGE TRAILER   @VA00841 00023000
         END                                                            00024000