CPU      TITLE 'DMKCPU     (CP)        VM/370 - RELEASE 6'              00001000
         PUNCH ' SPB'                                                   00002000
         ISEQ  73,80                                                    00003000
         SPACE 2                                                        00004000
         COPY  OPTIONS                                                  00005000
         COPY  LOCAL OPTIONS                                            00006000
DMKCPU   CSECT                                                          00007000
         EXTRN DMKSYSOW                                        @V5BC0AB 00008000
         EXTRN DMKLOKSY                                        @V5BC0AB 00009000
         EXTRN DMKPTRFR                                        @V5BC0AB 00010000
         EXTRN DMKCFMBK                                        @V5BC0AB 00011000
         EXTRN DMKSCHTQ                                        @V5BC0AB 00012000
         EXTRN DMKPTRFT                                        @V5BC0AB 00013000
         EXTRN DMKCVTBH                                        @V5BC0AB 00014000
         EXTRN DMKPGTSP                                        @V5BC0AB 00015000
         EXTRN DMKPTRSC                                        @V5BC0AB 00016000
         EXTRN DMKDSPNP                                        @V5BC0AB 00017000
         EXTRN DMKPTRPW                                        @V5MH002 00018000
         EXTRN DMKVMASW                                        @V5BC0AB 00019000
         EXTRN DMKPTRRC                                        @V5BC0AB 00020000
         EXTRN DMKSCHCA                                        @VMH0008 00021000
         EXTRN DMKPAGWS                                        @VMH0012 00022000
         EXTRN DMKCQRWS                                        @VMH0012 00023000
         EXTRN DMKSTKOP                                        @V5BC0AB 00024000
         EXTRN DMKSTKMP                                        @VMH0033 00025000
         EXTRN DMKDSPCH                                        @V5BC0AB 00026000
         EXTRN DMKFRET                                         @V5BC0AB 00027000
         EXTRN DMKFREE                                         @V5BC0AB 00028000
         EXTRN DMKCLKCK                                        @V5BC0AB 00029000
         EXTRN DMKAPIPR                                        @V5BC0AB 00030000
         EXTRN DMKSYSAP                                        @V5BC0AB 00031000
         EXTRN DMKDMPMA                                        @V5BC0AB 00032000
         EXTRN DMKDMPAA                                        @V5BC0AB 00033000
         EXTRN DMKDMPSA                                        @V5BC0AB 00034000
         EXTRN DMKFREAP                                        @V5BC0AB 00035000
         EXTRN DMKVMAS1                                        @V5BC0AB 00036000
         EXTRN DMKSCNVS                                        @V5BC0AB 00037000
         EXTRN DMKSNTBL                                        @V5BC0AB 00038000
         EXTRN DMKPTRUL                                        @V5BC0AB 00039000
         EXTRN DMKMCTAF                                        @VMH0033 00040000
         EJECT                                                          00041000
*.                                                                      00042000
* MODULE NAME -                                                         00043000
*                                                                       00044000
*        DMKCPU                                                         00045000
*                                                                       00046000
* FUNCTION -                                                            00047000
*                                                                       00048000
*  1.    TO VARY AN ATTACHED PROCESSOR ONLINE.                          00049000
*  2.    TO VARY AN ATTACHED PROCESSOR OFFLINE.                         00050000
*                                                                       00051000
* ATTRIBUTES -                                                          00052000
*                                                                       00053000
*        REENTRANT, PAGEABLE, CALLED VIA SVC                            00054000
*                                                                       00055000
* ENTRY POINTS -                                                        00056000
*                                                                       00057000
*        DMKCPUVY - TO PROCESS A VARY ONLINE/OFFLINE PROCESSOR COMMAND. 00058000
*        DMKCPUUP - TO CAUSE AN AP SYSTEM TO REVERT TO A UP SYSTEM.     00059000
*                                                                       00060000
* ENTRY CONDITIONS -                                                    00061000
*                                                                       00062000
*        FOR DMKCPUVY -                                                 00063000
*        GPR1  = PROCESSOR ADDRESS, IF OFFLINE REQUEST, THE FIRST BYTE  00064000
*                HAS A X'FF'                                            00065000
*        GPR11 = ADDRESS OF VMBLOK OF VIRTUAL MEMORY'S OWNER            00066000
*        GPR12 = ADDRESS OF ENTRY POINT                                 00067000
*        GPR13 = ADDRESS OF SAVEAREA                                    00068000
*                                                                       00069000
*        FOR DMKCPUUP-                                                  00070000
*        GPR11-13 ARE THE SAME AS FOR DMKCPUVY.                         00071000
*        SAVEWRK5 = INTERNAL RETURN ADDRESS.  (IT HAS NO SIGNIFICANCE   00072000
*                  UNLESS POFFLINE IS EQUAL ONE I.E., A                 00073000
*                  VARY OFFLINE PROCESSOR COMMAND IS BEING PROCESSED.   00074000
*                                                                       00075000
* EXIT CONDITIONS -                                                     00076000
*                                                                       00077000
*                                                                       00078000
*        NORMAL -                                                       00079000
*              WHEN PROCESSING AN ONLINE OR OFFLINE, GPR1 WILL CONTAIN  00080000
*              ZEROES.                                                  00081000
*                                                                       00082000
*        ERROR -                                                        00083000
*              WHEN PROCESSING AN ONLINE OR OFFLINE, GPR1 WILL CONTAIN  00084000
*              THE ERROR MESSAGE NUMBER.                                00085000
*                                                                       00086000
* CALLS TO OTHER ROUTINES -                                             00087000
*                                                                       00088000
*        DMKMCTAF - TO HANDLE USERS WITH AFFINITY (ENTRY VIA CPEXBLOK)  00089000
*        DMKCVTBH - TO CONVERT BINARY TO PRINTABLE FORM                 00090000
*        DMKPTRFT - TO RETURN PAGES TO THE FREE PAGE LIST               00091000
*        DMKVMASW - TO SWITCH SHARED SEGMENT POINTERS                   00092000
*        DMKPGTSP - TO RELEASE A DASD PAGE ASSIGNED TO SYSTEM           00093000
*        DMKFREE  - TO GET STORAGE FOR NON-SHARED PAGE AND SWAP TABLES  00094000
*        DMKPTRFR - TO GET A PAGE OF STORAGE                            00095000
*        DMKFRET  - TO RELEASE STORAGE                                  00096000
*        DMKCFMBK - TO PUT A VIRTUAL MACHINE IN CONSOLE FUNCTION MODE   00097000
*        DMKPTRPW - TO WAIT UNTIL I/O IS COMPLETE FOR A VIRTUAL MACHINE 00098000
*        DMKSTKOP - TO STACK A REQUEST FOR THE OTHER PROCESSOR          00099000
*        DMKSTKMP - TO STACK A REQUEST FOR THE CURRENT PROCESSOR        00100000
*        DMKCLKCK - TO SYNCHRONIZE THE CLOCKS                           00101000
*        DMKAPIPR - TO INITIALIZE THE APU'S PSA AND SET UP THE AP       00102000
*                   ENVIRONMENT                                         00103000
*        DMKSCNVS - TO GET A DEVICE BLOCK                               00104000
*        DMKDSPCH - TO RETURN TO DISPATCHER                             00105000
*                                                                       00106000
* EXTERNAL REFERENCES -                                                 00107000
*                                                                       00108000
*        DMKDSPNP - NUMBER OF DYNAMICALLY ASSIGNABLE PAGE FRAMES        00109000
*        DMKPTRRC - NUMBER OF RESIDENT, RESERVED PAGES                  00110000
*        DMKVMAS1 - ANCHOR FOR SHARED SYSTEMS (SHRTABLE POINTER)        00111000
*        DMKPTRSC - NUMBER OF RESIDENT SHARED PAGES                     00112000
*        DMKSYSOW - ADDRESS OF THE DEVICE OWNED LIST                    00113000
*        DMKSCHTQ - POINTER TO TOD CLOCK COMPARATOR REQUEST QUEUE       00114000
*        DMKSNTBL - POINTER TO THE SYSTEM NAME TABLE                    00115000
*        DMKFREAP - POINTER TO BACK POCKET FOR DMKFRE IN AP MODE        00116000
*        DMKDMPMA - THE MAIN PROCESSOR'S ADDRESS                        00117000
*        DMKDMPAA - THE ATTACHED PROCESSOR'S ADDRESS                    00118000
*        DMKDMPSA - POINTER TO THE PSA ADDRESSES                        00119000
*        DMKSCHCA - SCHEDULER ATTACHED PROCESSOR WAIT VALUES            00120000
*        DMKCQRWS - ATTACHED PROCESSOR PAGE WAIT SAVE VALUE             00121000
*        DMKPAGWS - ATTACHED PROCESSOR PAGE WAIT SAVE VALUE             00122000
*                                                                       00123000
*                                                                       00124000
* TABLES / WORKAREAS -                                                  00125000
*                                                                       00126000
*        CORTABLE, SWPTABLE, PAGTABLE, SEGTABLE, SHRTABLE               00127000
*                                                                       00128000
* REGISTER USAGE -                                                      00129000
*                                                                       00130000
*        GPR0-10 = SCRATCH                                              00131000
*        GPR11 = VMBLOK BASE                                            00132000
*        GPR12 = DMKCPU BASE                                            00133000
*        GPR13 = SAVEAREA BASE                                          00134000
*        GPR14 = EXTERNAL LINKAGE                                       00135000
*        GPR15 = EXTERNAL LINKAGE                                       00136000
*                                                                       00137000
* NOTES -                                                               00138000
*              NONE                                                     00139000
*                                                                       00140000
* MESSAGES -                                                            00141000
*                                                                       00142000
*        NORMAL-                                                        00143000
*              DMKCPU193I PROCESSOR  YY ONLINE                          00144000
*              DMKCPU194I PROCESSOR YY OFFLINE                          00145000
*                                                                       00146000
*        ERROR -                                                        00147000
*              DMKCPU021E RADDR MISSING OR INVALID                      00148000
*              DMKCPU191E PROCESSOR YY DOES NOT EXIST                   00149000
*              DMKCPU192E VARY PROCESSOR COMMAND FAILED                 00150000
*                                                                       00151000
* ABENDS -                                                              00152000
*         CPU001 - VMPAGES HAS JUST GONE NEGATIVE                       00153000
*         CPU002 - A NAMED SYSTEM WAS NOT FOUND IN DMKSNT               00154000
*                                                                       00155000
*                                                                       00156000
*                                                                       00157000
*                                                                       00158000
*     A. OPERATION OF DMKCPUVY -                                        00159000
*                                                                       00160000
*        1. VERIFY THAT THE VARY PROCESSOR COMMAND WAS ISSUED LEGALLY   00161000
*           THE SET POFFLINE TO ONE.                                    00162000
*        2. IF THE REQUEST IS AN OFFLINE, BRANCH TO DMKCPUOF (STEP 11). 00163000
*        3. IF THE REQUEST IS AN ONLINE, ATTEMPT TO SIGP IPR THE GIVEN  00164000
*           PROCESSOR ADDRESS.  IF UNSUCCESSFUL, ISSUE ERROR MESSAGE    00165000
*           AND RETURN TO CALLER.                                       00166000
*        4. OBTAIN FROM FREE STORAGE THOSE CONTROL BLOCKS NECESSARY     00167000
*           FOR AN AP SYSTEM TO RUN.  NAMELY, DEFERRED EXECUTION BLOCKS 00168000
*           (ONE PER VMBLOK), A BACK POCKET FOR DMKFRE, A CPEXBLOK FOR  00169000
*           THE SWITCH MACRO,  AND A PAGE FOR EACH PSA.                 00170000
*        5. ADJUST THE SUPERVISOR STATE TIME FIELDS (VMCPTIME AND       00171000
*           VMAPTIME) TO THE AP MODE VALUES.                            00172000
*        6. THE PSA'S ARE INITIALIZED FOR THE AP ENVIRONMENT VIA        00173000
*           A CALL TO DMKAPIPR.                                         00174000
*        7. DMKCLKCK IS CALLED TO SYNCHRONIZE THE CLOCKS.               00175000
*        8. A SIGNAL WAKEUP IS ISSUED TO THE GIVEN PROCESSOR.           00176000
*        9. THE ONLINE MESSAGE IS ISSUED.                               00177000
*       10. RETURN IS MADE TO DMKCPS.                                   00178000
*                                                                       00179000
*       11. AT DMKCPUOF, THE PROCESSOR PENDING OFFLINE IS QUIESCED AND  00180000
*           THEN STOPPED BY USING SIGP INSTRUCTIONS.                    00181000
*       12. A BRANCH IS THEN MADE TO ENTRY POINT DMKCPUUP TO REVERT     00182000
*           TO UNIPROCESSOR MODE.  DMKCPUUP RETURNS TO ITS CALLER.      00183000
*       13. (SEE THE PROLOGUE FOR DMKCPUUP).                            00184000
*       14. FOR VARY OFFLINE, UPON RETURN FROM DMKCPUUP,                00185000
*           THE OFFLINE MESSAGE IS ISSUED TO ALL VIRTUAL MACHINES;      00186000
*           THOSE VIRTUAL MACHINES WITH AFF. SET TO THE PROCESSOR       00187000
*           GOING OFFLINE ARE NOTIFIED THAT THE AFFINITY IS SET OFF     00188000
*           AND ARE PUT IN CONSOLE FUNCTION MODE.  VMTTIME IS           00189000
*           SYNCHRONIZED FOR EACH VMBLOK.  THE CPU TIMER IS RESET.      00190000
*           THE VMBLOK LOCK AND THE SYSTEM LOCK ARE ZEROED AND          00191000
*           POFFLINE IS SET OFF.                                        00192000
*       15. RETURN IS MADE TO DMKCPS.                                   00193000
*                                                                       00194000
         EJECT                                                          00195000
MODID    DC    CL8'DMKCPU  '  MODULE NAME                      @V5BC0AB 00196000
         SPACE 2                                                        00197000
         USING PSA,R0                                          @V5BC0AB 00198000
         SPACE                                                          00199000
         USING VMBLOK,R11                                      @V5BC0AB 00200000
         SPACE                                                          00201000
         USING SAVEAREA,R13                                    @V5BC0AB 00202000
         SPACE                                                          00203000
DMKCPUVY RELOC                                                          00204000
         TM    APSTAT1,MPFEAT IS THE MP FEATURE INSTALLED?     @V5BC0AB 00205000
         BZ    ERCPU192       NO, ISSUE ERROR MSG AND EXIT     @V5BC0AB 00206000
         LA    R1,0(R1)       CLEAR FIRST BYTE OF REGISTER ONE @V5BC0AB 00207000
         CALL  DMKCVTBH       CONVERT PROC ADDRESS TO PRINTABLE FORM   X00208000
                                                               @V5BC0AB 00209000
         STH   R1,SAVEWRK1+2  SAVE THE PROCESSOR ADDRESS       @V5BC0AB 00210000
         L     R2,HEX3F       GET HIGHEST PROCESSOR ADDRESS    @V5BC0AB 00211000
         L     R1,SAVER1      GET INPUT REGISTER               @V5BC0AB 00212000
         N     R1,F255        LEAVE ONLY PROCESSOR ADDRESS     @V5BC0AB 00213000
         CR    R1,R2          IS THE CPU ADDRESS VALID?        @V5BC0AB 00214000
         BH    ERCPU21E       NO, ISSUE ERROR MESSAGE          @V5BC0AB 00215000
         TM    APSTAT1,APUOPER IS SYSTEM IN AP MODE?           @V5BC0AB 00216000
         BO    CHKOFF         YES, IT MUST BE AN OFFLINE REQUEST       X00217000
                                                               @V5BC0AB 00218000
         CLC   SAVER1(1),ZEROES IS REQUEST FOR ONLINE?         @V5BC0AB 00219000
         BNE   ERCPU192       NO, OFFLINE.  ISSUE ERROR MESSAGE        X00220000
                                                               @V5BC0AB 00221000
         B     DMKCPUON       YES, GO TO ONLINE ROUTINE        @V5BC0AB 00222000
CHKOFF   DS    0H                                              @V5BC0AB 00223000
         CLI   SAVER1,FF      IS REQUEST FOR OFFLINE?          @V5BC0AB 00224000
         BNE   ONTST          NO, ONLINE.  COMPARE TO ONLINE PROC'S    X00225000
                                                               @V5BC0AB 00226000
         CH    R1,IPUADDR     IS PROCESSOR ONLINE?             @V5BC0AB 00227000
         BNE   CHKADDRX       NOT THIS ONE, CHECK OTHER        @V5BC0AB 00228000
         TM    APSTAT1,PROCIO IS THIS ONE THE MAIN?            @V5BC0AB 00229000
         BNO   DMKCPUOF       NO, CONTINUE OFFLINE PROCESS     @V5BC0AB 00230000
         B     ERCPU192       YES, ISSUE ERROR MESSAGE         @V5BC0AB 00231000
CHKADDRX CH    R1,IPUADDRX    IS THE CPU THE OTHER PROCESSOR?  @V5BC0AB 00232000
         BNE   ERCPU21E       NO, ADDRESS IS INVALID           @V5BC0AB 00233000
         TM    APSTAT1,PROCIO IF RUNNING ON THE I/O PROCESSOR, THEN    X00234000
                                                               @V5BC0AB 00235000
*                             THE OTHER PROCESSOR CAN NOT BE THE MAIN   00236000
         BO    DMKCPUOF       ADDRESS IS VALID, CONTINUE OFF. PROCESS  X00237000
                                                               @V5BC0AB 00238000
         B     ERCPU192       ISSUE ERROR MESSAGE              @V5BC0AB 00239000
ONTST    DS    0H                                              @V5BC0AB 00240000
         CH    R1,IPUADDR     IS THE PROCESSOR ONLINE?         @V5BC0AB 00241000
         BE    ONCPU193       YES, GO ISSUE ONLINE MESSAGE     @V5BC0AB 00242000
         CH    R1,IPUADDRX    IS THIS THE PROCESSOR?           @V5BC0AB 00243000
         BE    ONCPU193       YES, GO ISSUE ONLINE MESSAGE     @V5BC0AB 00244000
ERCPU192 DS    0H                                              @V5BC0AB 00245000
         LA    R15,192        GET MESSAGE NUMBER               @V5BC0AB 00246000
         ST    R15,SAVER1     AND SAVE IT IN HIS REGISTER 1    @V5BC0AB 00247000
         LA    R0,CPU192LN                                     @V5BC0AB 00248000
         LA    R1,CPU192MG                                     @V5BC0AB 00249000
         B     ISSUEMSG                                        @V5BC0AB 00250000
*                                                                       00251000
ERCPU21E DS    0H                                              @V5BC0AB 00252000
         LA    R15,21         GET ERROR MESSAGE FOR DMKCPS     @V5BC0AB 00253000
         ST    R15,SAVER1     AND SAVE IT IN HIS REGISTER 1    @V5BC0AB 00254000
         LA    R0,CPU21ELN                                     @V5BC0AB 00255000
         LA    R1,CPU21EMG                                     @V5BC0AB 00256000
         B     ISSUEMSG                                        @V5BC0AB 00257000
*                                                                       00258000
CPU191ER DS    0H                                              @V5BC0AB 00259000
         LCTL  C0,C0,CPCREG0  LOAD ORIGINAL CONTROL REG 0      @V5BC0AB 00260000
ERCPU191 DS    0H                                              @V5BC0AB 00261000
         LA    R15,191        GET ERROR MESSAGE FOR DMKCPS     @V5BC0AB 00262000
         ST    R15,SAVER1     AND SAVE IT IN HIS REGISTER 1    @V5BC0AB 00263000
         MVC   CPUID191(2),SAVEWRK1+2 GET CPU ADDRESS          @V5BC0AB 00264000
         LA    R0,CPU191LN                                     @V5BC0AB 00265000
         LA    R1,CPU191MG                                     @V5BC0AB 00266000
         B     ISSUEMSG                                        @V5BC0AB 00267000
*                                                                       00268000
*                                                                       00269000
*                                                                       00270000
*                                                                       00271000
*                                                                       00272000
DMKCPUON DS    0H                                              @V5BC0AB 00273000
         SPACE                                                          00274000
* DETERMINE IF THE GIVEN PROCESSOR IS ALREADY ONLINE                    00275000
         CH    R1,IPUADDR                                      @V5BC0AB 00276000
         BE    ONCPU193       ISSUE ONLINE MESSAGE             @V5BC0AB 00277000
         LR    R2,R1          PUT PROCESSOR ADDRESS IN R2      @V5BC0AB 00278000
         SR    R1,R1          CLEAR SIGP STATUS REGISTER       @V5BC0AB 00279000
         LA    R14,1000       IPR BUSY LOOP COUNTER            @V5BC0AB 00280000
*                                                                       00281000
SIPRLOOP DS    0H                                              @V5BC0AB 00282000
         SIGP  R1,R2,SIGIPR                                    @V5BC0AB 00283000
         BC    8,ADDROK       CC0 IPR STARTED SUCCESSFULLY     @V5BC0AB 00284000
         BC    5,ERCPU191     CC3-NOT OPER. AND CC1-STATUS STORED      X00285000
                                                               @V5BC0AB 00286000
         BCT   R14,SIPRLOOP   CC2-BUSY                         @V5BC0AB 00287000
         B     ERCPU191       ISSUE ERROR MESSAGE, CC2, BUSY 1000      X00288000
                              TIMES                                     00289000
ADDROK   DS    0H                                              @V5BC0AB 00290000
         LA    R14,10         WINDOW CONTROL COUNTER           @V5BC0AB 00291000
* *                                                                     00292000
* *                                                                     00293000
         STCTL C0,C0,SAVEWRK9 SAVE CONTROL REG 0 IN WORKAREA   @V5BC0AB 00294000
         NC    SAVEWRK9+2(2),EXTNBITS LEAVE ONLY MFA BIT ON    @V5BC0AB 00295000
         OI    SAVEWRK9+2,MFAMASK INSURE MFA BIT IS ON         @V5BC0AB 00296000
ADDROK1  DS    0H                                              @V5BC0AB 00297000
         LCTL  C0,C0,SAVEWRK9 LOAD C0 WITH ONLY MFA BIT ON     @V5BC0AB 00298000
         LA    R5,100         SENSE BUSY LOOP CONTROL COUNTER  @V5BC0AB 00299000
SENSLOOP DS    0H                                              @V5BC0AB 00300000
         SIGP  R1,R2,SIGSENSE SIGP SENSE FOR COMPLETION OF SIGP IPR    X00301000
                                                               @V5BC0AB 00302000
         BC    8,DOONLINE     CC0 IPR COMPLETE                 @V5BC0AB 00303000
         BC    4,CKSTATUS     CC1 STATUS STORED, GO CHECK IT   @V5BC0AB 00304000
         BC    1,CPU191ER     CC3 NOT OPERATIONAL              @V5BC0AB 00305000
         BCT   R5,SENSLOOP    LOOP ON BUSY FOR 100 TIMES(CC2)  @V5BC0AB 00306000
*                                                                       00307000
         STOSM SAVEWRK2,EXTMASK ENABLE FOR EXTERNAL INTERRUPTS @V5BC0AB 00308000
         STNSM SAVEWRK2,FF-EXTMASK DISABLE FOR EXTERNAL INTERRUPTS     X00309000
                                                               @V5BC0AB 00310000
         BCT   R14,ADDROK1    ENABLE FOR MFA 10 TIMES (1/100 SENSE)    X00311000
                                                               @V5BC0AB 00312000
         LCTL  C0,C0,CPCREG0  LOAD ORIGINAL CONTROL REG 0      @V5BC0AB 00313000
         B     ERCPU192       ISSUE ERROR MESSAGE              @V5BC0AB 00314000
CKSTATUS DS    0H                                              @V5BC0AB 00315000
         C     R1,STOPPED                                      @V5BC0AB 00316000
         BE    DOONLINE                                        @V5BC0AB 00317000
         LCTL  C0,C0,CPCREG0 LOAD ORIGINAL CONTROL REG 0       @V5BC0AB 00318000
         B     ERCPU192       ISSUE ERROR MESSAGE              @V5BC0AB 00319000
         SPACE                                                          00320000
* THE FOLLOWING CODE WILL LOCATE THE CONTIGUOUS PAGE AND SWAP  *        00321000
* TABLES FOR EACH SHARED SEGMENT AND UPDATE THE PAGTOT FIELD   *        00322000
* OF THE SECOND SET TO THE VALUE OF THE PAGTOT FIELD OF THE    *        00323000
* FIRST SET.                                                   *        00324000
         SPACE                                                          00325000
DOONLINE DS    0H                                              @V5BC0AB 00326000
         LCTL C0,C0,CPCREG0 LOAD ORIGINAL CONTROL REG 0        @V5BC0AB 00327000
         SPACE                                                          00328000
         OI    APSTAT4,POFFLINE INDICATE VARY PROCESSING IS ACTIVE     X00329000
                                                               @V5BC0AB 00330000
         L     R4,=A(DMKVMAS1) ADDRESS OF SHRTABLE ANCHOR      @V5BC0AB 00331000
         L     R5,0(,R4)      ADDRESS OF FIRST SHRTABLE        @V5BC0AB 00332000
SHRTSCAN DS    0H                                              @V5BC0AB 00333000
         CR    R5,R4          END OF CHAIN?                    @V5BC0AB 00334000
         BE    GETBLOCK       YES, GET AP CONTROL BLOCKS       @V5BC0AB 00335000
         SPACE                                                          00336000
         USING SHRTABLE,R5                                     @V5BC0AB 00337000
         TM    SHRFLAG,SHRNOPRT IS NAMED SYSTEM UNPROTECTED?   @VMI0032 00338000
         BNO   PROTECTD       NO, BRANCH                       @VMI0032 00339000
         L     R5,SHRFPNT     GET ADDRESS OF NEXT SHRTABLE     @VMI0032 00340000
         LA    R5,0(,R5)      ERASE SHRFLAG VALUE              @VMI0085 00341000
         B     SHRTSCAN       CHECK ALL OF THE SHARE TABLES    @VMI0032 00342000
PROTECTD DS    0H                                              @VMI0032 00343000
         SPACE                                                          00344000
         L     R3,SHRSEGCT    GET NUMBER OF SHARED SEGMENTS    @V5BC0AB 00345000
         LR    R14,R3         GET NUMBER OF SHARED SEGMENTS    @V5BC0AB 00346000
         LA    R8,SHRSEGNM    ADDRESS SEGNM FIELD              @V5BC0AB 00347000
*                                                                       00348000
FSHRPAGE DS    0H                                              @V5BC0AB 00349000
         LA    R8,4(,R8)      GET NEXT POSSIBLE SHRPAGE POINTER        X00350000
                                                               @V5BC0AB 00351000
         S     R14,F4         SUBTRACT FOUR FROM SHRSEGNM      @V5BC0AB 00352000
*                             (THERE MAY BE 4 ENTRIES PER WORD)         00353000
         BP    FSHRPAGE       LOOP UNTIL AT END OF THE VARIABLE        X00354000
                                                               @V5BC0AB 00355000
*                             SHRSEGNM AREA                             00356000
         SPACE                                                          00357000
         USING SHRPAGE,R8     R8 ADDRESS THE BEGINNING OF THE  @V5BC0AB 00358000
*                             SHRPAGE FIELDS                            00359000
*                                                                       00360000
PAGELOOP DS    0H                                              @V5BC0AB 00361000
         L     R7,SHRPAGE     LOAD A PAGE TABLE ADDRESS FROM THE       X00362000
                                                               @V5BC0AB 00363000
*                             SHRTABLE                                  00364000
         N     R7,=A(X'FFFFFE') LEAVE PTO ADDRESS ONLY         @V5BC0AB 00365000
         SL    R7,F16         BACK UP TO THE HEADER            @V5BC0AB 00366000
         LH    R2,PAGTOT-PAGTABLE(R7) GET TOTAL SEGMENT USE COUNT      X00367000
                                                               @V5BC0AB 00368000
         STH   R2,PAGBMP+PAGTOT-PAGTABLE(R7) UPDATE THE SECOND @V5BC0AB 00369000
*                             PAGE TABLE SEGMENT USE COUNT              00370000
         LA    R8,F4(R8)      LOAD ADDRESS OF NEXT SHRPAGE ENTRY       X00371000
                                                               @V5BC0AB 00372000
         BCT   R3,PAGELOOP    DO NEXT SHRPAGE ENTRY, IF THERE IS ONE   X00373000
                                                               @V5BC0AB 00374000
         L     R5,SHRFPNT     GET ADDRESS OF NEXT SHRTABLE     @V5BC0AB 00375000
         B     SHRTSCAN       DO ALL OF THE SHARE TABLES       @V5BC0AB 00376000
         DROP  R5                                              @V5BC0AB 00377000
         SPACE                                                          00378000
         DROP  R8                                              @V5BC0AB 00379000
         SPACE                                                          00380000
* END OF SHARED SEGMENT PAGTOT UPDATING                        *        00381000
         SPACE                                                          00382000
         SPACE                                                          00383000
GETBLOCK DS    0H                                              @V5BC0AB 00384000
         SPACE                                                          00385000
* OBTAIN THE PREFIX STORAGE AREAS                                       00386000
         SR    R2,R2          SET UP TO CALL DMKPTRFR FOR A PAGE       X00387000
                                                               @V5BC0AB 00388000
*                             OF STORAGE                                00389000
         CALL  DMKPTRFR       OBTAIN STORAGE                   @V5BC0AB 00390000
         L     R8,CPUDMPSA    GET ADDRESS TO STORE PSA ADDRESSES       X00391000
                                                               @V5BC0AB 00392000
*                             FOR DUMP ROUTINE                          00393000
         SPACE                                                          00394000
         USING CORTABLE,R7    R7 HAS CORTABLE ENTRY ADDRESS OF PAGE    X00395000
                                                               @V5BC0AB 00396000
         SPACE                                                          00397000
         MVC   CORFPNT,ASYSVM INDICATE OWNER IS SYSTEM         @V5BC0AB 00398000
         MVI   CORFLAG,CORCP  INDICATE THIS IS A CP FRAME      @V5BC0AB 00399000
         SL    R7,ACORETBL    FORM THE                         @V5BC0AB 00400000
         SLL   R7,8           PAGE ADDRESS                     @V5BC0AB 00401000
         ST    R7,0(,R8)      SAVE PSA ADDRESS FOR THE MAIN PROCESSOR  X00402000
                                                               @V5BC0AB 00403000
         SR    R2,R2                                           @V5BC0AB 00404000
         CALL  DMKPTRFR       OBTAIN STORAGE                   @V5BC0AB 00405000
         MVC   CORFPNT,ASYSVM INDICATE SYSTEM IS OWNER         @V5BC0AB 00406000
         MVI   CORFLAG,CORCP  INDICATE THIS IS A CP FRAME      @V5BC0AB 00407000
         SL    R7,ACORETBL    FORM THE                         @V5BC0AB 00408000
         SLL   R7,8           PAGE ADDRESS                     @V5BC0AB 00409000
         ST    R7,4(,R8)      SAVE PSA ADDRESS FOR THE AP      @V5BC0AB 00410000
         SPACE                                                          00411000
         DROP  R7                                              @V5BC0AB 00412000
         SPACE                                                          00413000
* GET CPEXBLOK FOR THE SWITCH MACRO                                     00414000
         LA    R0,CPEXSIZE    GET LENGTH IN DOUBLE WORDS       @V5BC0AB 00415000
         CALL  DMKFREE        OBTAIN STORAGE                   @V5BC0AB 00416000
         ST    R1,PSACPXBP    SAVE ADDRESS IN ABSOLUTE 0 PSA   @V5BC0AB 00417000
* GET STORAGE FOR DMKFREE USE DURING EXTEND PROCESSING WHEN THE         00418000
* THE SYSTEM LOCK IS NOT AVAILABLE                                      00419000
         L     R10,CPUFREAP   GET ADDRESS OF BACK POCKET POINTER       X00420000
                                                               @V5BC0AB 00421000
         SR    R0,R0          CLEAR INPUT REGISTER             @V5BC0AB 00422000
         IC    R0,0(R10)      GET NUMBER OF DOUBLE WORDS       @V5BC0AB 00423000
         CALL  DMKFREE        OBTAIN STORAGE                   @V5BC0AB 00424000
         STCM  R1,B'0111',1(R10) SAVE ADDRESS OF DMKFREE BACK POCKET   X00425000
                                                               @V5BC0AB 00426000
*                                                                       00427000
*                                                                       00428000
         SPACE                                                          00429000
         SR    R15,R15        CLEAR R15                        @V5BC0AB 00430000
         ICM   R15,B'0011',SAVER1+2 GET THE PROCESSOR ADDRESS  @V5BC0AB 00431000
         STH   R15,IPUADDRX   SAVE IT IN ABSOLUTE 0 PSA        @V5BC0AB 00432000
         STH   R15,LPUADDRX                                    @V5BC0AB 00433000
         OI    LPUADDRX+1,LOGICADR MAKE IT A LOGICAL ADDRESS   @V5BC0AB 00434000
         L     R2,CPUDMPAA    GET DUMP PTR TO AP ADDRESS       @V5BC0AB 00435000
         STH   R15,0(,R2)     SAVE THE ADDRESS IN DMKDMPAA     @V5BC0AB 00436000
         L     R1,CPUDMPSA    GET POINTER TO PSA ADDRESSES     @V5BC0AB 00437000
         CALL  DMKAPIPR       SET UP FOR THE ATTACHED PROCESS. @V5BC0AB 00438000
         L     R15,PREFIXB    ADDRESS ATTACHED PROC'S PSA      @VMH0001 00439000
         LM    R0,R1,WAITSAV8 LOAD INITIAL PAGE WAIT TIME      @VMH0012 00440000
         STM   R0,R1,PGWAITIM-PSA(R15) SET ATTACHED PG WT TIME @VMH0012 00441000
         SLR   R0,R0          ZERO REGISTER ZERO               @VMH0012 00442000
         ST    R0,PWTPAGES-PSA(R15) SET PAGE WAIT COUNT TO 0   @VMH0012 00443000
         SPACE                                                          00444000
         CALL  DMKCLKCK       SYNCHRONIZE THE CLOCKS           @V5BC0AB 00445000
         SPACE                                                          00446000
         SIGNAL WAKEUP        WAKE UP THE ATTACHED PROCESSOR   @V5BC0AB 00447000
         SPACE                                                          00448000
         L     R1,ASYSVM      GET SYSTEM VMBLOK ADDRESS        @VMH0038 00449000
         L     R1,VMPNT-VMBLOK(,R1) 1ST VMBLOK ADDR IN CHAIN   @VMH0038 00450000
         LR    R10,R1         SAVE ENDING ADDRESS              @VMH0038 00451000
         MVC   SAVER1(4),ZEROES ZERO THE CALLER'S REGISTER ONE @V5BC0AB 00452000
ONLMSGLP DS    0H                                              @V5BC0AB 00453000
* R11 CONTAINS THE LOCKED VMBLOK.  THE FIRST TIME THROUGH THIS          00454000
* LOOP, R11 IS THE ONE ON ENTRY TO DMKCPU.                              00455000
         SWTCHVM              UNLOCK THE THE VMBLOK ADDRESSED  @VMH0038 00456000
*                             BY R11 AND LOCK THE ONE TO RECEIVE THE    00457000
*                             ONLINE MESSAGE (R1)                       00458000
         LA    R0,CPU193LN    GET ONLINE MESSAGE LENGTH        @VMH0038 00459000
         LA    R1,CPU193MG    GET ONLINE MESSAGE ADDRESS       @VMH0038 00460000
         CALL  DMKQCNWT,PARM=NORET ISSUE MESSAGE               @V5BC0AB 00461000
         L     R1,VMPNT       GET ADDRESS OF NEXT VMBLOK       @VMH0038 00462000
         CR    R10,R1         END OF CHAIN?                    @VMH0038 00463000
         BNE   ONLMSGLP       NO, SEND MESSAGE TO ALL USERS    @V5BC0AB 00464000
         NI    APSTAT4,FF-POFFLINE VARY PROCESS IS NOT ACTIVE  @V5BC0AB 00465000
         L     R15,PREFIXB    ADDRESS THE OTHER PROC'S PSA     @V5BC0AB 00466000
         NI    APSTAT4-PSA(R15),FF-POFFLINE SET POFFLINE TO ZERO       X00467000
                                                               @V5BC0AB 00468000
         L     R1,SAVER11     GET ORIGINAL VMBLOK ADDRESS      @VMH0038 00469000
         SWTCHVM              LOCK THE COMMAND ISSUER'S VMBLOK @VMH0038 00470000
         EXIT                                                           00471000
         SPACE                                                          00472000
ONCPU193 DS    0H                                              @V5BC0AB 00473000
         MVC   CPUID193(2),SAVEWRK1+2 GET PROCESSOR ADDRESS    @V5BC0AB 00474000
         LA    R0,CPU193LN    GET ONLINE MSG LENGTH            @V5BC0AB 00475000
         LA    R1,CPU193MG    GET ONLINE MSG ADDRESS           @V5BC0AB 00476000
         MVC   SAVER1(4),ZEROES ZERO THE CALLERS REGISTER 1    @V5BC0AB 00477000
         SPACE                                                          00478000
ISSUEMSG DS    0H                                              @V5BC0AB 00479000
         CALL  DMKQCNWT,PARM=NORET ISSUE MESSAGE               @V5BC0AB 00480000
         EXIT                                                           00481000
         EJECT                                                          00482000
DMKCPUOF DS    0H                                              @V5BC0AB 00483000
         TM    APSTAT4,POFFLINE VARY PROCESSING ACTIVE?        @V5BC0AB 00484000
         BO    ERCPU192       YES, ISSUE COMMAND FAILED MESSAGE        X00485000
                                                               @V5BC0AB 00486000
         OI    APSTAT4,POFFLINE INDICATE VARY PROCESSING IS ACTIVE     X00487000
                                                               @V5BC0AB 00488000
         L     R15,PREFIXB    ADDRESS THE OTHER PROC'S PSA     @V5BC0AB 00489000
         OI    APSTAT4-PSA(R15),POFFLINE SET POFFLINE TO ONE   @V5BC0AB 00490000
         TM    APSTAT1,PROCIO RUNNING ON PROCESSOR PENDING OFFLINE?    X00491000
                                                               @V5BC0AB 00492000
         BO    DMKCPUOG       NO, BRANCH.  RUNNING ON MAIN     @V5BC0AB 00493000
         LA    R0,CPEXSIZE    GET SIZE OF CPEXBLOK             @V5BC0AB 00494000
         CALL  DMKFREE        OBTAIN STORAGE                   @V5BC0AB 00495000
         SPACE                                                          00496000
         USING CPEXBLOK,R1                                     @V5BC0AB 00497000
         SPACE                                                          00498000
         STM   R0,R15,CPEXREGS SAVE REG                        @V5BC0AB 00499000
         LA    R15,DMKCPUOG   ADDRESS OF RETURN POINT          @V5BC0AB 00500000
         ST    R15,CPEXADD    STORE RETURN ADDRESS IN CPEXBLOK @V5BC0AB 00501000
         MVC   CPEXPROC(1),LPUADDRX+1 SET TO OTHER PROCESSOR ADDRESS   X00502000
                                                               @V5BC0AB 00503000
         SPACE                                                          00504000
         DROP  R1                                              @V5BC0AB 00505000
         SPACE                                                          00506000
         CALL  DMKSTKOP       GO STACK REQUEST BLOCK FOR THE OTHER     X00507000
                              PROCESSOR                        @V5BC0AB 00508000
         GOTO  DMKDSPCH       GO TO THE DISPATCHER             @V5BC0AB 00509000
*                                                                       00510000
*                                                                       00511000
DMKCPUOG DS    0H                                              @V5BC0AB 00512000
         SPACE                                                          00513000
         SIGNAL QUIESCE                                        @V5BC0AB 00514000
         SPACE                                                          00515000
         SIGNAL STOP                                           @V5BC0AB 00516000
         SPACE                                                          00517000
         LA    R14,CPUEXIT    GET ADDRESS OF CPUEXIT           @V5BC0AB 00518000
         ST    R14,SAVEWRK5   STORE RETURN ADDRESS             @V5BC0AB 00519000
         B     DMKCPUOH       GO TO DMKCPUOH                   @V5BC0AB 00520000
         SPACE                                                          00521000
CPUEXIT  DS    0H                                              @V5BC0AB 00522000
*                             CHECK AFFINITY SETTINGS                   00523000
         SLR   R7,R7          CLEAR REGSITER 7                 @VMH0033 00524000
         L     R11,ASYSVM     START GOING DOWN CHAIN OF VMBLOKS        X00525000
                                                               @V5BC0AB 00526000
         L     R11,VMPNT      GET FIRST VMBLOK IN CYCLIC CHAIN @V5BC0AB 00527000
         LR    R10,R11        SAVE ENDING ADDRESS              @V5BC0AB 00528000
         MVC   CPUID194(2),SAVEWRK1+2 GET PROCESSOR ADDRESS    @V5BC0AB 00529000
CPUEXIT2 DS    0H                                              @V5BC0AB 00530000
         LA    R0,CPU194LN    GET LENGTH OF OFFLINE MESSAGE    @V5BC0AB 00531000
         LA    R1,CPU194MG    GET ADDRESS OF OFFLINE MESSAGE   @V5BC0AB 00532000
         CALL  DMKQCNWT,PARM=NORET ISSUE OFFLINE MESSAGE       @VMH0033 00533000
         LTR   R7,R7    HAS A BLOCK BEEN STACKED FOR DMKMCTAF? @VMH0033 00534000
         BNZ   CHKALLVM       YES, BRANCH                      @VMH0033 00535000
         TM    VMAFF,VMAFFON  AFFINITY SET?                    @V5BC0AB 00536000
         BZ    CHKALLVM       NO, BRANCH                       @V5BC0AB 00537000
         SR    R1,R1          CLEAR REGISTER 1                 @V5BC0AB 00538000
         IC    R1,VMAFF       GET AFFINITY BYTE                @V5BC0AB 00539000
         N     R1,=A(X'3F')   LEAVE ONLY PROCESSOR ADDRESS     @V5BC0AB 00540000
         CH    R1,IPUADDR     AFFINITY SET TO THIS PROCESSOR?  @V5BC0AB 00541000
         BE    CHKALLVM       YES, BRANCH                      @V5BC0AB 00542000
         LA    R7,1  INDICATE THAT DMKMCTAF HAS BEEN SCHEDULED @VMH0033 00543000
         LA    R0,CPEXSIZE    GET SIZE OF A CPEXBLOK           @VMH0033 00544000
         CALL  DMKFREE        GET STORAGE FOR BLOCK            @VMH0033 00545000
         SPACE                                                          00546000
         USING CPEXBLOK,R1                                     @VMH0033 00547000
         SPACE                                                          00548000
         SLR   R15,R15        CLEAR REGISTER 15                @VMH0033 00549000
         LH    R15,SAVEWRK1+2  GET PROCESSOR ADDRESS           @VMH0033 00550000
         ST    R15,CPEXR1     SAVE PROCESSOR ADDRESS IN R1     @VMH0033 00551000
         L     R15,CPUMCTAF   GET ADDRESS OF DMKMCTAF          @VMH0033 00552000
         ST    R11,CPEXR11    SAVE VMBLOK ADDRESS              @VMH0037 00553000
         ST    R15,CPEXR12    SAVE ENTRY ADDRESS               @VMH0033 00554000
         ST    R15,CPEXADD    SAVE RETURN ADDRESS IN CPEXBLOK  @VMH0033 00555000
         SPACE                                                          00556000
         DROP  R1                                                       00557000
         SPACE                                                          00558000
         CALL  DMKSTKMP       GO STACK FOR THIS PROCESSOR      @VMH0033 00559000
CHKALLVM DS    0H                                              @V5BC0AB 00560000
         L     R11,VMPNT      GET ADDRESS OF NEXT VMBLOK       @V5BC0AB 00561000
         CLR   R11,R10        END OF CHAIN?                    @V5BC0AB 00562000
         BNE   CPUEXIT2       NO, LOOP THRU ALL VMBLOKS        @V5BC0AB 00563000
         MVC   SAVER1(4),ZEROES CLEAR THE CALLER'S REGISTER 1  @V5BC0AB 00564000
         NI    APSTAT4,FF-POFFLINE VARY PROCESS IS NOT ACTIVE  @V5BC0AB 00565000
         EXIT                                                           00566000
*                                                                       00567000
*                                                                       00568000
         EJECT                                                          00569000
* SUBROUTINE NAME -                                                     00570000
*                                                                       00571000
*        DMKCPUUP                                                       00572000
*                                                                       00573000
* FUNCTION -                                                            00574000
*                                                                       00575000
*  1.    TO RELEASE ALL RESOURCES NECESSARY FOR AN AP ENVIRONMENT.      00576000
*  2.    TO REVERT TO THE UNIPROCESSOR ENVIRONMENT.                     00577000
*                                                                       00578000
* ENTRY CONDITIONS -                                                    00579000
*                                                                       00580000
*        GPR11 = ADDRESS OF VMBLOK OF VIRTUAL MEMORY'S OWNER            00581000
*        GPR12 = ADDRESS OF ENTRY POINT                                 00582000
*        GPR13 = ADDRESS OF SAVEAREA                                    00583000
*                                                                       00584000
*        WHEN BRANCHED TO FROM DMKCPUOF, SAVEWRK5 CONTAINS THE RETURN   00585000
*                ADDRESS.                                               00586000
*                                                                       00587000
*                                                                       00588000
*     OPERATION OF DMKCPUUP -                                           00589000
*                                                                       00590000
*        1. LOCK EACH VMBLOK AND CALL DMKVMASW TO SWITCH THE SHARED     00591000
*           SEGMENT POINTERS.                                           00592000
*        2. SYNCHRONIZE VMTTIME FOR EACH VIRTUAL MACHINE.               00593000
*        3. CALL DMKFRET TO FREE EACH DEFERRED EXECUTION BLOCK,         00594000
*           PROVIDED IT IS NOT STACKED.                                 00595000
*        4. FREE ALL THE REMAINING AP RELATED CONTROL BLOCKS.           00596000
*        5. SET THE CLOCK COMPARATOR VALUE TO THAT OF THE FIRST ELEMENT 00597000
*           ON THE QUEUE.                                               00598000
*        6. WHILE PRESERVING ABSOLUTE ZERO MAINTAINED FIELDS, COPY THE  00599000
*           CURRENT PSA INTO THE ABSOLUTE ZERO PSA.                     00600000
*        7. STOP PREFIXING.                                             00601000
*        8. SET APUOPER TO ZERO.                                        00602000
*        9. FREE THE PSA'S.                                             00603000
*       10. FREE UP THE PAGES AND DASD SLOTS HELD BY THE ATTACHED       00604000
*           PROCESSOR'S SET OF PAGE AND SWAP TABLES FOR SHARED          00605000
*           SEGMENTS (WHEN POSSIBLE).                                   00606000
*       11. IF THE SWPRECMP FLAG IS ZERO IN  AT LEAST ONE SWAP TABLE    00607000
*           ENTRY, REINITIALIZE THE SWAP TABLES WITH THE ORIGINAL       00608000
*           CCPD'S USING DMKSNTBL.                                      00609000
*       12. RETURN TO THE CALLER.                                       00610000
*                                                                       00611000
*                                                                       00612000
         SPACE 2                                                        00613000
DMKCPUUP RELOC                                                 @V5BC0AB 00614000
DMKCPUOH DS    0H                                              @V5BC0AB 00615000
         MVC   SAVEWRK8(1),ZEROES CLEAR FLAG BYTE              @V5BC0AB 00616000
         L     R11,ASYSVM     GET ADDRESS OF SYSTEM VMBLOK     @V5BC0AB 00617000
         CHARGE SYNC SYNCHRONIZE VMTTIME FOR THE SYSTEM VMBLOK @VMH0025 00618000
         L     R11,VMPNT      GET FIRST VMBLOK ADDR IN CYCLIC CHAIN    X00619000
                                                               @V5BC0AB 00620000
         LR    R10,R11        SAVE ENDING ADDRESS              @V5BC0AB 00621000
         SR    R9,R9          CLEAR A REGISTER                 @V5BC0AB 00622000
LOOP     DS    0H                                              @V5BC0AB 00623000
         LR    R1,R11         GET VMBLOK ADDRESS IN REGISTER 1 @V5BC0AB 00624000
         ST    R9,VMLOCK      YES, CLEAR LOCK WORD             @V5BC0AB 00625000
GETLOCK  DS    0H                                              @V5BC0AB 00626000
         LOCK  OBTAIN,TYPE=VMBLOK,SPIN=NO LOCK THIS VMBLOK     @V5BC0AB 00627000
         TM    VMOSTAT,VMSHR  VIRTUAL MACHINE RUNNING SHARED SEGMENTS? X00628000
                                                               @V5BC0AB 00629000
         BZ    LOOPVMOF       NO, CHECK FOR DEFERRED TASK      @V5BC0AB 00630000
         CLC   VMSHRPRC,LPUADDR+1 POINTING TO THIS PROCESSORS SHARED   X00631000
                                                               @V5BC0AB 00632000
*                             SEGMENTS                                  00633000
         BE    LOOPVMOF       YES, NO NEED TO SWITCH CHECK DEFERRED    X00634000
                              TASK                             @V5BC0AB 00635000
         CALL  DMKVMASW       SWITCH TO THIS PROCESSORS SHARED         X00636000
                              SEGMENTS                                  00637000
LOOPVMOF DS    0H                                              @V5BC0AB 00638000
         CHARGE SYNC          SYNCHRONIZE VMTTIME              @V5BC0AB 00639000
         TM    VMPEND,VMDEFSTK DEFERRED TASK PENDING?          @V5BC0AB 00640000
         BO    CHKPROC        YES, CHECK PROCESSOR ADDRESS     @V5BC0AB 00641000
         LA    R0,CPEXSIZE                                     @V5BC0AB 00642000
         L     R1,VMDFTPNT    GET ADDRESS OF DEFER EXECUTION BLOCK     X00643000
                                                               @V5BC0AB 00644000
         CALL  DMKFRET        FREE THE STORAGE                 @V5BC0AB 00645000
         B     CHKNXTVM       CHECK NEXT VMBLOK                @V5BC0AB 00646000
CHKPROC  DS    0H                                              @V5BC0AB 00647000
         L     R15,VMDFTPNT   GET POINTER TO DEFERRED TASK     @V5BC0AB 00648000
         SPACE                                                          00649000
         USING CPEXBLOK,R15                                    @V5BC0AB 00650000
         SPACE                                                          00651000
         MVC   CPEXPROC(1),LPUADDR+1 SET TO THIS PROCESSOR     @V5BC0AB 00652000
         NI    CPEXTYPE,X'FF'-CPEXDEFR MAKE IT AN ORDINARY     @VMH0026 00653000
*                             CPEXBLOK. DMKDSP WILL FRET IT             00654000
         NI    VMPEND,X'FF'-VMDEFSTK SET OFF PENDING FLAG      @VMH0026 00655000
         SPACE                                                          00656000
         DROP  R15                                             @V5BC0AB 00657000
         SPACE                                                          00658000
CHKNXTVM DS    0H                                              @V5BC0AB 00659000
         ST    R9,VMDFTPNT ZERO DEFER EXECUTION BLOCK ADDRESS  @VMH0026 00660000
         ST    R9,VMLOCK      ZERO VMBLOK LOCK WORD            @VMH0026 00661000
         L     R11,VMPNT      GET ADDRESS OF NEXT VMBLOK       @V5BC0AB 00662000
         CR    R11,R10        END OF CHAIN?                    @V5BC0AB 00663000
         BNE   LOOP           NO, DO ALL VMBLOKS               @V5BC0AB 00664000
         SPACE                                                          00665000
* FREE ALL THE AP RELATED CONTROL BLOCKS                                00666000
*                             FREE BACK POCKET FOR DMKFRE               00667000
         SR    R0,R0          CLEAR A REGISTER                 @V5BC0AB 00668000
         L     R10,CPUFREAP   GET PTR TO FREE BACK POCKET ADDRESS      X00669000
                                                               @V5BC0AB 00670000
         IC    R0,0(R10)      GET SIZE IN DOUBLE WORDS         @V5BC0AB 00671000
         ICM   R1,B'0111',1(R10) GET ADDRESS OF BACK POCKET    @V5BC0AB 00672000
         CALL  DMKFRET        FREE THE STORAGE                 @V5BC0AB 00673000
         SR    R0,R0          CLEAR A REGISTER                 @V5BC0AB 00674000
         STCM  R0,B'0111',1(R10) ZERO THE BACK POCKET ADDRESS  @V5BC0AB 00675000
*                             FREE THE CPEXBLOK FOR THE SWITCH MACRO    00676000
         LA    R0,CPEXSIZE    GET SIZE OF A CPEXBLOK           @V5BC0AB 00677000
         L     R1,PREFIXA     ADDRESS ABSOLUTE ZERO PSA        @V5BC0AB 00678000
         L     R1,PSACPXBP-PSA(,R1) GET THE ADDRESS OF THE CPEXBLOK    X00679000
                                                               @V5BC0AB 00680000
         CALL  DMKFRET        FREE THE STORAGE                 @V5BC0AB 00681000
         MVC   PSACPXBP(4),ZEROES CLEAR THE CPEXBLOK ADDRESS   @V5BC0AB 00682000
         SPACE                                                          00683000
* FREE THE MACHINE CHECK CPEXBLOK                                       00684000
         SPACE                                                          00685000
         USING MCHAREA,R5                                      @V5BC0AB 00686000
         SPACE                                                          00687000
         L     R7,PREFIXB     ADDRESS OTHER PROCESSOR'S PSA    @V5BC0AB 00688000
         L     R5,AMCHAREA-PSA(,R7) GET ADDRESS OF MACHINE CHECK AREA  X00689000
                                                               @V5BC0AB 00690000
         L     R1,MCHCPEX     GET ADDRESS OF CPEXBLOK          @V5BC0AB 00691000
         LA    R0,CPEXSIZE    GET SIZE OF THE CPEXBLOK         @V5BC0AB 00692000
         CALL  DMKFRET        FREE THE STORAGE                 @V5BC0AB 00693000
* FREE THE MACHINE CHECK RECORD FOR THE PROCESSOR GOING OFFLINE         00694000
         SPACE                                                          00695000
         L     R1,MCHREC      GET ADDRESS OF MACHINE CHECK RECORD      X00696000
                                                               @V5BC0AB 00697000
         SR    R9,R9          ZERO REGISTER 9                  @V5BC0AB 00698000
         LH    R9,CPUMCELL(R7) COMPUTE LENGTH OF MCHREC.  ADD LENGTH   X00699000
                                                               @V5BC0AB 00700000
*                             OF EXTENDED LOGOUT AREA                   00701000
         LA    R6,MCHLEN1     PLUS LEN OF DAMAGE ASSESSMENT AREA       X00702000
                                                               @V5BC0AB 00703000
         LA    R0,MCHFIX(R9,R6) CALCULATE TOTAL LENGTH         @V5BC0AB 00704000
         A     R0,F7          GET LENGTH ON A DOUBLE WORD BOUNDARY     X00705000
                                                               @V5BC0AB 00706000
         SRL   R0,3           DIVIDE BY 8                      @V5BC0AB 00707000
         CALL  DMKFRET        FREE THE STORAGE                 @V5BC0AB 00708000
         SPACE                                                          00709000
         DROP  R5                                              @V5BC0AB 00710000
         SPACE                                                          00711000
         L     R10,=A(DMKSCHTQ)                                @V5BC0AB 00712000
         SPACE                                                          00713000
         USING TRQBLOK,R10                                     @V5BC0AB 00714000
         SPACE                                                          00715000
         L     R10,TRQBFPNT   GET FIRST ELEMENT ON QUEUE       @V5BC0AB 00716000
         C     R10,ACTIVTRQ   POINTING TO TOP TRQ              @V5BC0AB 00717000
         BE    PSAMOVE        YES, CONTINUE                    @V5BC0AB 00718000
         ST    R10,ACTIVTRQ   POINT TO TOP TRQ                 @V5BC0AB 00719000
         SCKC  TRQBVAL        SET CLOCK COMPARATOR             @V5BC0AB 00720000
         SPACE                                                          00721000
         DROP  R10                                             @V5BC0AB 00722000
         SPACE                                                          00723000
* THE FOLLOWING CODE MOVES ALL OF THE FIELDS MAINTAINED IN THE ABSOLUTE 00724000
* ZERO PSA TO THE CURRENT PSA.  THEN THE CURRENT PSA IS COPIED INTO     00725000
* THE ABSOLUTE ZERO PSA.  THE PSAS ARE FRETTED, AND PREFIXING IS        00726000
* STOPPED.                                                              00727000
*                                                                       00728000
         SPACE                                                          00729000
PSAMOVE  DS    0H                                              @V5BC0AB 00730000
         L     R2,PREFIXA     ADDRESS THE ABSOLUTE ZERO PSA    @V5BC0AB 00731000
         MVC   TTSEGCNT(4),TTSEGCNT-PSA(R2)                    @V5BC0AB 00732000
         MVC   PAGERATE(2),PAGERATE-PSA(R2)                    @V5BC0AB 00733000
         MVC   CPID(4),CPID-PSA(R2)                            @V5BC0AB 00734000
         MVC   TRACSTRT(12),TRACSTRT-PSA(R2) COPY TRACSTRT, TRACEND,   X00735000
                                                               @V5BC0AB 00736000
*                                            AND TRACCURR               00737000
         MVC   PAGECUR(16),PAGECUR-PSA(R2) COPY PAGECUR, MONNEXT,      X00738000
                                                               @V5BC0AB 00739000
*                                          PAGEND, PAGENXT              00740000
         SR    R14,R14        ADDRESS CURRENT PSA              @V5BC0AB 00741000
         L     R15,F4096      GET FROM MVCL LENGTH             @V5BC0AB 00742000
         L     R3,F4096       GET TO MVCL LENGTH               @V5BC0AB 00743000
*                             REGISTER HAS THE TO MVCL ADDRESS          00744000
         MVCL  R2,R14         COPY CURRENT PSA TO ABSOLUTE ZERO PSA    X00745000
                                                               @V5BC0AB 00746000
         SPACE                                                          00747000
         SPX   ZEROES         STOP PREFIXING                   @V5BC0AB 00748000
         SPACE                                                          00749000
         MVC   PREFIXA(8),ZEROES SET PREFIXA AND PREFIXB TO ZEROES     X00750000
                                                               @V5BC0AB 00751000
         L     R11,SAVER11    GET CURRENT VMBLOK ADDRESS       @VMH0025 00752000
         CHARGE STOP          STOP CPU TIMER                   @VMH0025 00753000
         CHARGE SYNC          SYNCHRONIZE VMTTIME              @VMH0025 00754000
         LA    R10,VMTTIME-VMBLOK GET VMTTIME DISPLACEMENT     @VMH0025 00755000
         ST    R10,TIMEDISP   SET UP DISPLACEMENT IN PSA       @VMH0025 00756000
         STCTL C0,C0,CPCREG0 SAVE CONTROL REGISTER ZERO        @VMH0029 00757000
         NC    CPCREG0+2(2),MFAESEXT TURN OFF MFA, EMS, EXTS,  @VMH0029 00758000
*                             AND TOD CLOCK SYNC CHECK INTERRUPT BITS   00759000
         LCTL  C0,C0,CPCREG0 LOAD MODIFIED CR0 (CR0 UP MODE)   @VMH0029 00760000
         SPACE                                                          00761000
         NI    APSTAT1,FF-APUOPER SET APUOPER OFF              @V5BC0AB 00762000
         CHARGE START         RESET THE CPU TIMER              @VMH0025 00763000
         L     R10,CPUSCHCA   GET ADDRESS OF DMKSCH AP WAIT    @VMH0008 00764000
*                             VALUES                                    00765000
         MVC   0(16,R10),INITWAIT SET THE SCHEDULER AP WAIT    @VMH0008 00766000
*                             TO THEIR INITIAL VALUES                   00767000
         L     R10,CPUPAGWS  GET ADDR OF ATTACHED PROCESSOR    @VMH0012 00768000
         LA    R10,8(,R10)    WAITSAVE VALUE IN DMKPAG         @VMH0014 00769000
         MVC   0(8,R10),WAITSAV8 SET TO INITIAL VALUE          @VMH0012 00770000
         L     R10,CPUCQRWS  GET ADDR OF ATTACHED PROCESSOR    @VMH0012 00771000
         LA    R10,8(,R10)    WAITSAVE VALUE IN DMKCQR         @VMH0014 00772000
         MVC   0(8,R10),WAITSAV8 SET TO INITIAL VALUE          @VMH0012 00773000
         SPACE                                                          00774000
         SR    R15,R15        CLEAR REGISTER 15                @V5BC0AB 00775000
         STH   R15,IPUADDRX   ZERO IPUADDRX                    @V5BC0AB 00776000
         L     R2,=A(DMKLOKSY) GET ADDRESS OF SYSTEM LOCK      @VMH0028 00777000
         STH   R15,LPUADDRX   ZERO LPUADDRX                    @V5BC0AB 00778000
         ST    R15,0(,R2)     ZERO THE GLOBAL SYSTEM LOCK      @VMH0028 00779000
         ST    R15,UNSHRVM    CLEAR ADDRESS OF VMBLOK PENDING  @VMH0020 00780000
*                             UNSHARE                                   00781000
         ST    R15,STACKVM    CLEAR STACKED (LOCKED) VMBLOK    @VMH0020 00782000
*                             ADDRESS                                   00783000
         L     R2,CPUDMPAA    GET PTR TO ATTACH. PROC'S ADDR   @V5BC0AB 00784000
         MVC   0(2,R2),IPUADDR SET IT TO REMAINING PROCESSOR ADDRESS   X00785000
                                                               @V5BC0AB 00786000
*                                                                       00787000
         L     R1,CPUDMPSA    GET PTR TO PSA ADDRESSES         @V5BC0AB 00788000
         L     R7,4(,R1)      GET PSA ADDRESS OF PROC. GOING OFFLINE   X00789000
                                                               @V5BC0AB 00790000
         SRL   R7,8           LEAVE PAGE NUMBER * 16           @V5BC0AB 00791000
         AL    R7,ACORETBL    CALCULATE THE CORTABLE ENTRY ADDRESS     X00792000
                                                               @V5BC0AB 00793000
         CALL  DMKPTRFT       FREE THE STORAGE                 @V5BC0AB 00794000
         L     R1,CPUDMPSA                                     @V5BC0AB 00795000
         L     R7,0(,R1)      GET PSA ADDRESS OF REMAINING PROCESSOR   X00796000
                                                               @V5BC0AB 00797000
         SRL   R7,8           LEAVE PAGE NUMBER * 16           @V5BC0AB 00798000
         AL    R7,ACORETBL    CALCULATE THE CORTABLE ENTRY ADDRESS     X00799000
                                                               @V5BC0AB 00800000
         CALL  DMKPTRFT       FREE A PAGE OF STORAGE           @V5BC0AB 00801000
         L     R1,CPUDMPSA    GET PTR TO PSA ADDRESSES         @V5BC0AB 00802000
         MVC   0(8,R1),ZEROES SET THE PSA ADDRESSES TO ZEROES  @V5BC0AB 00803000
**************************************************************          00804000
*             THE SYSTEM IS NOW IN UP MODE                   *          00805000
**************************************************************          00806000
         SPACE                                                          00807000
*                                                                       00808000
* THE FOLLOWING CODE RELEASES THE SYSTEM RESOURCES DESCRIBED BY THE     00809000
* ATTACHED PROCESSOR'S COPY OF PAGE AND SWAP TABLES FOR SHARED SEGMENTS 00810000
*                                                                       00811000
         L     R11,ASYSVM     GET ADDRESS OF SYSTEM VMBLOK     @VMH0026 00812000
         L     R11,VMPNT      GET FIRST ADDR OF FIRST VMBLOK   @VMH0026 00813000
         LR    R10,R11        SAVE ADDRESS IN REGISTER 10      @VMH0026 00814000
WAITONIO DS    0H                                              @VMH0026 00815000
         TM    VMRSTAT,VMPGWAIT IS VIRTUAL MACHINE WAITING     @VMH0026 00816000
*                             FOR PAGING I/O TO COMPLETE?               00817000
         BNO   NEXTVMBK       NO, BRANCH                       @VMH0026 00818000
         CALL  DMKPTRPW       GO WAIT FOR I/O TO COMPLETE      @VMH0026 00819000
NEXTVMBK DS    0H                                              @VMH0026 00820000
         L     R11,VMPNT      GET NEXT VMBLOK ADDRESS          @VMH0026 00821000
         CLR   R11,R10        END OF CHAIN?                    @VMH0026 00822000
         BNE   WAITONIO       NO, BRANCH                       @VMH0026 00823000
         L     R6,=A(DMKVMAS1) GET THE POINTER TO THE SHRTABLE ANCHOR  X00824000
                                                               @V5BC0AB 00825000
         L     R7,0(,R6)      GET ADDRESS OF FIRST SHRTABLE    @V5BC0AB 00826000
         CR    R7,R6          ARE THERE ANY SHRTABLES?         @V5BC0AB 00827000
         BE    UPMODE         NO, CONTINUE WITH OFFLINE PROCESSING     X00828000
                                                               @V5BC0AB 00829000
         OI    APSTAT2,CPPTLBR INDICATE A PTLB IS NECESSARY    @V5BC0AB 00830000
* NOTE THAT AT VARY ONLINE TIME, AS PART OF THE SIGNAL INITIAL          00831000
* PROGRAM RESET (IPR), A PTLB IS DONE ON THE PROCESSOR BEING            00832000
* SIGNALLED.                                                            00833000
         SPACE                                                          00834000
         USING SHRTABLE,R7                                     @V5BC0AB 00835000
         SPACE                                                          00836000
SHRTBLNX DS    0H                                              @V5BC0AB 00837000
         TM    SHRFLAG,SHRNOPRT IS NAMED SYSTEM UNPROTECTED?   @VMI0032 00838000
         BNO   PROTECT        NO, BRANCH                       @VMI0032 00839000
         L     R7,SHRFPNT     GET ADDRESS OF NEXT SHRTABLE     @VMI0032 00840000
         LA    R7,0(,R7)      ERASE SHRFLAG VALUE              @VMI0085 00841000
         CR    R7,R6          ANY MORE SHRTABLES?              @VMI0032 00842000
         BE    CHKCCPDU       NO, BRANCH                       @VMI0032 00843000
         B     SHRTBLNX       YES, GO CHECK FOR PROTECT=NO     @VMI0032 00844000
PROTECT  DS    0H                                              @VMI0032 00845000
         L     R10,SHRSEGCT   GET NUMBER OF SEGMENTS           @V5BC0AB 00846000
         LR    R14,R10        GET NUMBER OF SEGMENTS           @V5BC0AB 00847000
         LA    R3,SHRSEGNM    GET ADDRESS OF SHRSEGNM FIELD    @V5BC0AB 00848000
SHRPGT1  DS    0H                                              @V5BC0AB 00849000
         LA    R3,L'SHRPAGE(,R3) GET POSSIBLE ADDRESS OF 1ST SHRPAGE   X00850000
                                                               @V5BC0AB 00851000
         S     R14,F4         UP TO 4 SEG. NOS/WORD            @V5BC0AB 00852000
         BP    SHRPGT1        LOOP UNTIL ADDRESSING 1ST SHRPAGE ENTRY  X00853000
                                                               @V5BC0AB 00854000
         SPACE                                                          00855000
         USING SHRPAGE,R3                                      @V5BC0AB 00856000
         SPACE                                                          00857000
SHRPGTNX DS    0H                                              @V5BC0AB 00858000
         L     R4,SHRPAGE     GET PAGE TABLE ADDRESS           @V5BC0AB 00859000
         N     R4,=A(X'FFFFFE') LEAVE PGT ADDRESS ONLY         @V5BC0AB 00860000
         SL    R4,F16         BACK UP TO HEADER                @V5BC0AB 00861000
         LA    R4,PAGBMP(,R4) ADDRESS THE ATT. PROC'S PGT      @V5BC0AB 00862000
         SLR   R9,R9          CLEAR REGISTER 9                 @V5BC0AB 00863000
         IC    R9,SHRPAGE     GET FIRST BYTE OF SHRPAGE        @V5BC0AB 00864000
         SRL   R9,4           LEAVE NUMBER OF PAGES MINUS ONE  @V5BC0AB 00865000
         AL    R9,F1          ADD ONE TO NUMBER OF PAGES       @V5BC0AB 00866000
         SPACE                                                          00867000
         USING PAGTABLE,R4                                     @V5BC0AB 00868000
         SPACE                                                          00869000
         LA    R8,PAGCORE     GET POINTER TO 1ST PAGE ADDRESS  @V5BC0AB 00870000
         SPACE                                                          00871000
         USING PAGCORE,R8                                      @V5BC0AB 00872000
         SPACE                                                          00873000
         LA    R5,PAGTSWP(,R4) GET ADDRESS OF SWPTABLE         @V5BC0AB 00874000
         SPACE                                                          00875000
         USING SWPTABLE,R5                                     @V5BC0AB 00876000
         SPACE                                                          00877000
         L     R11,SWPVM      GET VMBLOK ADDRESS               @V5BC0AB 00878000
         LA    R5,SWPFLAG     ADDRESS THE FIRST SWPT ENTRY     @V5BC0AB 00879000
         SPACE                                                          00880000
         DROP  R5                                              @V5BC0AB 00881000
         SPACE                                                          00882000
         USING SWPFLAG,R5                                      @V5BC0AB 00883000
         SPACE                                                          00884000
DOAPGTE  DS    0H                                              @V5BC0AB 00885000
         TM    PAGCORE+1,PAGINVAL IS PAGE IN CORE?             @V5BC0AB 00886000
         BO    SLOTRLSE       NO, SEE IF SLOT MAY BE RELEASED  @V5BC0AB 00887000
         LH    R2,PAGCORE     LOAD A PAGCORE ENTRY             @V5BC0AB 00888000
         N     R2,=A(X'FFF0') LEAVE ONLY PAGE NUMBER * 16      @V5BC0AB 00889000
         A     R2,ACORETBL    GET CORE TABLE ENTRY ADDRESS     @V5BC0AB 00890000
         SPACE                                                          00891000
         USING CORTABLE,R2                                     @V5BC0AB 00892000
         SPACE                                                          00893000
CNTRS    DS    0H                                              @V5BC0AB 00894000
         TM    CORFLAG,CORRSV IS PAGE RESERVED?                @V5BC0AB 00895000
         BZ    DECPTRSC       NO, BRANCH                       @V5BC0AB 00896000
         L     R15,=A(DMKPTRRC) GET RESERVED PAGE COUNT ADDRESS        X00897000
                                                               @V5BC0AB 00898000
         L     R14,0(,R15)    PICK UP COUNT FIELD              @V5BC0AB 00899000
         BCTR  R14,0          DECREMENT COUNT                  @V5BC0AB 00900000
         ST    R14,0(,R15)    STORE NEW COUNT                  @V5BC0AB 00901000
         L     R15,=A(DMKDSPNP) GET ADDRESS OF PAGEABLE PAGE COUNT     X00902000
                                                               @V5BC0AB 00903000
         LA    R14,1          GET INCREMENT                    @V5BC0AB 00904000
         AL    R14,0(,R15)    INCREMENT COUNT                  @V5BC0AB 00905000
         ST    R14,0(,R15)    STORE NEW COUNT                  @V5BC0AB 00906000
DECPTRSC DS    0H                                              @V5BC0AB 00907000
         L     R15,=A(DMKPTRSC) GET ADDRESS OF SHARED PAGES COUNT      X00908000
                                                               @V5BC0AB 00909000
         L     R14,0(,R15)    GET COUNT                        @V5BC0AB 00910000
         BCTR  R14,0          DECREMENT COUNT                  @V5BC0AB 00911000
         ST    R14,0(,R15)    STORE COUNT                      @V5BC0AB 00912000
         L     R14,CORVM      GET VMBLOK ADDRESS OF OWNER      @V5BC0AB 00913000
         LH    R15,VMPAGES-VMBLOK(,R14) DECREMENT FRAME COUNT  @V5BC0AB 00914000
         S     R15,F1         BY ONE                           @V5BC0AB 00915000
         BM    CPU1           COUNT IS NEGATIVE, TERMINATECP   @V5BC0AB 00916000
         STH   R15,VMPAGES-VMBLOK(,R14) STORE NEW COUNT        @V5BC0AB 00917000
ZEROCORE DS    0H                                              @V5BC0AB 00918000
         OI    VMESTAT-VMBLOK(R14),VMINVPAG INDICATE INVALID PAGE      X00919000
                                                               @V5BC0AB 00920000
         XC    CORPGPNT(4),CORPGPNT ZERO PAGE TABLE ADDRESS    @V5BC0AB 00921000
         MVC   PAGCORE,F8+2   INVALIDATE PAGE TABLE ENTRY      @V5BC0AB 00922000
         ST    R7,SAVEWRK7    SAVE SHRTABLE POINTER            @V5BC0AB 00923000
         TM    CORFLAG,CORIOLCK IS PAGE LOCKED FOR I/O?        @V5BC0AB 00924000
         BZ    PAGEFRET       NO, GO FREE PAGE                 @V5BC0AB 00925000
         SR    R0,R0          CLEAR REGISTER ZERO              @V5BC0AB 00926000
         STCM  R0,B'0111',CORSWPNT+1 CLEAR SWAP TABLE POINTER  @V5BC0AB 00927000
         NI    CORFLAG,FF-CORSHARE-CORRSV CLEAR SHARE AND RESERVED      00928000
*                                                              @V5BC0AB 00929000
         B     SLOTRLSE       GO TEST FOR SLOT RELEASE         @V5BC0AB 00930000
PAGEFRET DS    0H                                              @V5BC0AB 00931000
         LR    R7,R2          R7 HAS THE ADDRESS OF CORTABLE ENTRY     X00932000
                                                               @V5BC0AB 00933000
         CALL  DMKPTRFT       RETURN PAGE TO FREE LIST         @V5BC0AB 00934000
         L     R7,SAVEWRK7    RESTORE SHRTABLE ADDRESS         @V5BC0AB 00935000
SLOTRLSE DS    0H                                              @V5BC0AB 00936000
         TM    SWPFLAG,SWPRECMP CAN DASD SLOT BE RELEASED?     @V5BC0AB 00937000
         BO    BMPCORE1       NO, BRANCH                       @V5BC0AB 00938000
         DROP  R2                                              @V5BC0AB 00939000
         SPACE                                                          00940000
         SR    R2,R2          CLEAR REGISTER                   @V5BC0AB 00941000
         IC    R2,SWPCODE     GET VOLUME INDEX CODE            @V5BC0AB 00942000
         SLL   R2,3           GET VOLUME INDEX CODE            @V5BC0AB 00943000
         AL    R2,=A(DMKSYSOW) POINT TO OWNED LIST ENTRY       @V5BC0AB 00944000
         LH    R2,OWNDRDEV-OWNDLIST(,R2) GET RDEVBLOK INDEX    @V5BC0AB 00945000
         SLL   R2,3           CONVERT TO BYTE INDEX            @V5BC0AB 00946000
         AL    R2,ARIODV      ADD TO ADDRESS OF FIRST RDEVBLOK @V5BC0AB 00947000
         SPACE                                                          00948000
         USING RDEVBLOK,R2                                     @V5BC0AB 00949000
         SPACE                                                          00950000
         LA    R15,VMPDRUM-VMBLOK ASSUME ON DRUM               @V5BC0AB 00951000
         CLI   RDEVTYPE,TYP2305 IS IT A DRUM?                  @V5BC0AB 00952000
         BE    DRUM           YES, BRANCH IT IS A DRUM         @V5BC0AB 00953000
         LA    R15,VMPDISK-VMBLOK NO, RESET TO DISK COUNTER    @V5BC0AB 00954000
DRUM     DS    0H                                              @V5BC0AB 00955000
         LH    R0,0(R15,R11)  GET COUNTER                      @V5BC0AB 00956000
         S     R0,F1          DECREMENT                        @V5BC0AB 00957000
         STH   R0,0(R15,R11)  STORE NEW COUNT                  @V5BC0AB 00958000
         SPACE                                                          00959000
         DROP  R2                                              @V5BC0AB 00960000
         SPACE                                                          00961000
         CALL  DMKPGTSP       RELEASE THE SYSTEM DASD SLOT     @V5BC0AB 00962000
         MVI   SAVEWRK8,YES   INDICATE CCPD'S MUST BE UPDATED  @V5BC0AB 00963000
*                             IN THE ATTCHED PROC'S COPY OF PGT/SWPT    00964000
*                             I.E., AT LEAST ONE SWPRECMP FLAG WAS OFF  00965000
BMPCORE1 DS    0H                                              @V5BC0AB 00966000
         LA    R5,8(,R5)      ADDRESS NEXT SWAP TABLE ENTRY    @V5BC0AB 00967000
         LA    R8,L'PAGCORE(,R8) ADDRESS THE NEXT POSSIBLE PGT POINTER X00968000
                                                               @V5BC0AB 00969000
         BCT   R9,DOAPGTE     AND PROCESS IT, IF THERE IS ANOTHER      X00970000
                                                               @V5BC0AB 00971000
         LA    R3,L'SHRPAGE(,R3) ADDRESS NEXT SHRPAGE ENTRY    @V5BC0AB 00972000
         BCT   R10,SHRPGTNX   IF THERE IS ANOTHER              @V5BC0AB 00973000
         L     R7,SHRFPNT     GET NEXT SHRTABLE ADDRESS        @V5BC0AB 00974000
         CR    R7,R6          ARE THERE ANY MORE SHARE TABLES? @V5BC0AB 00975000
         BNE   SHRTBLNX       BRANCH IF THERE ARE MORE         @V5BC0AB 00976000
         SPACE                                                          00977000
         DROP  R3,R4,R5,R7,R8                                  @V5BC0AB 00978000
CHKCCPDU DS    0H                                              @VMI0032 00979000
         SPACE                                                          00980000
         CLI   SAVEWRK8,YES   MUST THE CCPDS BE UPDATED?       @V5BC0AB 00981000
         BNE   UPMODE         NO, CONTINUE OFFLINE PROCESSING  @V5BC0AB 00982000
         SPACE 4                                                        00983000
* THE FOLLOWING CODE WILL REINITIALIZE THE CCPDS OF THE       *         00984000
* SECOND SET OF SWAP TABLES.                                   *        00985000
         L     R6,=A(DMKVMAS1) GET THE POINTER TO THE SHRTABLE ANCHOR  X00986000
                                                               @V5BC0AB 00987000
         L     R7,0(,R6)      GET THE ADDRESS OF THE FIRST SHRTABLE    X00988000
                                                               @V5BC0AB 00989000
         BAL   R5,GETSNTBL    BRING IN AND LOCK THE SYSTEM NAME TABLE  X00990000
                                                               @V5BC0AB 00991000
         SPACE                                                          00992000
         USING SYSTBL,R4                                       @V5BC0AB 00993000
         SPACE                                                          00994000
         USING SHRTABLE,R7                                     @V5BC0AB 00995000
         SPACE                                                          00996000
SYSNAMEL DS    0H             FIND THE SYSTABLE FOR THIS SHRTABLE      X00997000
                                                               @V5BC0AB 00998000
         TM    SHRFLAG,SHRNOPRT IS NAMED SYSTEM UNPROTECTED?   @VMI0032 00999000
         BNO   COMPAREN       NO, BRANCH                       @VMI0032 01000000
         L     R7,SHRFPNT     GET NEXT SHRTABLE ADDRESS        @VMI0032 01001000
         LA    R7,0(,R7)      ERASE SHRFLAG VALUE              @VMI0085 01002000
         CR    R7,R6          ANY MORE SHRTABLES?              @VMI0032 01003000
         BNE   SYSNAMEL       YES, BRANCH                      @VMI0032 01004000
         BAL   R5,UNLSNTBL    GO UNLOCK DMKSNT                 @VMI0032 01005000
         B     UPMODE         GO FINISH OFFLINE PROCESSING     @VMI0032 01006000
COMPAREN DS    0H                                              @VMI0032 01007000
         CLC   SYSNAME,SHRNAME DO THE NAMES MATCH?             @V5BC0AB 01008000
         BE    NAMEEQU        YES, FOUND THE SYSTABLE FOR THE SHRTABLE X01009000
                                                               @V5BC0AB 01010000
         L     R3,SYSPNT      GET DISPLACEMENT OF NEXT ENTRY   @V5BC0AB 01011000
         AR    R4,R3          COMPUTE ADDR OF NEXT ENTRY       @V5BC0AB 01012000
         LTR   R3,R3          LAST ENTRY                       @V5BC0AB 01013000
         BNZ   SYSNAMEL       LOOP UNTIL A MATCH IS FOUND      @V5BC0AB 01014000
         SPACE                                                          01015000
* A CORRESPONDING SYSTABLE WAS NOT FOUND FOR THE SHARED SYSTEM.         01016000
* THIS IS AN ERROR CONDITION.  ISSUE ABEND, CPU002                      01017000
*                                                                       01018000
         NI    APSTAT4,FF-POFFLINE CLEAR VARY IN PROCESS FLAG  @V5BC0AB 01019000
         BAL   R5,UNLSNTBL    UNLOCK THE SNT                   @V5BC0AB 01020000
         B     CPU2         ABEND CP                           @V5BC0AB 01021000
*                                                                       01022000
*                                                                       01023000
NAMEEQU  DS    0H                                              @V5BC0AB 01024000
         LA    R1,SYSVOL      GET ADDRESS OF VOLUME SERIAL     @V5BC0AB 01025000
         LA    R0,L'SYSVOL    GET LENGTH OF SERIAL             @V5BC0AB 01026000
         CALL  DMKSCNVS       GET DEVICE BLOCK                 @V5BC0AB 01027000
         BZ    DEVBK          CONTINUE IF FOUND                @V5BC0AB 01028000
         L     R4,SAVEWRK4    GET ADDRESS OF 1ST SYSTABLE ENTRY        X01029000
                                                               @V5BC0AB 01030000
         L     R7,SHRFPNT     SKIP TO NEXT SHRTABLE            @V5BC0AB 01031000
         CR    R7,R6          END OF SHRTABLE CHAIN?           @V5BC0AB 01032000
         BNE   SYSNAMEL       NO, PROCESS ALL SHRTABLES        @V5BC0AB 01033000
         BAL   R5,UNLSNTBL    NO MORE. UNLOCK THE SNT          @V5BC0AB 01034000
         B     UPMODE         CONTINUE OFFLINE PROCESSING      @V5BC0AB 01035000
DEVBK    DS    0H                                              @V5BC0AB 01036000
         USING RDEVBLOK,R1                                     @V5BC0AB 01037000
         L     R5,SYSSTART    LOAD CCPD OF START OF SYSTEM     @V5BC0AB 01038000
*                             ON SYSVOL                                 01039000
         IC    R5,RDEVCODE+1  INSERT INDEX  INTO OWNED LIST FOR        X01040000
                                                               @V5BC0AB 01041000
*                             SYSVOL                                    01042000
         LA    R0,PAGE2314    MAX. PAGES/CYL ON 2314           @V5BC0AB 01043000
         TM    RDEVTYPE,TYP2314 2314?                          @V5BC0AB 01044000
         BO    SAVEMAXP       YES                              @V5BC0AB 01045000
         LA    R0,PAGE3330    MAX. PAGES/CYL ON 3330           @V5BC0AB 01046000
         TM    RDEVTYPE,TYP3330 3330?                          @V5BC0AB 01047000
         BO    SAVEMAXP       YES                              @V5BC0AB 01048000
         LA    R0,PAGE3350    MAX. PAGES/CYL ON 3350           @V5BC0AB 01049000
         CLI   RDEVTYPE,TYP3350 3350?                          @V5BC0AB 01050000
         BE    SAVEMAXP       YES                              @V5BC0AB 01051000
         LA    R0,PAGE2305    MAX. PAGES/CYL ON 2305 AND 3340  @V5BC0AB 01052000
*                                                                       01053000
         SPACE                                                          01054000
         DROP  R1                                              @V5BC0AB 01055000
         SPACE                                                          01056000
SAVEMAXP DS    0H                                              @V5BC0AB 01057000
         SLL   R0,8                                            @V5BC0AB 01058000
         ST    R0,SAVEWRK9    SAVE PAGES/CYL VALUE             @V5BC0AB 01059000
         L     R6,F256        GET INCREMENT CONSTANT FOR CCPDS @V5BC0AB 01060000
         AR    R5,R6          BUMP TO NEXT CCPD                @V5BC0AB 01061000
*                             THIS MOVES PASS THE PAGE CONTAINING       01062000
*                             KEYS, ETC.                                01063000
         LR    R1,R5          PUT CCPD IN R1                   @V5BC0AB 01064000
         N     R1,WHEXFF00    LEAVE ONLY PAGE NUMBER           @V5BC0AB 01065000
         CL    R1,SAVEWRK9    LAST PAGE ON THIS CYLINDER?      @V5BC0AB 01066000
         BNH   SHRCT          NO, BRANCH CYL OK                @V5BC0AB 01067000
         A     R5,HEX10000    YES, BUMP TO NEXT CYLINDER       @V5BC0AB 01068000
         ICM   R5,B'0010',F1+3 SET PAGE NUMBER TO 1            @V5BC0AB 01069000
SHRCT    DS    0H                                              @V5BC0AB 01070000
*                                                                       01071000
*                                                                       01072000
         L     R14,SHRSEGCT   GET NO. OF SHARED SEGMENTS       @VMH0007 01073000
         SLR   R10,R10        ZERO REGISTER 10                 @VMH0007 01074000
         LA    R3,SHRSEGNM    POINT TO SHRSEGNM FIELD          @V5BC0AB 01075000
SHRPGT   DS    0H             COMPUTE ADDRESS OF FIRST SHRPAGE FIELD   X01076000
                                                               @V5BC0AB 01077000
         LA    R3,L'SHRPAGE(,R3) GET NEXT POSSIBLE SHRPAGE POINTER     X01078000
                                                               @V5BC0AB 01079000
         S     R14,F4         SUBTRACT 4 (4 POSSIBLE ENTRIES/WORD)     X01080000
                                                               @V5BC0AB 01081000
         BP    SHRPGT         LOOP UNTIL R3 ADDRESSES 1ST SHRPAGE      X01082000
                              ENTRY                                     01083000
         ST    R3,SAVEWRK3    SAVE SHRPAGE POINTER             @V5BC0AB 01084000
* CALCULATE THE ADDRESS OF SYSHRSEG                                     01085000
         LH    R3,SYSPAGLN    GET COUNT OF SYSPAGNM ENTRIES    @V5BC0AB 01086000
         ST    R3,SAVEWRK8    SAVE NUMBER OF SYSPAGNM ENTRIES  @V5BC0AB 01087000
         SLL   R3,2           TIMES FOUR                       @V5BC0AB 01088000
         LA    R3,SYSPAGNM(R3) R3 = ADDRESS OF SYSSEGLN        @V5BC0AB 01089000
         LA    R3,2(,R3)      R3 = ADDRESS OF SYSHRSEG         @V5BC0AB 01090000
*                                                                       01091000
         USING SYSHRSEG,R3                                     @V5BC0AB 01092000
         SPACE                                                          01093000
         SR    R2,R2          INDEX THRU SYSPAGNM ENTRIES      @V5BC0AB 01094000
*                                                                       01095000
LOOPPAGE DS    0H                                              @V5BC0AB 01096000
         L     R8,SYSPAGNM(R2) LOAD RANGE OF PAGES             @V5BC0AB 01097000
         ST    R2,SAVEWRK2    SAVE SYSPAGNM INDEX              @V5BC0AB 01098000
         SRDL  R8,16          RIGHT JUSTIFY START PAGE IN R8   @V5BC0AB 01099000
         SRL   R9,16          RIGHT JUSTIFY END PAGE IN R9     @V5BC0AB 01100000
         SLL   R8,12          COMPUTE START PAGE ADDRESS       @V5BC0AB 01101000
         SLL   R9,12          COMPUTE END PAGE ADDRESS         @V5BC0AB 01102000
*                                                                       01103000
GETSEGNO DS    0H                                              @V5BC0AB 01104000
         LR    R1,R8          PUT PAGE ADDRESS IN R1           @V5BC0AB 01105000
         SRL   R1,16          RIGHT JUSTIFY SEGMENT NO.        @V5BC0AB 01106000
         SR    R2,R2          CLEAR REGISTER 2                 @V5BC0AB 01107000
         IC    R2,SYSHRSEG(R10) GET SHARED SEGMENT NUMBER      @VMH0007 01108000
         LR    R14,R2         PUT SHARED SEG NO. IN REGISTER 14        X01109000
                                                               @V5BC0AB 01110000
         SLL   R14,16         FORM SEGMENT START PAGE ADDRESS  @V5BC0AB 01111000
         AL    R14,HEX10000   ADD IN 16 * 4096                 @V5BC0AB 01112000
         ST    R14,SAVEWRK6   SAVE SEGMENT END PAGE ADDRESS    @V5BC0AB 01113000
         L     R14,SAVEWRK3   YES,THEY MATCH. GET SHRPAGE PTR  @VMH0007 01114000
         L     R14,0(,R14)    ADDRESS THE PAGE TABLE (LOAD     @VMH0007 01115000
*                             SHRPAGE)                                  01116000
         N     R14,=A(X'FFFFFE') LEAVE PGT ADDRESS ONLY        @VMH0007 01117000
         LA    R14,PAGBMP(,R14) ADDRESS DUPLICATE COPY OF PAGE @VMH0007 01118000
*                             TABLES                                    01119000
         SL    R14,F16        BACK UP TO PAGE TABLE HEADER     @VMH0007 01120000
         LA    R14,PAGTSWP(,R14) GET SWPT ADDRESS FOR ATTACHED @VMH0007 01121000
*                             PROC'S COPY                               01122000
         USING SWPTABLE,R14                                    @VMH0007 01123000
         LA    R14,SWPFLAG    ADDRESS THE FIRST SWPTABLE ENTRY @VMH0007 01124000
         DROP  R14                                             @VMH0007 01125000
         SPACE                                                          01126000
         LR    R15,R8         GET PAGE ADDRESS                 @V5BC0AB 01127000
         SRL   R15,12         LEAVE SEG/PAGE NUMBER            @V5BC0AB 01128000
         N     R15,F15        LEAVE ONLY PAGE NUMBER           @V5BC0AB 01129000
         SLL   R15,3          GET SWPT INDEX (PAGE NO. * 8)    @V5BC0AB 01130000
         ALR   R15,R14        ADD IN ADDRESS OF 1ST SWAP TABLE @VMH0007 01131000
*                             ENTRY                                     01132000
         S     R15,F8         SUBTRACT 8 FROM THE SWPTE        @VMH0021 01133000
**************************************************************          01134000
* NOTE THAT THIS SUBTRACT IS NECESSARY BECAUSE THE SWPTE                01135000
* ADDRESS IS INCREMENTED BY 8 AT LABEL, UPDTCCPD.                       01136000
**************************************************************          01137000
         SPACE                                                          01138000
         USING SWPFLAG,R15                                     @V5BC0AB 01139000
         CLR   R1,R2          DO SEGMENTS MATCH?               @VMH0020 01140000
         BNE   CCPDBUMP       NO, INCREMENT CCPD BY ONE        @VMH0020 01141000
         SPACE                                                          01142000
UPDTCCPD DS    0H                                              @V5BC0AB 01143000
         LA    R15,8(,R15)    ADDRESS THE SWAP TABLE ENTRY     @VMH0021 01144000
         ST    R5,SWPCYL      STORE CCPD IN DUPLICATE COPY OF SWPT     X01145000
                                                               @V5BC0AB 01146000
         OI    SWPFLAG,SWPRECMP+SWPCHG1 TURN ON RECOMPUTE BIT  @VMH0007 01147000
*                             AND CHANGED BIT                           01148000
CCPDBUMP DS    0H                                              @V5BC0AB 01149000
         AR    R5,R6          BUMP TO NEXT CCPD                @V5BC0AB 01150000
         LR    R14,R5         PUT CCPD IN R14                  @VMH0007 01151000
         N     R14,WHEXFF00                                    @VMH0007 01152000
         CL    R14,SAVEWRK9                                    @VMH0007 01153000
         BNH   ADDAPAGE       CYL IS STILL OK, CONTINUE        @V5BC0AB 01154000
         A     R5,HEX10000    BUMP TO NEXT CYLINDER            @V5BC0AB 01155000
         ICM   R5,B'0010',F1+3 SET PAGE NUMBER TO 1            @V5BC0AB 01156000
*                                                                       01157000
ADDAPAGE DS    0H                                              @V5BC0AB 01158000
         AL    R8,F4096       INCREASE SYSPAGNM START ADDRESS BY 1     X01159000
                              PAGE                                      01160000
         CL    R8,SAVEWRK6    OUT OF THIS SEGMENT'S PAGE RANGE @V5BC0AB 01161000
         BNL   TSPAGNM1       YES, DONE WITH THIS SHARED SEGT. @VMH0007 01162000
         LR    R1,R8          GET PAGE RANGE START ADDRESS     @VMH0016 01163000
         SRL   R1,16          LEAVE ONLY SEGMENT NUMBER        @VMH0016 01164000
         CLR   R1,R2          DID THEY MATCH?                  @VMH0007 01165000
         BE    INRANGE        GO SEE IF WITHIN SYSPAGNM RANGE  @VMH0007 01166000
         CLR   R8,R9                                           @VMH0007 01167000
         BNH   CCPDBUMP                                        @VMH0007 01168000
         B     NEXTPAGE                                        @VMH0007 01169000
INRANGE  DS    0H                                              @VMH0021 01170000
         CLR   R8,R9          OUT OF SYSPAGNM RANGE?           @V5BC0AB 01171000
         BNH   UPDTCCPD       NO, GO UPDATE NEXT SWPT ENTRY    @VMH0007 01172000
NEXTPAGE L     R2,SAVEWRK2    YES, LOAD CURRENT SYSPAGNM PTR.  @VMH0007 01173000
         LA    R2,4(,R2)      BUMP ADDRESS TO NEXT ENTRY       @V5BC0AB 01174000
         ST    R2,SAVEWRK2    SAVE CURRENT SYSPAGNM POINTER    @VMH0007 01175000
         L     R8,SAVEWRK8    GET COUNT OF SYSPAGNM ENTRIES    @V5BC0AB 01176000
         S     R8,F1          DECREMENT BY ONE                 @V5BC0AB 01177000
         ST    R8,SAVEWRK8    SAVE COUNT OF SYSPAGNM ENTRIES   @V5BC0AB 01178000
         BNZ   LOOPPAGE       GO LOOK FOR THIS SHARED SEGMENT'S PAGE   X01179000
                                                               @V5BC0AB 01180000
*                             RANGE WITHIN THE NEXT SYSPAGNM ENTRY      01181000
         B     NXSYSTEM       BRANCH IF SYSPAGNM EXHAUSTED     @V5BC0AB 01182000
TSPAGNM1 DS    0H             A SHARED SEGMENT HAS BEEN REINITIALIZED  X01183000
                                                               @V5BC0AB 01184000
         L     R15,SAVEWRK3   GET SHRPAGE POINTER              @V5BC0AB 01185000
         LA    R15,4(,R15)    BUMP POINTER TO NEXT SHRPAGE ENTRY       X01186000
                                                               @V5BC0AB 01187000
         ST    R15,SAVEWRK3   SAVE SHRPAGE POINTER             @V5BC0AB 01188000
         LA    R3,L'SYSHRSEG(R3) INDEX TO NEXT SYSHRSEG ENTRY  @V5BC0AB 01189000
         CR    R8,R9          THIS PAGNM ENTRY COMPLETE?       @V5BC0AB 01190000
         BH    NEXTPAGN       YES, GO GET NEXT SYSPAGNM POINTER        X01191000
                                                               @V5BC0AB 01192000
* THIS SYSHRSEG HAS BEEN UPDATED, BUT THIS SYSPAGNM ENTRY IS NOT        01193000
* EXHAUSTED.                                                            01194000
         A     R10,F1         ADD 1 TO NO. OF SEGS PROCESSED   @VMH0007 01195000
         C     R10,SHRSEGCT   ANY MORE SYSHRSEG ENTRIES?       @VMH0007 01196000
         BNE   GETSEGNO       PROCESS NEXT SYSHRSEG ENTRY      @VMH0007 01197000
*                                                                       01198000
         B     NXSYSTEM       BRANCH, DONE WITH THIS SYSTABLE  @V5BC0AB 01199000
*                                                                       01200000
NEXTPAGN DS    0H                                              @V5BC0AB 01201000
         L     R2,SAVEWRK2    LOAD PAGNM POINTER               @V5BC0AB 01202000
         LA    R2,4(,R2)      BUMP TO NEXT ENTRY               @V5BC0AB 01203000
*                                                                       01204000
         A     R10,F1         ADD 1 TO NO. OF SEGS PROCESSED   @VMH0007 01205000
         C     R10,SHRSEGCT   ANY MORE SYSHRSEG ENTRIES?       @VMH0007 01206000
         BNE   LOOPPAGE       PROCESS NEXT SYSHRSEG ENTRY, IF  @VMH0007 01207000
*                             THERE IS ANOTHER ONE                      01208000
NXSYSTEM DS    0H                                              @V5BC0AB 01209000
         L     R4,SAVEWRK4    GET FIRST SYSTABLE ENTRY         @V5BC0AB 01210000
         L     R7,SHRFPNT     GET NEXT SHRTABLE POINTER        @V5BC0AB 01211000
         L     R6,=A(DMKVMAS1) GET SHRTABLE ANCHOR ADDRESS     @VMH0001 01212000
         CR    R7,R6          END OF CHAIN?                    @V5BC0AB 01213000
         BNE   SYSNAMEL       NO, PROCESS ALL SHRTABLES        @V5BC0AB 01214000
         BAL   R5,UNLSNTBL    OTHERWISE, GO UNLOCK THE SNT     @V5BC0AB 01215000
         SPACE                                                          01216000
         DROP  R3,R4,R7,R15                                    @V5BC0AB 01217000
         EJECT                                                          01218000
UPMODE   DS    0H                                              @V5BC0AB 01219000
         SPACE                                                          01220000
         TM    APSTAT4,POFFLINE IS A VARY OFFLINE BEING PROCESSED?     X01221000
                                                               @V5BC0AB 01222000
         BZ    RTNMCTPR       NO, CALLED BY DMKMCTPR FOR APR   @V5BC0AB 01223000
         L     R14,SAVEWRK5   LOAD INTERNAL RETURN ADDRESS     @V5BC0AB 01224000
         BR    R14            RETURN TO INTERNAL LABEL, CPUEXIT        X01225000
                                                               @V5BC0AB 01226000
RTNMCTPR DS    0H                                              @V5BC0AB 01227000
         EXIT  RETURN         TO DMKMCTPR                      @V5BC0AB 01228000
**************************************************************          01229000
*        TRANS, LOCK, UNLOCK THE SYSTEM NAME TABLE             *        01230000
**************************************************************          01231000
GETSNTBL DS    0H                                              @V5BC0AB 01232000
         L     R1,=A(DMKSNTBL) GET ADDRESS OF THE SNT          @V5BC0AB 01233000
         TRANS 2,1,OPT=(BRING,DEFER,LOCK,SYSTEM)               @V5BC0AB 01234000
         LR    R4,R2          PUT ADDRESS OF THE SNT IN REGISTER 4     X01235000
                                                               @V5BC0AB 01236000
         ST    R4,SAVEWRK4    SAVE THE ADDRESS OF THE SNT      @V5BC0AB 01237000
         BR    R5             RETURN TO THE CALLER             @V5BC0AB 01238000
*                                                                       01239000
UNLSNTBL DS    0H                                              @V5BC0AB 01240000
         L     R2,SAVEWRK4    GET SNT ADDRESS                  @V5BC0AB 01241000
         CALL  DMKPTRUL       GO UNLOCK THE SNT                @V5BC0AB 01242000
         BR    R5             RETURN TO THE CALLER             @V5BC0AB 01243000
         EJECT                                                          01244000
         ABEND 1              VMPAGES IS NEGATIVE, TERMINATE CP        X01245000
                                                               @V5BC0AB 01246000
         ABEND 2            THE SYSTEM NAME TABLE DID NOT HAVE @V5BC0AB 01247000
*                           AN ENTRY FOR A NAME SYSTEM         @V5BC0AB 01248000
*                             DECLARES                         *        01249000
MSG044   EQU   44                                              @V5BC0AB 01250000
PAGE2314 EQU   32             PAGES/CYL FOR 2314/2319          @V5BC0AB 01251000
PAGE3330 EQU   57             PAGES/CYL FOR 3330               @V5BC0AB 01252000
PAGE3350 EQU   120            PAGES/CYL FOR 3350               @V5BC0AB 01253000
PAGE2305 EQU   24             PAGES/CYL FOR 2305/3340          @V5BC0AB 01254000
YES      EQU   C'Y'                                            @V5BC0AB 01255000
LOGICADR EQU   X'40'                                           @V5BC0AB 01256000
         DS    0D                                              @V5BC0AB 01257000
FF       EQU   X'FF'                                           @V5BC0AB 01258000
STOPPED  DC    X'00000040'    PROCESSOR IN STOPPPED STATE      @V5BC0AB 01259000
WHEXFF00 DC    X'0000FF00'                                     @V5BC0AB 01260000
HEX10000 DC    X'00010000'                                     @V5BC0AB 01261000
HEX3F    DC    X'0000003F'                                     @V5BC0AB 01262000
         DS    0F                                              @V5BC0AB 01263000
CPUMCTAF DC    A(DMKMCTAF)                                     @VMH0033 01264000
CPUDMPMA DC    A(DMKDMPMA)    PROCESSOR ADDRESS OF MAIN        @V5BC0AB 01265000
CPUDMPAA DC    A(DMKDMPAA)    ATTACHED PROCESSOR'S ADDRESS     @V5BC0AB 01266000
CPUDMPSA DC    A(DMKDMPSA)    POINTERTO PSA ADDRESSES          @V5BC0AB 01267000
CPUFREAP DC    A(DMKFREAP)    POINTER TO FREE STORAGE FOR DMKFRE       X01268000
                                                               @V5BC0AB 01269000
CPUSCHCA DC    A(DMKSCHCA)    PTR TO DMKSCH AP WAIT VALUES     @VMH0008 01270000
CPUPAGWS DC    A(DMKPAGWS)  PTR TO DMKPAG ATTACHED PROCESSOR   @VMH0012 01271000
*                          WAITSAVE VALUE                      @VMH0012 01272000
CPUCQRWS DC    A(DMKCQRWS)  PTR TO DMKCQR ATTACHED PROCESSOR   @VMH0012 01273000
*                           WAITSAVE VALUE                     @VMH0012 01274000
* THE FOLLOWING FOUR AP WAIT VALUES MUST BE CONTIGUOUS                  01275000
INITWAIT DC    X'00000078'                                     @VMH0008 01276000
OLDWAITA DC    X'FFFFFFFF'                                     @VMH0008 01277000
OLDIOWTA DC    X'FFFFFFFF'                                     @VMH0008 01278000
OLDPWTA  DC    X'FFFFFFFF'                                     @VMH0008 01279000
* THE FOLLOWING 8 BYTES MUST REMAIN CONTIGUOUS                          01280000
WAITSAV8 DC    X'7FFFFFFF'  WAITSAVE VALUE FOR THE ATTACHED    @VMH0012 01281000
         DC    X'FFFFF000'  PROCESSOR                          @VMH0012 01282000
EXTNBITS DC    X'831F'        ALL EXTERNAL BITS EXCEPT MFA     @V5BC0AB 01283000
MFAESEXT DC    X'0FFF'  USED TO DISABLE MALFUNCTION ALERT,     @VMH0029 01284000
*                       EMERGENCY SIGNAL, EXTERNAL SIGNAL AND TOD CLOCK 01285000
*                       SYNC CHECK INTERRUPTS                           01286000
***************************************************************         01287000
*                             MESSAGES                         *        01288000
***************************************************************         01289000
CPU21EMG DC    X'151515'                                       @V5BC0AB 01290000
         DC    C'DMKCPU021E RADDR MISSING OR INVALID'          @V5BC0AB 01291000
         DC    X'1515'                                         @V5BC0AB 01292000
CPU21ELN EQU   *-CPU21EMG                                      @V5BC0AB 01293000
*                                                                       01294000
CPU193MG DC    X'151515'                                       @V5BC0AB 01295000
         DC    C'DMKCPU193I PROCESSOR '                        @V5BC0AB 01296000
CPUID193 DC    C'  '                                           @V5BC0AB 01297000
         DC    C' ONLINE'                                      @V5BC0AB 01298000
         DC    X'1515'                                         @V5BC0AB 01299000
CPU193LN EQU   *-CPU193MG                                      @V5BC0AB 01300000
*                                                                       01301000
CPU192MG DC    X'151515'                                       @V5BC0AB 01302000
         DC    C'DMKCPU192E VARY PROCESSOR COMMAND FAILED'     @V5BC0AB 01303000
         DC    X'1515'                                         @V5BC0AB 01304000
CPU192LN EQU   *-CPU192MG                                      @V5BC0AB 01305000
*                                                                       01306000
CPU191MG DC    X'151515'                                       @V5BC0AB 01307000
         DC    C'DMKCPU191E PROCESSOR '                        @V5BC0AB 01308000
CPUID191 DC    C'  '                                           @V5BC0AB 01309000
         DC    C' DOES NOT EXIST'                              @V5BC0AB 01310000
         DC    X'1515'                                         @V5BC0AB 01311000
CPU191LN EQU   *-CPU191MG                                      @V5BC0AB 01312000
*                                                                       01313000
CPU194MG DC    X'151515'                                       @V5BC0AB 01314000
         DC    C'DMKCPU194I PROCESSOR '                        @V5BC0AB 01315000
CPUID194 DC    C'  '                                           @V5BC0AB 01316000
         DC    C' OFFLINE'                                     @V5BC0AB 01317000
         DC    X'1515'                                         @V5BC0AB 01318000
CPU194LN EQU   *-CPU194MG                                      @V5BC0AB 01319000
*                                                                       01320000
         LTORG                                                          01321000
         EJECT                                                          01322000
         COPY  SHRTABLE                                                 01323000
         COPY  SYSTBL                                                   01324000
         PSA                                                            01325000
         COPY  CORE                                                     01326000
         COPY  DEVTYPES                                                 01327000
         COPY  RBLOKS                                                   01328000
         COPY  VBLOKS                                                   01329000
         COPY  ALLOC                                                    01330000
         COPY  EQU                                                      01331000
         COPY  SAVE                                                     01332000
         COPY  VMBLOK                                                   01333000
         COPY  TIMER                                                    01334000
         COPY  MCHAREA                                                  01335000
         END                                                            01336000