LNK      TITLE 'DMKLNK     (CP)        VM/370 - RELEASE 6'              00001000
         ISEQ  73,80          VALIDATE SEQUENCING OF SYSIN              00002000
*.                                                                      00003000
* MODULE NAME -                                                         00004000
*                                                                       00005000
*        DMKLNK                                                         00006000
*                                                                       00007000
* CONTENTS -                                                            00008000
*                                                                       00009000
*        DMKLNKIN - COMMAND TO LINK TO A VIRTUAL DEVICE                 00010000
*        DMKLNKSB - LINK SUBROUTINE ENTRY POINT                         00011000
*        DMKEPSWD - SUBROUTINE TO ENTER A PASSWORD                      00012000
         EJECT                                                          00013000
* SUBROUTINE NAME -                                                     00014000
*                                                                       00015000
*        DMKLNKIN - LINK TO A VIRTUAL DEVICE                            00016000
*                                                                       00017000
* FUNCTION -                                                            00018000
*                                                                       00019000
*        TO LINK TO A VIRTUAL DASD DEVICE (IF FEASIBLE)                 00020000
*                                                                       00021000
* COMMAND LINE FORMAT -                                                 00022000
*                                                                       00023000
*    +--------+-------------------------------------------------------+ 00024000
*    |  LINK  | <TO>  USERID | *  XXX  <AS>  YYY  <MODE>  <PASSWORD>  | 00025000
*    +--------+-------------------------------------------------------+ 00026000
*                                                                       00027000
*        SEE "NOTES" FOR FURTHER INFORMATION ON COMMAND LINE FORMAT.    00028000
*                                                                       00029000
* ATTRIBUTES -                                                          00030000
*                                                                       00031000
*        REENTRANT, PAGEABLE, CALLED VIA SVC                            00032000
*                                                                       00033000
* ENTRY POINTS -                                                        00034000
*                                                                       00035000
*        DMKLNKIN - COMMAND TO LINK TO A VIRTUAL DEVICE                 00036000
*        DMKLNKSB - LINK SUBROUTINE ENTRY POINT                         00037000
*                                                                       00038000
* ENTRY CONDITIONS -                                                    00039000
*                                                                       00040000
*     DMKLNKIN ENTRY POINT:                                             00041000
*        GPR  9 CONTAINS ADDRESS OF COMMAND BUFFER                      00042000
*                                                                       00043000
*     DMKLNKSB ENTRY POINT:                                             00044000
*        GPR0-1 HOLD USERID TO WHOM DASD DEVICE BELONGS                 00045000
*        GPR 2 HOLDS LINK-TO DEVICE (IN BINARY)                         00046000
*        GPR 3 HOLDS LINK-AS DEVICE (IN BINARY)                         00047000
*        GPR 4 = ADDRESS OF UDEVBLOK (AT LEAST 9 DBL-WORDS)             00048000
*        GPR 5 = INDEXER FOR DESIRED LINK-MODE (0, ..., 24)             00049000
*                                                                       00050000
*     BOTH ENTRY POINTS:                                                00051000
*        GPR 11 = ADDRESS OF USER'S VMBLOK                              00052000
*        GPR 12 = ADDRESS OF DMKLNKIN                                   00053000
*        GPR 13 = ADDRESS OF STANDARD SAVE AREA                         00054000
*                                                                       00055000
* EXIT CONDITIONS -                                                     00056000
*                                                                       00057000
*        GPR2 = 0 IF LINK WAS MADE AS REQUESTED                         00058000
*        GPR2 = 101 TO 103 IF A "FORCED R/O" LINK WAS GIVEN             00059000
*        GPR2 = OTHER ERROR CODES IF NO LINK WAS GIVEN                  00060000
*               (SEE ERROR MESSAGES)                                    00061000
*                                                                       00062000
*        NOTE:  GPR  2 = 115 (WITH ERROR MESSAGE) IF A LINK COMMAND     00063000
*               HAS BEEN ISSUED AN EXCESSIVE NUMBER OF TIMES IN ONE     00064000
*               TERMINAL SESSION FROM A VIRTUAL MACHINE WITH AN         00065000
*               INCORRECT PASSWORD INCLUDED IN THE COMMAND LINE.        00066000
*               IF SECURITY JOURNALING IS ON, GPR 2 = 115 IF A          00066200
*               LINK COMMAND HAS BEEN ISSUED AN EXCESSIVE               00066400
*               NUMBER OF TIMES IN ONE TERMINAL SESSION WITH            00066600
*               AN INCORRECT PASSWORD.                                  00066800
*                        (SEE DMKLNK115E ERROR MESSAGE)                 00067000
         EJECT                                                          00068000
* CALLS TO OTHER ROUTINES -                                             00069000
*                                                                       00070000
*        DMKFREE  - OBTAIN FREE STORAGE                                 00071000
*        DMKSCNFD - GET NEXT FIELD FROM COMMAND LINE                    00072000
*        DMKUDRFU - FIND USER IN CP DIRECTORY                           00073000
*        DMKUDRFD   FIND USERID XXX DEVICE                              00074000
*        DMKLOCK  - LOCK USERID BRIEFLY                                 00075000
*        DMKLOCKD - UNLOCK USERID                                       00076000
*        DMKUDRRV - RELEASE VIRTUAL PAGES USED BY DMKUDR ROUTINES       00077000
*        DMKCVTHB - CONVERT INPUT FIELD FROM HEX TO BINARY              00078000
*        DMKCVTBH - XXX OR YYY DEVICE FROM BINARY TO HEX                00079000
*        DMKCVTBD - NNN USERS FROM BINARY TO DECIMAL                    00080000
*        DMKSCNVS - FIND VOLUME SERIAL NUMBER                           00081000
*        DMKSCNAU - FIND VMBLOK OF ACTIVE USER                          00082000
*        DMKSCNVU - FIND BLOCKS FOR VIRTUAL DEVICE                      00083000
*        DMKVDREL - RELEASE A VIRTUAL DEVICE                            00084000
*        DMKSCNLI - FIND ALL LINKS TO A GIVEN MINIDISK                  00085000
*        DMKEPSWD - ENTER PASSWORD                                      00086000
*        DMKQCNWT - SEND MESSAGE TO USER TERMINAL                       00087000
*        DMKFRET  - RETURN FREE STORAGE                                 00088000
*        DMKVDSLK - ESTABLISH READ OR WRITE LINK TO GIVEN DISK          00089000
*        DMKERMSG - CONSTRUCT & SEND ERROR MESSAGE TO USER              00090000
*        DMKSCNVN - TO GET MNEMONIC NAME OF VIRTUAL DEVICE              00091000
*                                                                       00092000
* EXTERNAL REFERENCES -                                                 00093000
*                                                                       00094000
*        NONE                                                           00095000
*                                                                       00096000
* TABLES / WORK AREAS -                                                 00097000
*                                                                       00098000
*        DECISION TABLES (INTERNAL TO DMKLNK).                          00099000
*                                                                       00100000
* REGISTER USAGE -                                                      00101000
*                                                                       00102000
*        GPR  4 = POINTER TO USER DIRECTORY BLOCK / DEVICE BLOCK        00103000
*        GPR  5 = ADDRESS OF DECISION-TABLE ENTRY                       00104000
*        GPR  8 = ADDRESS OF VDEVBLOK / WORK REGISTER                   00105000
*        GPR  9 = ADDRESS OF COMMAND BUFFER / ADDRESS OF RDEVBLOK       00106000
*        GPR 10 = RETURN-REGISTER FOR INTERNAL SUBROUTINE               00107000
*        GPR 11 = VMBLOK ADDRESS                                        00108000
*        GPR 12 = BASE REGISTER                                         00109000
*        GPR 13 = ADDRESS OF STANDARD SAVE AREA                         00110000
*                                                                       00111000
*        GPRS 0-3, 6-7, AND 14-15 ARE WORK REGISTERS.                   00112000
         EJECT                                                          00113000
* NOTES -                                                               00114000
*                                                                       00115000
*      USERID  SPECIFIES THE NAME OF THE USER WHOSE DIRECTORY IS TO     00116000
*              BE SEARCHED FOR DEVICE XXX.  AN '*' MAY BE USED TO       00117000
*              SPECIFY THAT A USER IS LINKING TO ONE OF HIS OWN DISKS.  00118000
*                                                                       00119000
*      XXX     SPECIFIES THE VIRTUAL DEVICE ADDRESS TO BE LINKED TO     00120000
*                                                                       00121000
*      YYY     SPECIFIES THE VIRTUAL ADDRESS TO WHICH THE DEVICE IS     00122000
*              TO BE ASSIGNED.                                          00123000
*                                                                       00124000
*      MODE    SPECIFIES THE PRIMARY ACCESS REQUESTED (READ/ONLY,       00125000
*              WRITE, OR MULTIPLE), AND THE ALTERNATE ACCESS            00126000
*              (READ/ONLY OR WRITE) DESIRED (IF ANY), AS FOLLOWS:       00127000
*                                                                       00128000
*      R       SPECIFIES THAT READ/ONLY (R/O) ACCESS IS REQUESTED.      00129000
*              THE LINK WILL NOT BE GIVEN IF ANY OTHER USER HAS THE     00130000
*              DISK IN WRITE STATUS.  "R" IS THE DEFAULT MODE IF THE    00131000
*              LINK IS TO ANOTHER USERID.                               00132000
*                                                                       00133000
*      RR      SPECIFIES THAT READ/ONLY ACCESS IS REQUESTED, EVEN IF    00134000
*              ANOTHER USER HAS THE DISK IN WRITE STATUS.               00135000
*                                                                       00136000
*      W       SPECIFIES THAT WRITE ACCESS IS REQUESTED.  THE LINK WILL 00137000
*              NOT BE GIVEN IF ANY OTHER USER HAS THE DISK IN READ OR   00138000
*              WRITE STATUS.                                            00139000
*                                                                       00140000
*      WR      SPECIFIES THAT WRITE ACCESS IS REQUESTED IF NO OTHER     00141000
*              USER HAS THE DISK IN READ OR WRITE STATUS, BUT THAT AN   00142000
*              ALTERNATE ACCESS OF READ/ONLY IS ACCEPTABLE IF OTHER(S)  00143000
*              DO HAVE A LINK TO THE DISK; IN THIS EVENT, A READ/ONLY   00144000
*              LINK IS TO BE GIVEN;  THIS IS ACCOMPANIED BY AN ERROR 1  00145000
*              OR 2, AND THE 'DEV XXX FORCED R/O' MESSAGE.              00146000
*                                                                       00147000
*      M       SPECIFIES THAT "MULTIPLE" ACCESS IS REQUESTED.  THIS     00148000
*              MEANS THAT A WRITE LINK IS TO BE GIVEN TO THE DISK       00149000
*              UNLESS ANOTHER USER ALREADY HAS WRITE ACCESS TO IT,      00150000
*              IN WHICH EVENT NO LINK IS TO BE GIVEN.                   00151000
*                                                                       00152000
*      MR      SPECIFIES THAT A WRITE LINK IS TO BE GIVEN TO THE DISK   00153000
*              UNLESS ANOTHER USER ALREADY HAS WRITE ACCESS TO IT;      00154000
*              IN THIS EVENT, A READ-LINK IS TO BE GIVEN, WITH AN       00155000
*              ERROR 1 OR 2, AND THE 'DEV XXX FORCED R/O' MESSAGE.      00156000
*                                                                       00157000
*      MW      SPECIFIES THAT A WRITE LINK IS TO BE GIVEN TO THE DISK   00158000
*              IN ANY EVENT.                                            00159000
*                                                                       00160000
*              IF THE MODE IS OMITTED FROM THE COMMAND LINE, THE        00161000
*              DEFAULT IS TO "R" IF THE USERID IS ANOTHER USER;         00162000
*              IF THE USER IS LINKING TO ONE OF HIS OWN DISKS,          00163000
*              THE DEFAULT IS THE "USER ACCESS MODE" OF EITHER          00164000
*              'R', 'W', OR 'M' IN THE CP DIRECTORY FOR HIS DISKS.      00165000
         EJECT                                                          00166000
* NOTES (CONTINUED) -                                                   00167000
*                                                                       00168000
*      PASSWORD  SPECIFIES A ONE TO EIGHT CHARACTER STRING WHICH MUST   00169000
*              MATCH THAT FOR THE SPECIFIED ACCESS MODE FOR DEVICE      00170000
*              "XXX" IN THE DIRECTORY FOR USER "USERID".  THE PASSWORD  00171000
*              (IF PRESENT) IS THE LAST OPERAND ON THE COMMAND LINE,    00172000
*              AND MUST NOT BE ANY OF THE SPECIFIED MODE OPTIONS        00173000
*              (R, RR, W, WR, M, MR, OR MW)                             00174000
*                                                                       00175000
*        THE PASSWORD (IF INCLUDED ON THE COMMAND LINE) MAY BE PRECEDED 00176000
*        BY THE STRING "PASS= " IF DESIRED, BUT THIS IS NOT NECESSARY.  00177000
*        NOTE:  THE PASSWORD MAY NOT BE INCLUDED ON THE COMMAND         00177150
*        LINE IF THE PASSWORD SUPPRESSION FACILITY HAS BEEN             00177300
*        SYSGENED AND THE COMMAND CAME FROM CP OR FROM A VM             00177450
*        WHICH REQUESTED PASSWORD SUPPRESSION (VMNPWOCL BIT             00177600
*        IN VMBLOK VMFSTAT).                                            00177750
*                                                                       00178000
*                                                                       00179000
*                                                                       00180000
* OPERATION -                                                           00181000
*                                                                       00182000
*        1.  IF THE "LINK" WAS EXECUTED AS A VIRTUAL CONSOLE FUNCTION,  00183000
*        CHECKS TO SEE IF TOO MANY WRONG PASSWORDS HAVE BEEN ENTERED;   00184000
*        IF YES, EXITS IMMEDIATELY WITH RETURN CODE 115 AND A MESSAGE   00185000
*        INDICATING THAT THE CP LINK COMMAND IS INVALID BECAUSE AN      00186000
*        EXCESSIVE NUMBER OF INCORRECT PASSWORDS HAVE BEEN ENTERED.     00187000
*        IF NO PROBLEM, CALLS DMKFREE TO OBTAIN FREE STORAGE FOR USE    00188000
*        FOR USER DIRECTORY/DEVICE BLOCKS, AND FOR FILLED-IN MESSAGES.  00189000
*        THEN CALLS DMKSCNFD TO GET USERID FIELD (ERROR IF MORE         00190000
*        THAN 8 CHARACTERS, OR IF OMITTED.)  IF USERID FIELD IS '* ',   00191000
*        SETS FLAG INDICATING THAT THE USERID IS "MYSELF", AND          00192000
*        OBTAINS THE 8-BYTE USERID FROM THE USER'S VMBLOK.              00193000
*                                                                       00194000
*        2.  CALLS DMKUDRFU TO FIND THE USERID IN THE CP DIRECTORY      00195000
*        (ERROR IF NOT FOUND), AND TO OBTAIN A COPY OF THE USER         00196000
*        DIRECTORY BLOCK.  CALLS DMKSCNFD TO GET THE XXX DEVICE         00197000
*        (ERROR IF OMITTED), AND DMKCVTHB TO CONVERT TO BINARY (ERROR   00198000
*        IF NOT A HEX NUMBER OR IF GREATER THAN X'FFF').  ALSO CALLS    00199000
*        DMKSCNFD AND DMKCVTHB TO OBTAIN AND CONVERT YYY FIELD (ERROR   00200000
*        IF OMITTED, OR NOT A VALID HEX NUMBER, OR GREATER THAN         00201000
*        X'5FF' FOR BC MODE VIRTUAL MACHINE, OR GREATER THAN X'FFF'     00202000
*        FOR EC MODE VIRTUAL MACHINE).  THEN DMKUDRFD IS                00203000
*        CALLED TO FIND THE USER DEVICE BLOCK FOR THE GIVEN DEVICE      00204000
*        (AN ERROR MESSAGE AND CODE BEING RETURNED IF NOT FOUND).       00205000
*                                                                       00206000
*        3.  CALLS DMKSCNFD TO SEE IF THERE ARE ANY MORE FIELDS ON THE  00207000
*        INPUT LINE.  IF NOT, DEFAULTS THE ACCESS REQUESTED TO 'R' IF   00208000
*        THE USERID WAS NOT "MYSELF".  (IF THE USERID WERE "MYSELF",    00209000
*        THE ACCESS REQUESTED DEFAULTS TO THE "USER ACCESS MODE"        00210000
*        IN THE USER DEVICE BLOCK.)  NOW GOES TO STEP 7 BELOW.          00211000
*                                                                       00212000
*        4.  IF ANOTHER FIELD IS PRESENT, CHECKS FOR ONE BYTE IN        00213000
*        LENGTH, WITH A VALUE OF 'R', 'W', OR 'M';  OR TWO BYTES        00214000
*        IN LENGTH, WITH A VALUE OF 'RR', 'WR', 'MR', OR 'MW'.          00215000
*        IF IT IS NONE OF THE ABOVE, IT USES THE DEFAULT ACCESS         00216000
*        MODE AS IN STEP 3, AND GOES TO STEP 5.  IF IT IS ONE OF        00217000
*        THESE REQUESTED ACCESS MODES, SETS AN INDICATOR AS NEEDED      00218000
*        FOR LATER USE, AND CALLS DMKSCNFD TO CHECK FOR ANOTHER         00219000
*        FIELD PRESENT;  IF YES, GO TO STEP 5;  IF NOT, TO STEP 7.      00220000
*                                                                       00221000
*        5.  IF AN ADDITIONAL FIELD IS PRESENT, IT IS CONSIDERED        00222000
*        TO BE A PASSWORD PROVIDED BY THE CALLER.                       00223000
         EJECT                                                          00224000
*        6.  IN THIS CASE, THE PRESENCE AND VALUE OF THE PASSWORD       00225000
*        ARE REMEMBERED FOR FUTURE HANDLING.                            00226000
*                                                                       00227000
*        7.  IF ALL OF THE ABOVE HAVE BEEN SUCCESSFUL, THE DEVICE FOUND 00228000
*        IS CHECKED.  IF THE DEVICE IS NOT A DISK, OR IF IT IS A T-DISK 00229000
*        OR DEDICATED, AN ERROR MESSAGE AND ERROR CODE ARE RETURNED.    00230000
*        IF OK, CALLS DMKSCNVS TO MAKE SURE THE REQUIRED VOLUME IS      00231000
*        ONLINE (ERROR IF NOT).  IF THE USER IS NOT "MYSELF", CHECKS    00232000
*        FOR THE USERID ACTIVE (VIA DMKSCNAU), AND IF SO WHETHER HE     00233000
*        IS IN THE "LOGON" PROCESS - ERROR RETURN IF YES.               00234000
*                                                                       00235000
*        8.  DMKSCNVU IS NOW CALLED TO SEE IF ANY DEVICE WITH THE       00236000
*        YYY ADDRESS IS CURRENTLY ONLINE FOR THE USER.  IF NOT, GOES    00237000
*        DIRECTLY TO STEP 9.  IF YES, CHECKS THE POINTER TO THE REAL    00238000
*        DEVICE BLOCK AND THE RELOCATION FACTOR TO SEE IF IT IS THE     00239000
*        SAME DEVICE AS THAT FOR WHICH THE LINK IS DESIRED.             00240000
*        IF NOT THE SAME, AN ERROR RETURN AND MESSAGE ARE GIVEN.        00241000
*        IF IT IS THE SAME DEVICE (PRESUMABLY WITH A DIFFERENT LINK-    00242000
*        MODE DESIRED), THEN DMKVDBRL IS CALLED TO RELEASE THE OLD      00243000
*        VIRTUAL DEVICE BEFORE PROCEEDING TO STEP 9.                    00244000
*                                                                       00245000
*        9.  AN INTERNAL SUBROUTINE IS NOW CALLED TO DETERMINE WHETHER  00246000
*        A READ- OR WRITE-LINK TO THE DESIRED DISK IS FEASIBLE.  FIRST  00247000
*        DMKUDRLK IS CALLED TO BRIEFLY LOCK THE GIVEN USERID;  THEN     00248500
*        DMKSCNLI IS CALLED TO DETERMINE HOW MANY READ- AND WRITE LINKS 00249000
*        (IF ANY) TO THE GIVEN DISK CURRENTLY EXIST.  THEN A DECISION   00249500
*        TABLE (READILY REVISED PER INSTALLATION REQUIREMENTS) IS USED  00250000
*        TO DETERMINE THE FEASIBILTY OF ESTABLISHING A LINK, BASED ON   00250500
*        THE FOLLOWING INPUT CONDITIONS.                                00251000
*              WRITE LINK(S), READ LINK(S), OR NO LINKS CURRENTLY EXIST 00255000
*                                                                       00256000
*              ACCESS REQUESTED (EITHER DEFAULT VALUE OR SPECIFIED)     00257000
*              WAS 'R', 'RR', 'W', 'WR', 'M', 'MR', OR 'MW'.            00258000
*                                                                       00259000
*              THE USER ACCESS MODE (IF USER = MYSELF), OR THE          00260000
*              AVAILABLE PASSWORD(S) IN USER DEVICE BLOCK.              00261000
*                                                                       00262000
*        IF THE DECISION IS THAT A LINK IS IMPOSSIBLE, EXIT IS MADE TO  00263000
*        TO THE CALLER (VIA STEP 13), WITH A SUITABLE ERROR MESSAGE     00264000
*        AND ERROR CODE (FOR EXAMPLE, IF THE OWNER OF THE DISK PROVIDED 00265000
*        NO LINK PRIVILEGES AT ALL).  OTHERWISE, CONTINUE TO NEXT STEP. 00266000
*                                                                       00267000
*        10.  ON RETURN FROM THE INTERNAL SUBROUTINE, A CHECK IS NOW    00268000
*        MADE AS TO WHETHER A PASSWORD IS REQUIRED TO BE ENTERED,       00269000
*        AND IF SO WHETHER A READ-, WRITE-, OR MULT-PASSWORD.  IF       00270000
*        NO PASSWORD IS REQUIRED, PROCEEDS IMMEDIATELY TO STEP 12.      00271000
*        IF THE PASSWORD WAS REQUIRED BUT WAS PROVIDED ON THE COMMAND   00272000
*        LINE, IT IS NOW CHECKED;  IF CORRECT GO TO STEP 12;  IF WRONG, 00273000
*        GIVE ERROR MESSAGE AND CODE, AND IF THE PASSWORD WAS INCLUDED  00274000
*        ON THE COMMAND LINE OF A LINK ISSUED AS A VIRTUAL CONSOLE      00275000
*        FUNCTION, INCREMENTS THE COUNT OF INCORRECT PASSWORDS IN THE   00276000
*        VMBLOK.  (IF A LINK IS SUBSEQUENTLY ISSUED FROM A VIRTUAL      00277000
*        MACHINE DURING THE SAME TERMINAL SESSION, IT WILL BE REJECTED  00278000
*        AS AN INVALID COMMAND AS INDICATED ABOVE IN STEP 1.)           00279000
         EJECT                                                          00280000
*        11.  IF A PASSWORD IS REQUIRED AND IS NOT AVAILABLE,           00281000
*        DMKUDRUL IS CALLED TO UNLOCK THE USERID (LEFT FROM STEP 9),    00282110
*        AND DMKEPSWD IS THEN CALLED TO HAVE THE USER ENTER THE         00283000
*        READ-, WRITE-, OR MULT-PASSWORD, AND CHECK IT.  IF             00284000
*        INCORRECT, EXITS WITH MESSAGE AND ERROR-CODE.  IF              00285000
*        CORRECT, CALLS INTERNAL SUBROUTINE AGAIN AS IN STEP 9,         00286000
*        AND UPON SUCCESSFUL RETURN CONTINUES TO STEP 12,               00287000
*        OR IF UNSUCCESSFUL, GOES TO STEP 13.                           00288000
*        12.  IF ALL ABOVE STEPS HAVE SUCCEEDED, CALL DMKVDSLK TO       00289500
*        ESTABLISH A READ- OR WRITE-LINK (AS DETERMINED BY THE          00290000
*        DECISION TABLE) TO THE GIVEN DISK, AND IMMEDIATELY             00290500
*        CALLS DMKLOCKDTO UNLOCK THE DIRECTORY.                         00291000
*        IF DMKVDS RETURNS AN ERROR CODE 32 IN REGISTER 2,              00291100
*        DMKLNK WILL FIRST UNLOCK ANY LOCKED USERID(S) AND              00291200
*        THEN ISSUE ERROR MESSAGE DMKLNK119E.                           00291300
*        13.  FINALLY, TYPES ANY RESPONSE OR ERROR MESSAGE WHICH IS TO  00295000
*        BE SENT TO THE CALLER, CALLS DMKFRET TO RETURN THE FREE        00296000
*        STORAGE WHICH WAS USED (UNLESS THE LINK SUBROUTINE WAS INVOKED 00297000
*        VIA THE DMKLNKSB ENTRY POINT), AND RETURNS THE ERROR-CODE TO   00298000
*        THE CALLER IN GPR 2.  ALL PROCESSING IS NOW COMPLETE.          00299000
*                                                                       00300000
*        14.  FOR THE LINK SUBROUTINE ENTRY POINT (DMKLNKSB) - CALLED   00301000
*        BY "LOGON" TO ESTABLISH A LINK TO A DASD DEVICE IN THE USER'S  00302000
*        DIRECTORY - THE INPUT CONDITIONS ARE STORED FOR USE BY THE     00303000
*        GENERAL LINK LOGIC, A FLAG IS SET TO INDICATE THAT THE LINK    00304000
*        SUBROUTINE WAS INVOKED (USED WHEREVER NECESSARY IN THE ABOVE-  00305000
*        DESCRIBED LOGIC), AND THE NORMAL LINK LOGIC ENTERED AT STEP 7. 00306000
         EJECT                                                          00307000
* MESSAGES -                                                            00308000
*                                                                       00309000
*        NOTES:  "USERID" GENERALLY DENOTES A SPECIFIC FILLED-IN USERID 00310000
*                (E.G. "JONES")                                         00311000
*                                                                       00312000
*             "XXX" OR "YYY" IS THE HEX VALUE (FILLED IN IF VALID) OF   00313000
*             THE "XXX" OR "YYY" DEVICE SPECIFIED IN THE COMMAND LINE.  00314000
*                                                                       00315000
*             "NNN" DENOTES A FILLED-IN DECIMAL NUMBER.                 00316000
*                                                                       00317000
*        IN THE RESPONSES AND ERROR MESSAGES WHERE "R/W BY NNN USERS"   00318000
*        IS NORMALLY SPECIFIED, IF THE "NNN" IS SPECIFICALLY 001,       00319000
*        THE USERID OF THE ONE USER IS GIVEN INSTEAD OF "NNN USERS".    00320000
*                                                                       00321000
* PROMPTING MESSAGES (FROM DMKEPSWD):                                   00322000
*                                                                       00323000
*        'ENTER READ PASSWORD'                                          00324000
*        'ENTER WRITE PASSWORD'                                         00325000
*        'ENTER MULT PASSWORD'                                          00326000
*                                                                       00327000
* RESPONSES:                                                            00328000
*                                                                       00329000
*     MESSAGES GIVEN IF LINK WAS ESTABLISHED AS                         00330000
*     REQUESTED, AND IF LINK WAS ISSUED IN CP MODE                      00331000
*     (OMITTED IF LINK WAS ISSUED FROM VIRTUAL MACHINE):                00332000
*                                                                       00333000
*        'DASD YYY LINKED R/O'                                          00334000
*                                                                       00335000
*        'DASD YYY LINKED R/W'                                          00336000
*                                                                       00337000
*     MESSAGES GIVEN IF THE LINK WAS ESTABLISHED AS REQUESTED,          00338000
*     BUT OTHER USER(S) ARE ALSO LINKED TO THE SAME DEVICE:             00339000
*                                                                       00340000
*        'DASD YYY LINKED R/O; R/W BY NNN USERS'                        00341000
*                                                                       00342000
*        'DASD YYY LINKED R/O; R/W BY NNN USERS; R/O BY NNN USERS'      00343000
*                                                                       00344000
*        'DASD YYY LINKED R/W; R/O BY NNN USERS'                        00345000
*                                                                       00346000
*        'DASD YYY LINKED R/W; R/W BY NNN USERS'                        00347000
*                                                                       00348000
*        'DASD YYY LINKED R/W; R/W BY NNN USERS; R/O BY NNN USERS'      00349000
         EJECT                                                          00350000
* MESSAGES (CONTINUED):                                                 00351000
*                                                                       00352000
* ERROR MESSAGES:                                                       00353000
* ---------------------------------------------------------             00354000
* DMKLNK020E USERID MISSING OR INVALID                                  00355000
*                                                                       00356000
* DMKLNK022E VADDR MISSING OR INVALID                                   00357000
*                                                                       00358000
* DMKLNK052E ERROR IN CP DIRECTORY                                      00359000
*                                                                       00360000
* DMKLNK053E USERID NOT IN CP DIRECTORY                                 00361000
*                                                                       00362000
* DMKLNK101W DASD YYY FORCED R/O; R/O BY NNN USERS                      00363000
*                                                                       00364000
* DMKLNK102W DASD YYY FORCED R/O; R/W BY NNN USERS                      00365000
*                                                                       00366000
* DMKLNK103W DASD YYY FORCED R/O; R/W BY NNN USERS; R/O BY NNN USERS    00367000
*                                                                       00368000
* DMKLNK104E USERID XXX NOT LINKED; R/O BY NNN USERS                    00369000
*                                                                       00370000
* DMKLNK105E USERID XXX NOT LINKED; R/W BY NNN USERS                    00371000
*                                                                       00372000
* DMKLNK106E USERID XXX NOT LINKED; R/W BY NNN USERS; R/O BY NNN USERS  00373000
*                                                                       00374000
* DMKLNK107E USERID XXX NOT LINKED; NOT IN CP DIRECTORY                 00375000
*                                                                       00376000
* DMKLNK108E USERID XXX NOT LINKED; VOLID DSKLAB NOT MOUNTED            00377000
*                                                                       00378000
* DMKLNK109E USERID XXX NOT LINKED; INVALID LINK DEVICE                 00379000
*                                                                       00380000
* DMKLNK110E USERID XXX NOT LINKED; DEV YYY ALREADY DEFINED             00381000
*                                                                       00382000
* DMKLNK111E USERID XXX NOT LINKED; NO READ PASSWORD                    00383000
*                                                                       00384000
* DMKLNK112E USERID XXX NOT LINKED; NO WRITE PASSWORD                   00385000
*                                                                       00386000
* DMKLNK113E USERID XXX NOT LINKED; NO MULT PASSWORD                    00387000
*                                                                       00388000
* DMKLNK114E USERID XXX NOT LINKED; PASSWORD INCORRECT                  00389000
*                                                                       00390000
* DMKLNK115E LINK INVALID; EXCESSIVE INCORRECT PASSWORDS                00391000
*                                                                       00392000
* DMKLNK116E USERID XXX NOT LINKED; CP DIRECTORY IN USE                 00393000
*                                                                       00394000
* DMKLNK117E USERID XXX NOT LINKED; VOLID DSKLAB CONFLICT               00395000
*                                                                       00395030
* DMKLNK118E USERID XXX NOT LINKED; COMMAND FORMAT NOT VALID            00395060
*                                                                       00395100
* DMKLNK119E USERID XXX NOT LINKED; INSUFFICIENT FREE STORAGE           00395200
*                                                                       00396000
* DMKLNK137E DASD YYY NOT LINKED; CHAN XX DEDICATED                     00397000
*.                                                                      00398000
*   CODING NOTE:  THE RESPONSES AND ERROR MESSAGES 101-114 AND 116-117  00399000
*              ARE ISSUED DIRECTLY BY THE DMKLNK MODULE (VIA DMKQCNWT); 00400000
*              FOR ALL OTHER ERROR MESSAGES, THE DMKERM ERROR MODULE    00401000
*              IS INVOKED TO CONSTRUCT AND ISSUE THE MESSAGE.           00402000
         EJECT                                                          00403000
*********************************************************************** 00404000
*                                                                       00405000
*    LINK   USERID | *   XXX   YYY   < MODE >   < PASSWORD >            00406000
*                                                                       00407000
*                            OR                                         00408000
*                                                                       00409000
*    LINK   USERID | *   XXX   YYY   < MODE >   < PASS= PASSWORD >      00410000
*                                                                       00411000
*********************************************************************** 00412000
         SPACE                                                          00413000
*        "DTBL" = DECISION-TABLE MACRO:                                 00414000
*                 &OPTIONS = FLAG-BITS USED FOR DECISION-TABLE LOGIC    00415000
*                 &LNKMODE = ACCESS PERMITTED PER UDEVMODE OF UDEVBLOK  00416000
*                 &JUMPADD = S-CONSTANT "JUMP-ADDRESS" TO CORRECT CODE  00417000
         MACRO                                                          00418000
&LABEL   DTBL  &OPTIONS,&LNKMODE,&JUMPADD                               00419000
&LABEL   DC    AL1(&OPTIONS) - 0                                        00420000
         DC    AL1(&LNKMODE) - 1                                        00421000
         DC    S(&JUMPADD) - 2                                          00422000
         SPACE                                                          00423000
         MEND                                                           00424000
         SPACE                                                          00425000
*        "LMSG" = MACRO TO PRODUCE ERROR-CODE, LENGTH, & MESSAGE:       00426000
         MACRO                                                          00427000
&LABEL   LMSG  &N,&MESSAGE                                              00428000
&LABEL   DC    AL1(&N),AL1(L'M&SYSNDX)                                  00429000
M&SYSNDX DC    C&MESSAGE                                                00430000
         MEND                                                           00431000
         EJECT                                                          00432000
         COPY  OPTIONS                                                  00433000
         COPY  LOCAL                                                    00434000
         EJECT                                                          00435000
DMKLNK   CSECT                                                          00436000
         SPACE                                                          00437000
         DC    CL8'DMKLNK'    MODULE IDENTIFIER                         00438000
         SPACE                                                          00439000
         SPACE                                                          00440000
         EXTRN DMKLOCK        USERID LOCK                               00441000
         EXTRN DMKLOCKD       USERID UNLOCK                             00442000
         EXTRN DMKUDRFU       FIND USER                                 00443000
         EXTRN DMKUDRFD       FIND DEVICE                               00444000
         EXTRN DMKUDRRV       RETURN VIRTUAL PAGE                       00445000
         EXTRN DMKCFPRD                                        @VA04747 00445500
         SPACE                                                          00446000
         EXTRN DMKCVTHB,DMKCVTBH,DMKCVTBD                               00447000
         EXTRN DMKQCNRD                                                 00448000
         EXTRN DMKSCNAU,DMKSCNFD,DMKSCNLI,DMKSCNVS,DMKSCNVU             00449000
         EXTRN DMKVDREL                                        @V200820 00450000
         EXTRN DMKVDSLK                                                 00451000
         EXTRN DMKERMSG                                                 00452000
         EXTRN DMKSCNVN                                                 00453000
         EXTRN DMKSTKCP,DMKDSPCH,DMKSSSLN                      @V60B6B8 00453300
         EXTRN DMKSYSJR,DMKJRLSL,DMKJRLIL                      @V60BBBB 00453600
         SPACE                                                          00454000
         USING PSA,R0                                                   00455000
         USING VMBLOK,R11                                               00456000
         USING DMKLNK,R12                                               00457000
         USING SAVEAREA,R13                                             00458000
         EJECT                                                          00459000
DMKLNKIN RELOC                "LINK" ENTRY                              00460000
         SR    R5,R5          R5=0 MEANS NO DECISION TABLES IN USE YET  00461000
         ST    R5,SAVEWRK1    CLEAR 'SAVEWRK1' TO USE AS FLAGS          00462000
         ST    R5,SAVER2      ALSO CLEAR R2-REGISTER RETURNED AT EXIT   00463000
         LA    R0,UDBFSIZE+2  GET FREE STORAGE FOR USER DIRECTORY       00464000
         CALL  DMKFREE        BLOCK, DEVICE BLOCK, & ERROR MESSAGES     00465000
         LR    R4,R1          AND KEEP ITS ADDRESS IN R4                00466000
         L     R2,=A(DMKSYSJR) GET ADDRESS OF JPSCBLOK         @V60BBBB 00466200
         USING JPSCBLOK,R2    TELL ASSEMBLER                   @V60BBBB 00466400
         TM    LINKJRL,L'LINKJRL+L'LINKJRLI JOURNALING?        @V60BBBB 00466600
         BZ    LINK0A         BR IF NOT                        @V60BBBB 00466800
         CLC   VMPSWDCT,JPSLNKDS SHALL WE LET HIM CONTINUE?    @V60BBBB 00467000
         B     LINK0F         CONTINUE                         @V60BBBB 00467200
         DROP  R2                                              @V60BBBB 00467400
LINK0A   TM    VMOSTAT,VMVIRCF WAS 'LINK' FROM VIRT. MACHINE?  @V60BBBB 00467600
         BZ    LINK00          TRF IF NOT (NO PROBLEM)                  00468000
         IC    R14,VMPSWDCT   GET THE BAD PASSWORD COUNT       @VM03198 00469000
         N     R14,F15        ISOLATE LOWER DIGIT              @VM03198 00470000
         LA    R15,LNKLIMIT   GET THE LIMIT                    @VM03198 00471000
         CR    R14,R15        SHALL WE LET HIM CONTINUE?       @VM03198 00472000
LINK0F   BNL   ERROR115       NOPE, TOO BAD JACK...            @V60BBBB 00473000
LINK00   DS    0H             OK FOR USER TO ISSUE LINK, CONTINUE:      00474000
         USING UDBFBLOK,R4    REFERENCE UDBFBLOK BRIEFLY                00475000
         MVC   UDBFVADD(8),ZEROES  CLEAR THE LAST DOUBLE-WORD           00476000
         DROP  R4             THAT'S ALL FOR NOW.                       00477000
         USING UDIRBLOK,R4    AND REFERENCE THE DIRECTORY BLOCK.        00478000
         CALL  DMKSCNFD       GET 'TO' OR USERID                        00479000
         BNZ   ERROR20        ERROR IF USERID MISSING (TUT TUT)         00480000
         CL    R0,F2          MORE THAN 2 BYTES INPUTTED ?              00481000
         BH    LINK01A        IF YES, IT CAN'T BE 'TO' OR '* '          00482000
         LR    R15,R0         COUNT INTO R15,                           00483000
         BCTR  R15,0          LESS 1,                                   00484000
         LA    R3,CLTO        POINT AT 'TO'                             00485000
         EX    R15,MODECLC    SEE IF IT IS 'T' OR 'TO'                  00486000
         BNE   LINK01         NOPE - ASSUME IT'S A USERID.              00487000
         CALL  DMKSCNFD       SKIP 'TO' - NOW GET THE USERID            00488000
         BNZ   ERROR20        NOW WHY DID HE LEAVE IT OUT ?             00489000
LINK01   CLC   =CL2'* ',0(R1) IS HE LINKING TO HIMSELF ?                00490000
         BNE   LINK01A        TRF IF NOT THIS TIME.                     00491000
         MVC   SAVEWRK2(8),VMUSER  SAVE USERID                          00492000
         LA    R0,8                CALL IT 8 BYTES                      00493000
         LA    R1,SAVEWRK2         POINT TO USERID                      00494000
         B     LINK02              GO SET FLAG MEANING "IT'S ME".       00495000
*                                                                       00496000
LINK01A  MVC   SAVEWRK2(8),BLANKS                                       00497000
         LR    R15,R0         CHECK BYTE-COUNT                          00498000
         C     R15,F8         ...                                       00499000
         BH    ERROR20        ERROR IF USERID > 8 CHARACTERS IN LENGTH  00500000
         BCTR  R15,0                                                    00501000
         EX    R15,SAVEID          SAVE USERID (BLANK-FILLED)           00502000
         CLC   VMUSER,SAVEWRK2     IS THE USER = MYSELF ?               00503000
         BNE   LINK03              NOT THIS TIME.                       00504000
*                                                                       00505000
LINK02   OI    LINKFLAG,JMYSELF+JLNKPRV SET FLAGS FOR MY OWN DISK       00506000
*                                                                       00507000
LINK03   LR    R2,R4          SET R2 FOR COPY OF USER DIRECTORY BLOCK   00508000
         CALL  DMKUDRFU       FIND THE USERID IN THE CP DIRECTORY       00509000
         BNZ   ERROR53        ERROR IF USERID WAS NOT FOUND             00510000
         CALL  DMKSCNFD       GET 'XXX' DISK-ADDRESS                    00511000
         BNZ   ERROR22        CALLER = A BAD GUY IF NOT THERE AT ALL.   00512000
         CALL  DMKCVTHB       CONVERT TO BINARY                         00513000
         BNZ   ERROR22        JUST HEX NUMBERS, PLEASE.                 00514000
         CL    R1,F4095       ADDR > X'FFF'?                   @VA01138 00515000
         BH    ERROR22        HASN'T BEEN INVENTED YET         @VA01138 00516000
         ST    R1,SAVEWRK4    SAVE THE XXX DISK-ADDRESS.                00517000
         CALL  DMKSCNFD       GET 'AS' OR 'YYY' DISK-ADDRESS            00518000
         BNZ   ERROR22        CALLER GOOFED AGAIN IF HE LEFT IT OUT.    00519000
         CL    R0,F2          MORE THAN 2 BYTES INPUTTED ?              00520000
         BH    LINK03A        IF YES, IT MUST BE THE 'YYY' DEVICE       00521000
         LR    R15,R0         COUNT INTO R15,                           00522000
         BCTR  R15,0          LESS 1,                                   00523000
         LA    R3,CLAS        POINT AT 'AS'                             00524000
         EX    R15,MODECLC    SEE IF IT IS 'A' OR 'AS'                  00525000
         BNE   LINK03A        NOPE - ASSUME IT'S THE 'YYY' DEVICE       00526000
         CALL  DMKSCNFD       SKIP 'AS' - NOW GET THE 'YYY' DEVICE      00527000
         BNZ   ERROR22        JUST WHEN I HAD MY HOPES UP HE GOOFED     00528000
LINK03A  CALL  DMKCVTHB       CONVERT YYY DEVICE TO BINARY              00529000
         BNZ   ERROR22        COME ON, FELLAS - THAT'S 0-9 AND A-F.     00530000
         MAXDV R10            GET HIGHEST ALLOWABLE ADDR       @VA01138 00531000
         CLR   R1,R10         LEGITIMATE 370 VIRTUAL DEVICE, WE HOPE ?  00532000
         BH    ERROR22        ERROR IF > MAXIMUM (X'5FF' OR X'FFF')     00533000
         ST    R1,SAVEWRK5    SAVE THE YYY DISK-ADDRESS                 00534000
         L     R0,SAVEWRK4    XXX DEVICE INTO R0,                       00535000
         LA    R1,UDIRDISP    R1 MUST POINT TO UDIRDISP & FOLLOWING     00536000
         LR    R2,R4          R2 MUST POINT TO UDIRBLOK                 00537000
         DROP  R4             (THRU WITH UDIRBLOK NOW)                  00538000
         CALL  DMKUDRFD       FIND THE SPECIFIC DEVICE                  00539000
         BNZ   ERROR107       ERROR IF NOT FOUND                        00540000
         CALL  DMKUDRRV       LET DMKUDR ROUTINE RELEASE HIS PAGES      00541000
         USING UDEVBLOK,R4    SWITCH TO UDEVBLOK DSECT NOW.             00542000
         CALL  DMKSCNFD       ANYTHING LEFT ON INPUT LINE ?             00543000
         BNZ   LINK08         TRF IF NOT - GO GET DEFAULT LINK-MODE     00544000
         CL    R0,F2          MORE THAN 2 BYTES ?                       00545000
         BH    LINK05         IF > 2 BYTES, LOOK FOR 'PASS= ' OR PSWRD  00546000
         LR    R6,R0          BYTE-COUNT INTO R6                        00547000
         BCTR  R6,0           LESS 1 FOR EX-CLC                         00548000
         LA    R3,MODER       POINT TO FIRST MODE WE'LL LOOK FOR        00549000
         LA    R14,4          INCREMENTER FOR BXLE,                     00550000
         LA    R15,MODEMW     LAST MODE WE'LL LOOK FOR                  00551000
LINK03B  EX    R6,MODECLC     IS IT 'R ', 'RR', ETC.                    00552000
         BE    LINK04         GOOD SHOW IF YES.                         00553000
         BXLE  R3,R14,LINK03B IF NOT, ITERATE THRU VARIOUS MODES        00554000
         BAL   R10,LINKDEF    IF NOT FOUND, SET TO DEFAULT VALUE,       00555000
         B     LINK07         AND TREAT AS A PASSWORD.                  00556000
*                                                                       00557000
LINK04   DS    0H             ACCESS MODE WAS FOUND:                    00558000
         LH    R15,2(,R3)     PICK UP DECISION-TABLE INDEXER            00559000
         STH   R15,LINKHALF   STORE WHERE NEEDED.                       00560000
*                                                                       00561000
         CALL  DMKSCNFD       ANYTHING MORE ON THE LINE ?               00562000
         BNZ   LINK09         TRF IF NOT - GO DO THE LINK NOW.          00563000
         B     LINK06         IF YES, CHECK FOR PASSWORD.               00564000
*                                                                       00565000
LINK05   BAL   R10,LINKDEF    SET DEFAULT, IF NO LINK-MODE GIVEN        00566000
*                                                                       00567000
LINK06   MVC   SAVEWRK6(8),BLANKS BLANK WHERE WE'LL PUT PSWD   @V60BBBB 00567600
         CLC   =C'PASS= ',0(R1) PERHAPS IS 'PASS= ' ?          @V60BBBB 00568200
         BNE   LINK07         IF NOT, ASSUME IT IS THE PASSWORD.        00569000
         CALL  DMKSCNFD       IF 'PASS= ', THE PASSWORD MUST BE NEXT    00570000
         BNZ   ERROR114       TREAT MISSING PASSWORD AS IF INCORRECT    00571000
*                                                                       00572000
LINK07   L     R2,=A(DMKSYSJR) GET ADDRESS OF JPSCBLOK         @V60BBBB 00572200
         USING JPSCBLOK,R2     TELL ASSEMBLER                  @V60BBBB 00572400
         TM    MASKLINK,L'MASKLINK LINK PSWD SUPPRESSION ON?   @V60BBBB 00572600
         BZ    LINK07F         BR IF NOT                       @V60BBBB 00572800
         DROP  R2                                              @V60BBBB 00573000
         TM    VMOSTAT,VMCF    CONSOLE FUNCTION?               @V60BBBB 00573200
         BZ    LINK07F         BR IF NOT                       @V60BBBB 00573400
         TM    VMOSTAT,VMVIRCF VIRTUAL CONSOLE FUNCTION        @V60BBBB 00573600
         BZ    ERRORPS         BR IF NOT                       @V60BBBB 00573800
         TM    VMFSTAT,VMNPWOCL VM WANT PASSWORD SUPPRESSION?  @V60BBBB 00574000
         BO    ERRORPS         BR IF YES                       @V60BBBB 00574200
LINK07F  DS    0H                                              @V60BBBB 00574400
         LR    R15,R0         PREPARE FOR EXECUTE              @V60BBBB 00574600
         BCTR  R15,0                                           @V60BBBB 00574800
         N     R15,F7         MOVE NO MORE THAN 8 CHARACTERS   @V60BBBB 00575000
         EX    R15,SAVEPASS   SAVE THE PASSWORD                @V60BBBB 00575200
         C     R0,F8          WAS IT LONGER THAN 8 CHARACTERS? @V60BBBB 00575400
         BH    ERROR114      TREAT PASSWORD > 8 CHARACTERS AS INCORRECT 00576000
         OI    LINKFLAG,JGOTPASS   FLAG THAT WE HAVE THE PASSWORD       00579000
         B     LINK09         CONTINUE.                                 00580000
*                             (NOTE - THRU WITH COMMAND LINE & R9 NOW)  00581000
LINK08   BAL   R10,LINKDEF    SET DEFAULT, IF NO LINK-MODE GIVEN        00582000
*                                                                       00583000
LINK09   NI    LINKFLAG,255-JMYSELF  DON'T ASSUME MY OWN DISK ANY MORE  00584000
         LA    R6,LEVLIMIT    LINK-LIMIT = 2 FOR LINK COMMAND; @V407438 00584100
*                                                                       00585000
* NOTE - JOIN FORCES HERE IF "LINK SUBROUTINE" (DMKLNKSB) WAS INVOKED:  00586000
*                                                                       00587000
LINK09A  EQU   *              R6 SET TO 2 OR 3 FOR LINK LIMIT; @V407438 00588100
         MVC   LINKMODE(1),UDEVMODE  SAVE UDEVMODE FROM ORIG. UDEVBLOK  00589000
*                                                                       00590000
LINK09B  TM    UDEVSTAT,UDEVLKDV   IS THIS AN INDIRECT LINK ?           00591000
         BO    LINK09C        YES - GO TO IT, MEN.                      00592000
         TM    UDEVTYPC,CLASDASD   NO - IT BETTER BE A DISK, THEN.      00593000
         BZ    ERROR109            BLUNDER IF NOT A DASD DEVICE         00594000
         TM    UDEVSTAT,UDEVDED+UDEVTDSK  DEDICATED OR (TEMP) ?         00595000
         BNZ   ERROR109                 ERROR IF EITHER (TSK TSK).      00596000
         TM    UDEVSTAT,UDEVLONG   ALL THE INFO WE NEED THERE ?         00597000
         BO    LINK09D             YES - WE'RE ALL READY TO GO.         00598000
         B     ERROR52        (ERROR IN CP DIRECTORY IF IT ISN'T)       00599000
*                                                                       00600000
* CALL DMKUDR ROUTINES TO GET UDEVBLOK FOR AN INDIRECT LINK:            00601000
         USING UDBFBLOK,R4                                              00602000
LINK09C  MVC   UDBFVADD(8),ZEROES  CLEAR DBL-WORD USED BY UDR ROUTINES  00603000
         USING UDEVBLOK,R4                                              00604000
         LH    R5,UDEVLINK    DISK-TO-BE-LINKED-TO INTO R5,             00605000
         ST    R5,SAVEWRK4    REMEMBER FOR LATER USE                    00606000
         MVC   SAVEWRK2(8),UDEVLKID  ALSO REMEMBER USERID               00607000
         LA    R0,8           POINT TO USERID - OWNER OF DISK           00608000
         LA    R1,SAVEWRK2    ...                                       00609000
         LR    R2,R4          SET R2                                    00610000
         CALL  DMKUDRFU       FIND THE USERID                           00611000
         BNZ   ERROR53        IF NOT FOUND MUST BE A DIRECTORY ERROR    00612000
         LR    R0,R5          DEVICE INTO R0,                           00613000
         LA    R1,UDEVDISP    POINT TO WHERE TO START LOOKING           00614000
         CALL  DMKUDRFD       NOW FIND THE GIVEN DEVICE                 00615000
         BNZ   ERROR107       BAD SHOW IF WE COULDN'T FIND IT.          00616000
         CALL  DMKUDRRV       RELEASE PAGES USED BY DMKUDRFD            00617000
         BCT   R6,LINK09B     REPEAT ABOVE CHECKING UNTIL OK OR ERROR.  00618000
ERROR52  LA    R2,52          "ERROR IN CP DIRECTORY" IF NOT   @VA01468 00619000
         B     ERRNODAT       FOUND WITHIN A REASONABLE NO. OF LEVELS.  00620000
*                                                                       00621000
LINK09D  LA    R1,UDEVVSER    POINT TO VOLUME ID                        00622000
         LA    R0,6           (6 BYTES, PLEASE)                         00623000
         CALL  DMKSCNVS       MAKE SURE IT IS MOUNTED                   00624000
         BNZ   CHK3330V       IF VOL NOT MOUNTED, CHECK FOR MSS@V60B6B8 00625000
         LR    R9,R1          SAVE THE RDEVBLOK ADDRESS IN R9           00626000
         USING RDEVBLOK,R9                                              00627000
         CLC   RDEVTYPC(2),UDEVTYPC  DEVICE CLASS AND TYPE MUST MATCH   00628000
         LA    R15,EMSG117    ERROR 117 = "VOLID DSKLAB CONFLICT"       00629000
         BE    LINK09B2       BRANCH IF EQ, ALL OK             @V60B6B8 00630000
         CLI   RDEVTYPE,TYP2314         * IF NOT EQ THEN THE REAL DISK  00631000
         BNE   ERROR117                 * MUST BE A 2314 AND THE MINI   00632000
         CLI   UDEVTYPE,TYP2311         * DISK MUST BE A 2311 TOP OR    00633000
         BNE   ERROR117                 * 2311 BOTTOM.  IF NOT THEN     00634000
         TM    UDEVFTR,FTR2311T+FTR2311B  ISSUE ERROR MSG DMKLNK117     00635000
         BZ    ERROR117                 * "VOLID DSKLAB CONFLICT".      00636000
LINK09B1 EQU   *                                                        00637000
         DROP  R9                                                       00638000
         CLC   VMUSER,SAVEWRK2     DOES THE REAL DISK BELONG TO ME ?    00639000
         BE    LINK09E             YES, SET MYSELF FLAG AGAIN.          00640000
         LA    R0,8           IS THIS USER ACTIVE ?                     00641000
         LA    R1,SAVEWRK2    ...                                       00642000
         CALL  DMKSCNAU       ...                                       00643000
         BC    8+4+2,LINK10        NO PROBLEM IF HE ISN'T.              00644000
         TM    VMRSTAT-VMBLOK(R1),VMLOGON  IS HE LOGGING IN RIGHT NOW ? 00645000
         BO    ERROR116            THAT'S A NO NO                       00646000
         B     LINK10              BUT OK IF HE'S NOT.                  00647000
LINK09B2 EQU   *              CHECK FOR MSS VOLUMES            @V60B6B8 00647010
         USING RDEVBLOK,R9    ASSEMBLER ADDRESSABILITY         @V60B6B8 00647020
         TM    RDEVFTR,VIRTUAL+SYSVIRT IS RDEV A 3330          @V60B6B8 00647030
         BZ    LINK09B1       NO, CONTINUE                     @V60B6B8 00647040
         LA    R15,EMSG117    MSG ID JUST IN CASE              @V60B6B8 00647050
         CLI   UDEVTYPC,CLASDASD DID USER WANT DASD            @V60B6B8 00647060
         BNE   ERROR117       NO, BUT THAT IS WHAT WE FOUND    @V60B6B8 00647070
         CLI   UDEVTYPE,TYP3330 DID USER WANT 3330             @V60B6B8 00647080
         BNE   ERROR117       USER DIDN'T WANT 3330            @V60B6B8 00647090
         B     LINK09B1       RESUME MAINLINE                  @V60B6B8 00647100
         DROP  R9                                              @V60B6B8 00647110
*                                                                       00647120
*        THE VM SYSTEM VOLUME WHICH IS THE TARGET OF A LINK             00647130
*        IS NOT MOUNTED. IF THE USER WANTED A 3330, CALL                00647140
*        DMKSSSLN TO SEE IF A 3330V VOLUME WITH THE CORRECT             00647150
*        VOLSER CAN BE MOUNTED.                                         00647160
*                                                                       00647170
*        DMKSSSLN WILL ALLOCATE A VUA AND ATTEMPT AN MSS                00647180
*        MOUNT. IF FOR ANY REASON DMKSSSLN FAILS (SUCH AS               00647190
*        NO VUA AVAILABLE, VOLUME NOT FOUND, MSS NOT                    00647200
*        AVAILABLE, THEN ON RETURN GPR 15 WILL BE NONZERO               00647210
*                                                                       00647220
CHK3330V EQU   *              CHECK FOR 3330V REQUEST          @V60B6B8 00647230
         LA    R15,EMSG108    MSG CODE JUST IN CASE            @V60B6B8 00647240
         CLI   UDEVTYPC,CLASDASD DID USER WANT DASD            @V60B6B8 00647250
         BNE   ERROR108       3330V MUST BE DASD               @V60B6B8 00647260
         CLI   UDEVTYPE,TYP3330 USER WANT A 3330 SYSTEM VOLUME @V60B6B8 00647270
         BNE   ERROR108       NO, CAN'T BE MSS VOLUME          @V60B6B8 00647280
         TM    PSAMSS,MSSPRES IS THE MSS PRESENT               @V60B6B8 00647290
         BZ    ERROR108       NO, VOLUME NOT AVAILABLE         @V60B6B8 00647300
         CALL  DMKSSSLN       TRY TO MOUNT THE SYSTEM VOLUME   @V60B6B8 00647310
         LTR   R0,R0          WAS THERE AN ERROR               @V60B6B8 00647320
         BZ    LINK09D        ENTER MAINLINE LINK              @VMI2004 00647330
         LA    R15,RC4        SET UP FOR RET CODE CHECK        @V60B6B8 00647340
         CR    R15,R0         IS DMKSSS CODE 4                 @V60B6B8 00647350
         BE    MNTSETUP       YES, WAIT FOR MSS MOUNT          @VMI2004 00647360
         LA    R15,EMSG108    ERROR MSG CODE                   @V60B6B8 00647370
         B     ERROR108       AND PUT OUT MSG                  @V60B6B8 00647380
*                                                                       00647390
*        THE FOLLOWING ENTRY POINT IS EXECUTED AFTER A REQUIRED         00647400
*              MSS VOLUME IS MOUNTED. THE ADDRESS OF DMKLNKSS IS        00647410
*              PLACED IN A CPEXBLOK BY DMKSSS. WHEN THE MOUNT           00647420
*              IS COMPLETE, DMKDSB STACKS THE CPEXBLOK SUCH THAT        00647430
*              DMKLNKSS GETS CONTROL.                                   00647440
*                                                                       00647450
DMKLNKSS RELOC ENTRY          FROM THE DISPATCHER              @V60B6B8 00647460
         ST    R3,SAVER0      SAVE THE ADDR OF THE MSSCOM BLOCK@V60B6B8 00647470
         MVC   SAVEWRK1(4),0(R1) RESET WORKAREA DATA           @VMI2004 00647480
         MVC   SAVEWRK2(32),4(R1) ....SAME FOR THE REST        @VMI2004 00647490
         LA    R4,36(R1)      OUR BUFFER AREA NOW              @VMI2004 00647500
         ST    R1,SAVER1      SAVE FOR LATER DMKFRET           @VMI2004 00647510
         OI    LINKFLAG,SSENT INDICATE MSS RE-ENTRY            @V60B6B8 00647520
         B     LINK09D        RE-ENTER LINK MAINLINE           @VMI2004 00647530
*                                                                       00648000
*        ENTRY HERE MEANS THAT THE PCI HAS NOW OCCURRED                 00648050
*         AND THE SYSTEM VOLUME IS NOW MOUNTED.                         00648100
PCINOW   EQU   *                                               @VMI2018 00648150
         L     R14,=V(DMKSSSMQ) ADDR OF MSSCOM Q               @VMI2018 00648200
         L     R15,0(R14)     ACTUAL FIRST MSSCOM              @VMI2018 00648250
CHEKIT   EQU   *                                               @VMI2018 00648300
         CR    R1,R15         FIND THIS MSSCOM IN THE Q        @VMI2018 00648350
         BE    DEQIT          IF FOUND, REMOVE FROM Q          @VMI2018 00648400
         LTR   R15,R15        VALIDITY CHECK: END OF Q?        @VMI2018 00648450
         BZ    EXITGO         YES, QUIT, Q INVALID             @VMI2018 00648500
         LA    R14,MSSNEXT-OSVSCOM(R15) INCREMENT CHAIN PTR    @VMI2018 00648550
         L     R15,MSSNEXT-OSVSCOM(R15) NEXT MSSCOM BLOCK      @VMI2018 00648600
         B     CHEKIT         CHECK FOR CORRECT MSSCOM         @VMI2018 00648650
DEQIT    EQU   *              REMOVE OUR ENTRY FROM Q          @VMI2018 00648700
         MVC   0(4,R14),MSSNEXT-OSVSCOM(R15) RESET CHAIN       @VMI2018 00648750
         LA    R0,MSSSIZE     MSSCOM SIZE                      @VMI2018 00648800
         CALL  DMKFRET        DONE WITH MSSCOM                 @VMI2018 00648850
         B     LINK09D        NOW COMPLETE THE LINK            @VMI2018 00648900
LINK09E  OI    LINKFLAG,JMYSELF    SET "MYSELF" FLAG IF MY OWN DISK.    00649000
*                                                                       00650000
LINK10   L     R1,SAVEWRK5    LOOK UP 'YYY' DEVICE TO SEE IF ATTACHED   00651000
         CALL  DMKSCNVU       ...                                       00652000
         AIF   (NOT &DEDCH).NOTDED1                                     00653000
         BC    4,LINK11       OK TO CONTINUE IF NO CHANNEL BLOK         00654000
         BALR  R15,0          PRESERVE CONDITION CODE FROM SCNVU        00655000
         USING VCHBLOK,R6     ADDRESS VCHBLOK (TEMPORARILY)             00656000
         TM    VCHSTAT,VCHDED IS THE VIRTUAL CHANNEL DEDICATED ?        00657000
         BO    ERROR137       YES - CANNOT LINK DEVICES TO IT           00658000
         DROP  R6             FINISHED WITH VCHBLOK                     00659000
         SPM   R15            RESTORE CONDITION CODE                    00660000
         BC    2+1,LINK11     OK TO CONTINUE IF NO CU OR DEVICE         00661000
         AGO   .DED1                                                    00662000
.NOTDED1 BNZ   LINK11         OK TO CONTINUE IF DEV NOT ATTACHED        00663000
.DED1    ANOP                                                           00664000
         USING VDEVBLOK,R8    REFERENCE THE DEVICE WE FOUND             00665000
         TM    VDEVTYPC,CLASDASD   IS IT A DASD DEVICE ?                00666000
         BZ    ERROR110       TRF IF NOT - CERTAINLY AN ERROR.          00667000
         L     R14,VDEVREAL   GET POINTER TO REAL DEVICE BLOCK          00668000
         LH    R15,VDEVRELN   AND RELOCATION FACTOR                     00669000
         CLR   R14,R9         IS IT THE SAME DEVICE WE WANT TO LINK TO? 00670000
         BNE   ERROR110       ERROR IF NOT - LEAVE WELL ENOUGH ALONE    00671000
         CH    R15,UDEVRELN   MUST ALSO CHECK RELOCATION FACTOR         00672000
         BNE   ERROR110       ...                                       00673000
         CLI   VDEVTYPE,TYP2311    MIGHT THIS BE A PSEUDO-2311 ?        00674000
         BNE   LINK10A        NO - IT REALLY IS THE SAME DISK, THEN.    00675000
         IC    R0,UDEVFTR     GET 'FTR2311T,FTR2311B' BITS, IF ANY      00676000
         N     R0,=A(FTR2311T+FTR2311B)  ... AND ONLY THOSE BITS        00677000
         BZ    LINK10A        IF 0 IT'S A REAL 2311                     00678000
         N     R0,VDEVFLAG-3  SAME DEVICE IF THE FLAGS MATCH            00679000
         BZ    ERROR110       IF NO MATCH, A DIFFERENT DEVICE.          00680000
         DROP  R8                                                       00681000
LINK10A  OI    LINKFLAG,DETOLD   DETACH OLD LINK BEFORE SETTING NEW ONE 00682000
*                                                                       00683000
LINK11   DS    0H     SEE IF A LINK IS FEASIBLE, AND IF SO WHAT KIND:   00684000
         STH   R1,UDEVADD     STORE LINK-TO DEVICE ADDRESS IN UDEVBLOK  00685000
         BAL   R10,LINKSUB    SUBROUTINE SETS UP R5 PER DECISION TABLE  00686000
*                             R5 NOW 'INDEXES' THE DECISION-TABLE       00687000
         LA    R0,3           SET TO OBTAIN 01, 02, OR 03 TO CHECK PSWD 00688000
         IC    R1,0(,R5)      PICK UP FLAG-BYTE                         00689000
         NR    R0,R1          ISOLATE THE 01, 02, OR 03 IN R0           00690000
         LR    R1,R0          NUMBER ALSO IN R1,                        00691000
         SLL   R1,3           TIMES 8 PLEASE                            00692000
         LA    R1,UDEVPASR-8(R1) POINT R1 TO UDEVPASR, -PASW, OR -PASM. 00693000
         CLC   =CL8'ALL',0(R1) IS THE PASSWORD ALL?            @V60BBBB 00693200
         BNE   LINK13         BR IF NOT                        @V60BBBB 00693400
         OI    LINKFLAG,PASSALL INDICATE NOT TO BE JOURNALED   @V60BBBB 00693600
LINK13   DS    0H                                              @V60BBBB 00693800
         TM    LINKFLAG,JLNKPRV    DO I HAVE LINK PRIVILEGE TO DISK ?   00694000
         BZ    LINK16         TRF IF NOT - WE NEED THE PASSWORD.        00695000
         IC    R15,LINKMODE   GET USER ACCESS MODE FROM ORIG. UDEVBLOK  00696000
         SRL   R15,2          0, 4, ... 24 BECOMES 0, 1, ... 6          00697000
         N     R15,F7         NOW IT DOES, ANYWAY                       00698000
         IC    R15,BYTABLE(R15) NOW PICK UP PROPER BITS TO EXAMINE      00699000
         EX    R15,XTMMODE    DOES IT MATCH THE ACCESS MODE NEEDED ?    00700000
         BO    LINK20         TRF IF YES - NO PASSWORD NEEDED.          00701000
LINK16   CLI   0(R1),C' '     PASSWORD NEEDED - DOES ONE EXIST ?        00702000
         BE    NOPSWRD        ERROR IF NOT (IT'S BLANK).                00703000
         TM    LINKFLAG,LINKSUBR+JMYSELF LINK-SUBROUTINE OR MY OWN DISK 00704000
         BNZ   LINK20         YES - TREAT AS IF WE HAD A GOOD PASSWORD. 00705000
         CLC   =CL8'ALL',0(R1)     IS THE PASSWORD = 'ALL' ?            00706000
         BE    LINK20              TRF IF YES - DON'T GO GET ONE.       00707000
         TM    LINKFLAG,JGOTPASS  DID USER ALREADY ENTER THE PASSWORD?  00708000
         BZ    LINK18              TRF IF NOT - GO GET IT.              00709000
         CLC   SAVEWRK6(8),0(R1)   DOES THE PASSWORD MATCH ?            00710000
         BE    LINK20              TRF IF YES - GOOD SHOW.              00711000
         BAL   R10,UNLOKSUB   UNLOCK USERID(S),                         00712000
         B     ERROR114       AND SEE IF THIS GUY IS TRYING TO FOOL US  00713000
*                                                                       00714000
XTMMODE  TM    1(R5),*-*      TO CHECK FOR LEGITIMATE ACCESS MODE       00715000
*                                                                       00716000
LINK18   LR    R3,R1          SAVE R1 FOR PASSING TO DMKEPSWD           00717000
         BAL   R10,UNLOKSUB   UNLOCK USERID(S) BEFORE GETTING PASSWORD  00718000
         LR    R1,R3          RESTORE R1                                00719000
         A     R0,F4          BUMP R0 BY 4 INDICATING TO       @V60BBBB 00719250
*                             DMKEPSWD THAT AN INVALID PASS-            00719500
*                             WORD SHOULD BE RETURNED IN R0/R1.         00719750
         CALL  DMKEPSWD       OBTAIN AND CHECK LINK PASSWORD            00720000
         BNZ   PASSWRNG       IF WRONG, HE'S JUST OUT OF LUCK.          00721000
         BAL   R10,LINKSUB    IF OK, CALL LINKSUB AGAIN, THEN PROCEED:  00722000
*                                                                       00723000
LINK20   EQU   *              PASSWORD CORRECT (OR NOT NEEDED):         00724000
         TM    LINKFLAG,DETOLD     OLD LINK TO GET RID OF FIRST ?       00725000
         BZ    LINK21         NOPE - GO TO IT (USUAL CASE).             00726000
*                                                                       00727000
         L     R1,SAVEWRK5    GET VIRTUAL DEVICE AGAIN,                 00728000
         SLL   R7,16          MOVE READ COUNT TO HIGH ORDER    @VA04747 00728100
         SLDL  R6,16          SAVE R7 COUNT IN R6 ALSO         @VA04747 00728200
         LR    R10,R6         SAVE COUNTS IN R10 ACROSS CALLS  @VA04747 00728300
         CALL  DMKSCNVU       FIND THE BLOCKS                           00729000
         USING VDEVBLOK,R8                                     @VA04747 00730200
         CALL  DMKCFPRD       RESET OLD LINK                   @VA04747 00730400
         NI    LINKFLAG,255-DETOLD TURN OFF SIGNAL             @VA04747 00730600
         LH    R0,UDEVNCYL    GET LATEST MDISK EXTENT          @VA04747 00730800
         STH   R0,VDEVBND     REFLECT SAME IN NEW VDEVBLOK     @VA04747 00731000
         NI    VDEVFLAG,255-VDEVRDO ASSUME R/W FOR NOW         @VA04747 00731200
         LR    R6,R10         RESTORE SAVED COUNTS IN R6       @VA04747 00731400
         SRDL  R6,16          UN-COMBINE COUNTS R6/R7          @VA04747 00731600
         SRL   R7,16          POSITION READ COUNT IN LOW ORDER @VA04747 00731800
         TM    0(R5),SWT      SHOULD WE SET TO WRITE ??        @VA04747 00732000
         BO    LINK25         YES, GO INDICATE RESULTS         @VA04747 00732200
         OI    VDEVFLAG,VDEVRDO NO, SET READ ONLY MODE         @VA04747 00732400
         B     LINK25         LINK COMPLETE TRANSMIT RESPONSE  @VA04747 00732600
         DROP  R8                                              @VA04747 00732800
LINK21   LR    R1,R9          SET R1 = ADDRESS OF RDEVBLOCK    @VA04747 00733100
         LR    R3,R2          ADD OF VDEVBLOK FOR EXISTING LINK@VA04747 00733400
         LR    R2,R4          R2 = ADDRESS OF UDEVBLOK                  00736000
         MVI   UDEVMODE,UDEVR TENTATIVELY SET MODE TO 'R'               00737000
         TM    0(R5),SWT      DID HE WANT 'SET TO WRITE' ?              00738000
         BZ    LINK24         IF NOT, 'R' IS CORRECT.                   00739000
         MVI   UDEVMODE,UDEVW SET TO 'W' IF THAT'S THE RIGHT SCOOP.     00740000
LINK24   CALL  DMKVDSLK       ESTABLISH NEW LINK TO VIRTUAL DEVICE      00741000
         LTR   R2,R2          ENOUGH STORAGE TO PERFORM LINK?  @V407466 00741100
         BNZ   ERROR119       INSUFFICIENT STORAGE             @V407466 00741200
LINK25   BAL   R10,UNLOKSUB   UNLOCK USERIDS POST HASTE        @VA04747 00742200
         L     R2,=A(DMKSYSJR) GET ADDRESS OF JPSCBLOK         @V60BBBB 00742350
         USING JPSCBLOK,R2    TELL ASSEMBLER                   @V60BBBB 00742500
         TM    LINKJRL,L'LINKJRL SUCCESSFUL-LINK JOURNALING?   @V60BBBB 00742650
         BZ    LINK25F        BR IF NOT                        @V60BBBB 00742800
         TM    LINKFLAG,JMYSELF+PASSALL JOURNAL THIS LINK?     @V60BBBB 00742950
         BNZ   LINK25F        BR IF NOT                        @V60BBBB 00743100
         LA    R1,SAVEWRK2    POINT AT USERID FOR DMKJRLSL     @V60BBBB 00743250
         LA    R2,SAVEWRK4    POINT AT 'XXX' FOR DMKJRLSL      @V60BBBB 00743400
         CALL  DMKJRLSL       JOURNAL SUCCESSFUL LINK          @V60BBBB 00743550
         DROP  R2                                              @V60BBBB 00743700
LINK25F  LH    R15,2(,R5)     NOW WHERE-TO-GO INTO R5 AND GO TO@V60BBBB 00743850
         B     0(R12,R15)     LNKSC, LNKRO, LNKRW, LINKFRO1, LINKFRO2.  00744000
         SPACE                                                          00745000
LNKSC    DS    0H             SIMPLE CASE - SIMPLE MESSAGE:             00746000
         LA    R7,L'RESPON1   SET R7 = LENGTH OF SIMPLE MESSAGE         00747000
         MVC   0(L'RESPON1,R4),RESPON1  SIMPLE MSG TO FREE STORAGE      00748000
         B     LINK30         FILL IN SIMPLE STUFF.                     00749000
         SPACE                                                          00750000
LNKRO    DS    0H             LINK GIVEN; OTHERS LINKED R/O:            00751000
         LR    R1,R6          NUMBER OF R/O USERS INTO R1               00752000
         MVC   0(L'RESPON1+L'RESPON2,R4),RESPON1  MSG TO FREE STORAGE   00753000
         B     LINK26         CONTINUE BELOW.                           00754000
         SPACE                                                          00755000
LNKRW    DS    0H             LINK GIVEN; OTHERS LINKED R/W.            00756000
         MVC   0(L'RESPON1+L'RESPON2,R4),RESPON1  MSG TO FREE STORAGE   00757000
         MVI   RESPON2A(R4),C'W'   FILL IN 'W' WHERE NEEDED.            00758000
         LR    R1,R7          NO. OF OTHER R/W USERS INTO R1            00759000
         LTR   R6,R6          ANY OTHER R/O USERS ALSO ?                00760000
         BNP   LINK26         NOPE - NOT THIS TIME.                     00761000
         OI    LINKFLAG,ADDROMSG   IF YES, SIGNAL: ADD R/O MESSAGE      00762000
*                                                                       00763000
LINK26   LA    R7,L'RESPON1+L'RESPON2   SET R7 = LENGTH OF WHOLE MSG    00764000
         CL    R1,F1          IS IT JUST ONE USER ?                     00765000
         BH    LINK28         NOPE - MORE THAN ONE - PUT IN THE COUNT   00766000
         L     R14,SAVEWRK9             PUT THE USERID IN THE MESSAGE   00767000
         MVC   RESPON2B(8,R4),VMUSER-VMBLOK(R14) ...                    00768000
         MVI   RESPON2C(R4),C' '             AND NEEDED BLANK           00769000
         B     LINK30                   CONTINUE BELOW.                 00770000
LINK28   CALL  DMKCVTBD       NNN TO DECIMAL, PLEASE,                   00771000
         STCM  R1,7,RESPON2B(R4)  STORE IN MESSAGE                      00772000
*                                                                       00773000
LINK30   L     R1,SAVEWRK5    GET DEVICE-ADDRESS LINKED AS              00774000
         CALL  DMKCVTBH       TO HEX PLEASE                             00775000
         STCM  R1,7,RESPON1A(R4)  STORE IN MESSAGE                      00776000
         TM    0(R5),SWT      WAS IT 'SET TO WRITE' ?                   00777000
         BZ    LINK32         NOPE - WE'RE DONE.                        00778000
         MVI   RESPON1B(R4),C'W'  YES, FILL IN 'W' WHERE NEEDED.        00779000
*                                                                       00780000
LINK32   TM    0(R5),GMS      MESSAGE WANTED REGARDLESS OF RETURN-CODE? 00781000
         BO    LINK33         TRF IF YES - GO TO IT.                    00782000
         TM    VMOSTAT,VMVIRCF    VIRTUAL CONSOLE-FUNCTION LINK ?       00783000
         BO    LINKEXIT           IF YES, SKIP MSG FOR RETURN-CODE = 0. 00784000
         TM    LINKFLAG,LINKSUBR   LINK SUBROUTINE ENTRY POINT INVOKED? 00785000
         BO    EXIT                YES - EXIT FORTHWITH.                00786000
*                                                                       00787000
LINK33   LA    R2,NORET       SET 'NORET' OPTION FOR DMKQCNWT           00788000
*                             NOTE - LENGTH OF MSG IS IN R7             00789000
*                                                                       00790000
LINK34   DS    0H             ADDRESS OF MESSAGE IS IN R4               00791000
         LR    R15,R7         COMPUTE END OF RESPONSE MESSAGE           00792000
         ALR   R15,R4         (ONE BEYOND THE LAST BYTE)                00793000
         B     LINK38         GO DELETE TRAILING BLANKS (IF ANY)        00794000
LINK36   BCTR  R7,0           DECREMENT COUNT TO DELETE TRAILING BLANK  00795000
LINK38   BCTR  R15,0          NOW LOOK AT "NEW" LAST-BYTE               00796000
         CLI   0(R15),C' '    IS IT BLANK ?                             00797000
         BE    LINK36         IF YES, DECREMENT COUNT.                  00798000
         TM    LINKFLAG,ADDROMSG   R/O BY NNN USERS TO BE ADDED TO MSG? 00799000
         BZ    LINK40              NOPE - NOT TODAY.                    00800000
         MVC   1(L'RESPON2,R15),RESPON2  SKELETON TO END OF MESSAGE     00801000
         LA    R3,10(,R15)    WHERE TO PUT 'NNN' OR THE USERID          00802000
         LA    R7,L'RESPON2-1(,R7) ASSUME ONE USER                      00803000
         CL    R6,F1          IS IT JUST ONE R/O USER ?                 00804000
         BH    LINK39         NOPE - MORE THAN ONE - USE THE COUNT.     00805000
         L     R15,SAVEWRK8   REFERENCE VMBLOK ADDRESS OF THE ONE USER  00806000
         MVC   0(8,R3),VMUSER-VMBLOK(R15) PUT IN THE 8-BYTE USERID      00807000
         B     LINK40         AND GO GIVE THE MESSAGE.                  00808000
LINK39   LA    R7,1(,R7)      ONE MORE TO INCLUDE S IN 'USERS'          00809000
         LR    R1,R6          GET THE 'NNN' (STILL THERE IN R6)         00810000
         CALL  DMKCVTBD       BINARY TO DECIMAL PLEASE                  00811000
         STCM  R1,7,0(R3)     STORE IN ADDED-ON MESSAGE                 00812000
LINK40   LR    R0,R7          CORRECT COUNT INTO R0,                    00813000
         LR    R1,R4          ADDRESS OF MESSAGE INTO R1                00814000
         CALL  DMKQCNWT       TYPE RESPONSE OR ERROR MESSAGE TO USER    00815000
*                                                                       00816000
LINKEXIT TM    LINKFLAG,LINKSUBR WAS LINK-SUBROUTINE ENTRY POINT USED ? 00817000
         BO    EXIT           YES - EXIT FORTHWITH.                     00818000
         TM    LINKFLAG,SSENT IS THIS AFTER AN MSS P.C.I.      @VMI2004 00818300
         BO    EXIT           YES, WE ARE RUNNING ASYNCH.      @VMI2004 00818600
         LA    R0,UDBFSIZE+2  NO - RETURN THE FREE STORAGE USED FOR THE 00819000
         LR    R1,R4          USER DIRECTORY BLOCK                      00820000
         CALL  DMKFRET        AND USER DEVICE BLOCK                     00821000
EXIT     EQU   *              SEE IF MSS INVOLVED              @V60B6B8 00821060
         TM    LINKFLAG,SSENT ENTRY FROM MSS MOUNT?            @V60B6B8 00821120
         BZ    EXITGO         NO, LINK COMPLETE                @V60B6B8 00821180
         L     R3,SAVER0      MSSCOM BLOCK ADDR                @V60B6B8 00821240
         USING OSVSCOM,R3     ASSEMBLER ADDRESSABILITY         @V60B6B8 00821300
         L     R1,MSSTASK3    IS THERE PENDING I/O             @V60B6B8 00821360
         LTR   R1,R1          ...SCHEDULED BY DMKVSI OR DMKDGD @V60B6B8 00821420
         BZ    FREECOM        NO                               @V60B6B8 00821480
         CALL  DMKSTKCP                                        @V60B6B8 00821540
FREECOM  EQU   *              FREE THE MSS COM BLOCK           @V60B6B8 00821600
         LA    R0,MSSSIZE     NO OF D-WORDS IN MSSCOM          @V60B6B8 00821660
         LR    R1,R3          ADDR OF BLOCK                    @V60B6B8 00821720
         CALL  DMKFRET        RETURN MEMORY TO SYSTEM          @V60B6B8 00821780
         LA    R0,SAVESIZE+UDBFSIZE+2 LENGTH OF AREA FOR ASYNCH@VMI2004 00821840
         L     R1,SAVER1      ADDR  OF AREA - SET AT DMKLNKSS  @VMI2004 00821900
         CALL  DMKFRET        RETURN MEMORY TO SYSTEM          @VMI2004 00821960
         DROP  R3                                              @V60B6B8 00822020
EXITGO   EXIT                 AND REALLY EXIT.                 @V60B6B8 00822080
MNTSETUP EQU   *              SAVE DATA FOR ASYNCH ENTRY       @VMI2018 00822140
         TM    MSSFLAGS+1-OSVSCOM(R1),MSGPROC HAS PCI OCCURRED @VMI2018 00822200
         BZ    PCINOW         YES, CAN COMPLETE NOW            @VMI2018 00822260
         NI    MSSFLAGS+1-OSVSCOM(R1),X'FF'-MSGPROC            @VMI2018 00822320
         L     R2,MSSTASK1-OSVSCOM(R1) CPEXBLOK FOR DMKLNKSS   @VMI2018 00822380
         LA    R0,SAVESIZE+UDBFSIZE+2 LENG OF AREA TO SAVE DATA@VMI2018 00822440
         CALL  DMKFREE        GET AREA FOR DYNAMIC DATA        @VMI2018 00822500
         ST    R1,CPEXR1-CPEXBLOK(R2) SAVE ADDR FOR DMKLNKSS   @VMI2018 00822560
         MVC   0(4,R1),SAVEWRK1 PUT FLAGS INTO AREA            @VMI2018 00822620
         MVC   4(32,R1),SAVEWRK2 REST OF NEEDED DATA           @VMI2018 00822680
         MVC   36(80,R1),0(R4) SAVE DUMMY UDEVBLOK             @VMI2018 00822740
         B     LINKEXIT       WAIT FOR DMKDSB TO GET PCI       @VMI2018 00822800
         EJECT                                                          00823000
DMKLNKSB RELOC                "LINK SUBROUTINE" ENTRY POINT             00824000
         STM   R0,R3,SAVEWRK2 USERID TO SAVEWRK2/SAVEWRK3, LINK-TO AND  00825000
*                             LINK-AS DEVICES TO SAVEWRK4 & SAVEWRK5    00826000
         USING UDEVBLOK,R4    FREE STORAGE AREA MUST BE REF'D BY R4     00827000
         STH   R5,LINKHALF    STORE MAGIC INDEXER OF 0 ... 24           00828000
         MVI   LINKFLAG,LINKSUBR+JGOTPASS+JLNKPRV  SET NEEDED FLAGBITS  00829000
         LA    R6,LEVLIMIT+1  LINK-LIMIT = 3 FOR DMKLNKSB,     @V407438 00829100
         B     LINK09A        AND NOW GO JOIN COMMON LINK CODE.         00830000
         EJECT                                                          00831000
*        INTERNAL SUBROUTINE TO ASCERTAIN IF A LINK IS FEASIBLE         00832000
*        (AND IF SO, WHAT KIND)                                         00833000
*                                                                       00834000
*        R10 = RETURN REGISTER                                          00835000
*        INDEXER TO DECISION-TABLE IS IN R5 AT EXIT.                    00836000
*                                                                       00837000
LINKSUB  LA    R1,SAVEWRK2    POINT TO USERID,                          00838000
         CALL  DMKLOCK        LOCK HIM WHILE WE'RE DOING INTERNAL CODE  00839000
         BNZ   ERROR116       ERROR IF HE'S ALREADY LOCKED.             00840000
         TM    LINKFLAG,JMYSELF    AM I LINKING TO ONE OF MY DISKS ?    00841000
         BO    LINKSUB1            TRF IF YES.                          00842000
         LA    R1,VMUSER      IF NOT, LOCK MYSELF ALSO                  00843000
         CALL  DMKLOCK                                                  00844000
         BNZ   ERR116P        UH-OH IF SOMEBODY ELSE HAS ME LOCKED.     00845000
LINKSUB1 EQU   *              NOW DETERMINE WHAT LINK(S) THERE ARE:     00846000
         LR    R2,R4          UDEVBLOK TO R2 FOR 'DMKSCNLI'             00847000
         LR    R1,R9          POINTER TO RDEVBLOK INTO R1,              00848000
         CALL  DMKSCNLI       FIND OUT IF THERE ARE ANY EXISTING LINKS  00849000
         LR    R6,R0          REMEMBER COUNT OF READ LINK(S) - IF ANY   00850000
         LR    R7,R1          AND NUMBER OF WRITE LINK(S) IN R7         00851000
         BZ    LINK12A        CC 0 = NO LINKS (GOOD SHOW).              00852000
         ST    R3,SAVEWRK8    REMEMBER VMBLOK ADDR OF POSSIBLE R/O USER 00853000
         USING VDEVBLOK,R2    (R2 POINTS TO VDEVBLOK OF SOME USER)      00854000
         MVC   SAVEWRK9(4),VDEVUSER  REMEMBER VMBLOK ADDR FOR LATER USE 00855000
         DROP  R2             (NOTE - CC FROM DMKSCNLI STILL INTACT)    00856000
         LA    R5,TBLREAD     SET R5 IN CASE THERE ARE READ LINK(S)     00857000
         BC    4,LINK12D      CC 1 = THERE ARE READ LINK(S).            00858000
         LA    R5,TBLWRITE    MUST BE WRITE-LINK(S) THEN.               00859000
LINK12D  TM    LINKFLAG,DETOLD     ANY OLD LINK OF OURS IN THERE?       00860000
         BZ    LINK12         TRF IF NOT - R5 AND COUNTS ARE CORRECT.   00861000
* THE DEVICE WE WANT TO LINK-TO IS ALREADY LINKED TO BY 'MYSELF'        00862000
* RECOMPUTE SITUATION BASED ON THE OLD LINK BEING REMOVED:              00863000
         USING VDEVBLOK,R8                                              00864000
         TM    VDEVFLAG,VDEVRDO    DO WE HAVE A READ OR WRITE-LINK NOW? 00865000
         DROP  R8                                                       00866000
         BO    LINK12C        IT'S A READ-LINK.                         00867000
         BCTR  R1,0           IF WRITE, DECREMENT COUNT OF WRITE-LINKS  00868000
         B     LINK12B        AND CHECK WHAT LINKS WE WOULD HAVE        00869000
LINK12C  BCTR  R0,0           IF READ, DECREMENT COUNT OF READ LINKS    00870000
LINK12B  LA    R5,TBLWRITE    ASSUME SOME WRITE LINK(S)                 00871000
         LTR   R1,R1          WOULD THERE BE ANY WITH MY OLD ONE GONE ? 00872000
         BP    LINK12         YES.                                      00873000
         LA    R5,TBLREAD     ASSUME ONLY READ LINK(S), THEN:           00874000
         LTR   R0,R0          WOULD THERE BE ANY WITH MY OLD ONE GONE ? 00875000
         BP    LINK12         YES.                                      00876000
LINK12A  LA    R5,TBLNONE     GOOD SHOW IF NO LINKS TO WORRY ABOUT.     00877000
LINK12   AH    R5,LINKHALF    ADD ADJUSTER (0, 4, ETC.) TO R5           00878000
         TM    0(R5),NOL      MAYBE NO LINK IS POSSIBLE ?               00879000
         BCR   8,R10          NOPE - LINK LOOKS FEASIBLE - EXIT.        00880000
         B     LINK25         OR UNLOCK USERID & GOTO INDEXED ERR. CODE 00881000
         SPACE                                                          00882000
*        INTERNAL SUBROUTINE TO UNLOCK USERID(S):                       00883000
*        R10 = RETURN REGISTER                                          00884000
*                                                                       00885000
UNLOKSUB TM    LINKFLAG,JMYSELF    WAS I LINKING TO ONE OF MY DISKS ?   00886000
         BO    UNLOKUSR       YES - UNLOCK USERID = MYSELF.             00887000
         LA    R1,VMUSER      NO, UNLOCK MYSELF FIRST                   00888000
         CALL  DMKLOCKD       AND THEN:                                 00889000
*                                                                       00890000
UNLOKUSR LA    R1,SAVEWRK2    UNLOCK THE USERID                         00891000
         CALL  DMKLOCKD                                                 00892000
         BR    R10            AND RETURN TO CALLER.                     00893000
         SPACE                                                          00894000
*        INTERNAL SUBROUTINE TO SET DEFAULT-LINK MODE                   00895000
*        R10 = RETURN-REGISTER                                          00896000
*                                                                       00897000
LINKDEF  SLR   R15,R15           SET R15=0 FOR DEFAULT-MODE OF 'R'      00898000
         TM    LINKFLAG,JMYSELF  IS IT ME ?                             00899000
         BZ    LINKDEF1            IF NOT, USE DEFAULT-MODE OF 'R '     00900000
         IC    R15,UDEVMODE   YES, PICK UP BYTE CONTAINING LINK-MODE    00901000
         LA    R3,31          SET TO ISOLATE THE LOW-ORDER 5 BITS       00902000
         NR    R15,R3         GET THE LINK-MODE (0, 4, 8, ETC.)         00903000
LINKDEF1 STH   R15,LINKHALF   STORE LINK-MODE INDEXER WHERE NEEDED      00904000
         BR    R10            AND EXIT.                                 00905000
         SPACE 2                                                        00906000
CLTO     DC    CL2'TO'        OPTIONAL 'TO'                             00907000
CLAS     DC    CL2'AS'        OPTIONAL 'AS'                             00908000
         SPACE 2                                                        00909000
* TABLE OF LEGITIMATE ONE- OR TWO-BYTE ACCESS MODES:                    00910000
* 1ST HALFWORD = ACCESS MODE                                            00911000
* 2ND HALFWORD = INDEXER FOR DECISION TABLE FOR THAT MODE:              00912000
         SPACE                                                          00913000
MODER    DC    CL2'R ',H'0'   THE FIRST ONE                             00914000
         DC    CL2'RR',H'4'                                             00915000
MODEW    DC    CL2'W ',H'8'                                             00916000
         DC    CL2'WR',H'12'                                            00917000
MODEM    DC    CL2'M ',H'16'                                            00918000
         DC    CL2'MR',H'20'                                            00919000
MODEMW   DC    CL2'MW',H'24'  THE LAST ONE                              00920000
         SPACE                                                          00921000
MODECLC  CLC   0(*-*,R1),0(R3)  TO CHECK COMMAND-LINE MODE VS TABLE     00922000
         EJECT                                                          00923000
*********************************************************************** 00924000
*                                                                       00925000
*              ERROR RETURNS:                                           00926000
*                                                                       00927000
*********************************************************************** 00928000
*                                                                       00929000
LINKFRO1 LA    R15,EMSG101    DASD YYY FORCED R/O; IN R/O USE BY OTHERS 00930000
         BAL   R10,ERRORSB2   INITIALIZE ERROR MESSAGE                  00931000
         LR    R1,R6          NUMBER OF OTHER R/O USERS INTO R1         00932000
         B     LINKFRO3       JOIN COMMON CODE BELOW.                   00933000
         SPACE                                                          00934000
LINKFRO2 LA    R15,EMSG101    DASD YYY FORCED R/O; IN R/W USE BY OTHERS 00935000
         BAL   R10,ERRORSB2   INITIALIZE ERROR MESSAGE                  00936000
         MVI   EMSG101B(R4),C'W'   FILL IN 'W' WHERE NEEDED             00937000
         LA    R1,EMSG102     SET FOR ERROR NUMBER 102                  00938000
         LTR   R6,R6          ANY OTHER R/O USERS ALSO ?                00939000
         BNP   LNKFRO2A       NOPE - NOT THIS TIME.                     00940000
         OI    LINKFLAG,ADDROMSG   IF YES, SIGNAL: ADD R/O MESSAGE      00941000
         LA    R1,EMSG103     AND SET FOR ERROR NUMBER 103              00942000
LNKFRO2A BAL   R10,ERRORSB1   SET CORRECT ERROR NUMBER - 102 OR 103     00943000
         LR    R1,R7          NO. OF OTHER R/W USER(S) INTO R1 NOW      00944000
*                                                                       00945000
LINKFRO3 CL    R1,F1          IS IT JUST ONE USER ?                     00946000
         BH    LINKFRO4       NOPE - MORE THAN ONE - PUT IN THE COUNT.  00947000
         L     R14,SAVEWRK9             PUT THE USERID IN THE MESSAGE   00948000
         MVC   EMSG101C(8,R4),VMUSER-VMBLOK(R14) ...                    00949000
         MVI   EMSG101D(R4),C' '        AND ADD NEEDED BLANK            00950000
         B     LINKFRO5       AND GO PUT IN YYY DEVICE-ADDRESS.         00951000
LINKFRO4 CALL  DMKCVTBD       NUMBER OF USERS TO DECIMAL, PLEASE,       00952000
         STCM  R1,7,EMSG101C(R4)   AND STORE IN MESSAGE                 00953000
LINKFRO5 L     R1,SAVEWRK5    LINK-AS DEVICE ADDRESS INTO R1,           00954000
         CALL  DMKCVTBH       INTO HEX PLEASE,                          00955000
         STCM  R1,7,EMSG101A(R4)   STORE IN MESSAGE                     00956000
         B     GIVERMSG            AND GO GIVE MESSAGE.                 00957000
         SPACE                                                          00958000
NOTLNKRO LA    R15,EMSG104    NOT LINKED - OTHERS HAVE R/O              00959000
         BAL   R10,ERRORSUB   INITIALIZE ERROR MESSAGE                  00960000
         LR    R1,R6          NUMBER OF OTHER R/O USERS INTO R1         00961000
         B     NOTLNK1        JOIN COMMON CODE BELOW.                   00962000
         SPACE                                                          00963000
NOTLNKRW LA    R15,EMSG104    NOT LINKED - OTHERS HAVE READ/WRITE       00964000
         BAL   R10,ERRORSUB   INITIALIZE ERROR MESSAGE                  00965000
         MVI   EMSG104C(R4),C'W'   FILL IN 'W' WHERE NEEDED             00966000
         LA    R1,EMSG105     SET FOR ERROR NUMBER 105                  00967000
         LTR   R6,R6          ANY OTHER R/O USERS ALSO ?                00968000
         BNP   NOTLNK0        NOPE - NOT THIS TIME.                     00969000
         OI    LINKFLAG,ADDROMSG   IF YES, SIGNAL: ADD R/O MESSAGE      00970000
         LA    R1,EMSG106     AND SET FOR ERROR NUMBER 106              00971000
NOTLNK0  BAL   R10,ERRORSB1   SET CORRECT ERROR NUMBER - 105 OR 106     00972000
         LR    R1,R7          NO. OF OTHER R/W USER(S) INTO R1 NOW      00973000
*                                                                       00974000
NOTLNK1  CL    R1,F1          IS IT JUST ONE USER ?                     00975000
         BH    NOTLNK2        NOPE - MORE THAN ONE - PUT IN THE COUNT   00976000
         L     R14,SAVEWRK9             PUT THE USERID IN THE MESSAGE   00977000
         MVC   EMSG104D(8,R4),VMUSER-VMBLOK(R14) ...                    00978000
         MVI   EMSG104E(R4),C' '        AND ADD NEEDED BLANK            00979000
         B     NOTLNK3        AND GO PUT IN THE OTHER FIELDS.           00980000
NOTLNK2  CALL  DMKCVTBD       NUMBER OF USERS TO DECIMAL, PLEASE,       00981000
         STCM  R1,7,EMSG104D(R4)   AND STORE IN MESSAGE                 00982000
NOTLNK3  L     R1,SAVEWRK4    XXX DEVICE TO HEX PLEASE                  00983000
         CALL  DMKCVTBH       ...                                       00984000
         STCM  R1,7,EMSG104B(R4)   AND STORE IN MESSAGE                 00985000
NOTLNK4  MVC   EMSG104A(8,R4),SAVEWRK2  NOW USERID INTO MESSAGE         00986000
* DELETE EXTRA BLANKS (IF ANY) BETWEEN USERID & XXX FIELD:              00987000
         LA    R14,EMSG104A+7(,R4) LOOK BETWEEN USERID & NEXT FIELD     00988000
CLC2BLNK CLC   0(2,R14),BLANKS     TWO BLANKS THERE ?                   00989000
         BNE   GIVERMSG       NOPE - WE'RE ALL READY TO GIVE MESSAGE    00990000
         BCTR  R8,0           DECREMENT LENGTH OF MESSAGE               00991000
         MVC   1(48,R14),2(R14) MOVE REMAINDER OF MSG FORWARD ONE BYTE  00992000
*                             (BYTE COUNT OF 48 IS MORE THAN ENOUGH)    00993000
         BCT   R14,CLC2BLNK   DECREMENT R14 & REPEAT AS NEEDED.         00994000
*                                                                       00995000
GIVERMSG LA    R2,ERRMSG+NORET SET R2 PARM FOR DMKQCNWT                 00996000
         TM    LINKFLAG,LINKSUBR   ASYNC LINK ENTRY ?          @V60C2B8 00996250
         BZ    *+8            NO, THEN MSG IS COMMAND RESPONSE @V60C2B8 00996500
         O     R2,=A(NOTRESP) YES, SET NON-COMMAND RESPONSE MSG@V60C2B8 00996750
         LR    R7,R8          LENGTH OF ERROR MESSAGE INTO R7           00997000
         B     LINK34         AND GO GIVE THE ERROR MESSAGE.            00998000
         SPACE                                                          00999000
ERROR20  LA    R2,20          USERID MISSING OR INVALID                 01000000
         B     ERRNODAT       NO DATA FOR ERROR MESSAGE HANDLER.        01001000
*                                                                       01002000
ERROR22  LA    R2,22          VADDR MISSING OR INVALID                  01003000
ERRNODAT SLR   R1,R1          R1=0 MEANS NO DATA FOR ERROR HANDLER.     01004000
         B     CALERMSG       NOW GO CALL DMKERMSG.                     01005000
         AIF   (NOT &DEDCH).NOTDED2                                     01006000
ERROR137 EQU   *              LINK TO DEDICATED CHANNEL NOT PERMITTED   01007000
         L     R1,SAVEWRK5    GET DEVICE (YYY) ADDRESS                  01008000
         CALL  DMKCVTBH                                                 01009000
         ST    R1,SAVEWRK7    STORE DEVICE ADDRESS                      01010000
         MVI   SAVEWRK7,X'00' DELIMITER                                 01011000
         SLR   R0,R0          ZERO R0                                   01012000
         ST    R0,SAVEWRK8    CLEAR OUT CHANNEL NUMBER FIELD            01013000
         L     R1,SAVEWRK5    GET (YYY) DEVICE ADDRESS                  01014000
         SRL   R1,8           SAVE ONLY CHANNEL NUMBER                  01015000
         CALL  DMKCVTBD       CONVERT IT TO DECIMAL                     01016000
         STH   R1,SAVEWRK8+2  SAVE IT.                                  01017000
         TM    SAVEWRK8+2,X'0F'    IS CHANNEL NUMBER > 9 ?              01018000
         BNZ   *+8            YES - LEAVE IT ALONE                      01019000
         MVI   SAVEWRK8+2,X'00'    NO - PRINT ONLY THE 1 CHARACTER      01020000
         LA    R0,8          LENGTH OF MESSAGE AND                      01021000
         LA    R1,SAVEWRK7    WHERE IT IS.                              01022000
         LA    R2,137         MESSAGE DMKLNK137E                        01023000
         B     CALERMSG       GO PRINT IT.                              01024000
LNK139E  L     R1,SAVEWRK4    XXX ADDRESS                      @V407466 01024100
         CALL  DMKCVTBH       CONVERT ADDRESS                  @V407466 01024200
         STCM  R1,B'0111',SAVEWRK7 CUU                         @V407466 01024300
         MVI   SAVEWRK7+3,BIN0 DELIMITER                       @V407466 01024400
         MVC   SAVEWRK8(6),=CL6'LINKED' CONSTANT 'LINKED'      @V407466 01024500
         LA    R0,L10         MESSAGE LENGTH                   @V407466 01024600
         LA    R2,MSG139      MESSAGE NUMBER                   @V407466 01024700
         LA    R1,SAVEWRK7    BEGINNING OF MESSAGE             @V407466 01024800
         B     CALERMSG       ISSUE MSG 139E                   @V407466 01024900
         SPACE                                                          01025000
.NOTDED2 ANOP                                                           01026000
*                                                                       01027000
ERROR53  LA    R2,53          USERID NOT IN CP DIRECTORY                01028000
*                             (R0 & R1 SET FROM DMKSCNFD)               01029000
CALERMSG ICM   R0,B'1110',DMKLNK+3  'LNK' INTO R0 HIGH 3 BYTES          01030000
         ST    R2,SAVER2      RETURN THE ERROR CODE TO THE CALLER       01031000
         ICM   R2,B'1000',HIGHX80  SET R2 TO RETURN BACK TO ME          01032000
         CALL  DMKERMSG       LET ERROR MESSAGE HANDLER DO THE WORK     01033000
         B     LINKEXIT       AND GO FINISH UP.                         01034000
         SPACE                                                          01035000
ERROR107 DS    0H             GIVEN DEVICE NOT FOUND IN CP DIRECTORY:   01036000
         CALL  DMKUDRRV       LET DMKUDR ROUTINE RELEASE HIS PAGES      01037000
         LA    R15,EMSG107    SET FOR ERROR 107                         01038000
*                                                                       01039000
ERROR14J BAL   R10,ERRORSUB   INITIALIZE ERROR MESSAGE                  01040000
         B     NOTLNK3        NOW GO FILL IN "USERID XXX" FIELDS ETC.   01041000
         SPACE                                                          01042000
ERROR109 DS    0H             USERID XXX INVALID LINK DEVICE            01043000
         LA    R15,EMSG109    SET FOR ERROR 109                         01044000
         B     ERROR14J       NOW GO FILL IN "USERID XXX" FIELDS ETC.   01045000
         SPACE                                                          01046000
ERROR108 DS    0H       USERID XXX NOT LINKED; VOLID DSKLAB NOT MOUNTED 01047000
         LA    R15,EMSG108    SET FOR ERROR MESSAGE 108                 01048000
ERROR117 MVC   SAVEWRK6(6),UDEVVSER  REMEMBER THE DISK-LABEL            01049000
         BAL   R10,ERRORSUB   INITIALIZE ERROR MESSAGE 108 OR 117       01050000
         MVC   EMSG108A(6,R4),SAVEWRK6  FILL IN THE DISK LABEL          01051000
         B     NOTLNK3        AND GO FILL IN "USERID XXX" ETC.          01052000
         SPACE                                                          01053000
ERROR110 DS    0H             YYY DEVICE IS ALREADY "DEFINED"           01054000
*                             (R8 POINTS TO VDEVBLOK OF DEFINED DEV)    01055000
         CALL  DMKSCNVN       GET THE DEVICE NAME                       01056000
         LR    R3,R1          REMEMBER BRIEFLY IN R3                    01057000
         LA    R15,EMSG110    SET FOR ERROR 110                         01058000
         BAL   R10,ERRORSUB   INITIALIZE ERROR MESSAGE                  01059000
         ST    R3,EMSG110A(,R4) NOW STORE DEVICE NAME IN ERROR MESSAGE  01060000
         L     R1,SAVEWRK5    GET YYY DEVICE,                           01061000
         CALL  DMKCVTBH       INTO HEX PLEASE,                          01062000
         STCM  R1,7,EMSG110B(R4)  STORE YYY (HEX) IN MESSAGE            01063000
         B     NOTLNK3        NOW GO FILL IN "USERID XXX" FIELDS ETC.   01064000
         SPACE                                                          01065000
NOPSWRD  DS    0H             NO PASSWORD THERE FOR MODE WANTED:        01066000
         BAL   R10,UNLOKSUB   UNLOCK USERID(S) RIGHT NOW                01067000
         CL    R0,F2          WHAT KIND OF PASSWORD WOULD IT HAVE BEEN? 01068000
         LA    R15,EMSG111    NO READ PASSWORD ?                        01069000
         BL    ERROR14J       CORRECT IF R0 < 2.                        01070000
         LA    R15,EMSG112    NO WRITE PASSWORD ?                       01071000
         BE    ERROR14J       CORRECT IF R0 = 2                         01072000
         LA    R15,EMSG113    NO MULT PASSWORD IF R0 > 2                01073000
         B     ERROR14J       ...                                       01074000
         SPACE                                                          01075000
PASSWRNG BC    1,TERMOFF      BEWARE OF CONDITION-CODE 3 FROM DMKEPSWD  01076000
*                                                                       01077000
         STM   R0,R1,SAVEWRK6 SAVE INVALID PASSWORD            @V60BBBB 01077500
ERROR114 DS    0H             INCORRECT PASSWORD                        01078000
         L     R2,=A(DMKSYSJR) GET ADDRESS OF JPSCBLOK         @V60BBBB 01078150
         USING JPSCBLOK,R2    TELL ASSEMBLER                   @V60BBBB 01078300
         TM    LINKJRL,L'LINKJRLI INVALID-LINK JOURNALING ON?  @V60BBBB 01078450
         BZ    ERR114F        BR IF NOT                        @V60BBBB 01078600
         IC    R14,VMPSWDCT   PICK UP INVALID PASSWORD COUNT   @V60BBBB 01078750
         LA    R14,1(,R14)    INCREMENT BY 1                   @V60BBBB 01078900
         STC   R14,VMPSWDCT   STORE IT BACK                    @V60BBBB 01079050
         LA    R1,SAVEWRK2    POINT AT LINKEE'S USERID FOR     @V60BBBB 01079200
*                             DMKJRLIL                                  01079350
         LA    R2,SAVEWRK4    POINT AT LINKEE'S MINI-DISK      @V60BBBB 01079500
*                             ADDRESS FOR DMKJRLIL                      01079650
         LA    R6,SAVEWRK6    POINT AT INVALID PASSWORD FOR    @V60BBBB 01079800
*                             DMKJRLIL.                                 01079950
         CALL  DMKJRLIL       JOURNAL THE INVALID PASSWORD     @V60BBBB 01080100
         LA    R15,EMSG114    SET FOR ERROR 114                @V60BBBB 01080250
         B     ERROR14J       GO FINISH UP                     @V60BBBB 01080400
         DROP  R2                                              @V60BBBB 01080550
ERR114F  LA    R15,EMSG114    SET FOR ERROR 114                @V60BBBB 01080700
         TM    VMOSTAT,VMVIRCF FROM TERM. OR VIRT. MACHINE?    @V60BBBB 01080850
         BZ    ERROR14J       IF FROM TERMINAL GO FINISH UP MESSAGE.    01081000
         TM    LINKFLAG,JGOTPASS IF NOT, WAS PASSWORD ON COMMAND LINE?  01082000
         BZ    ERROR14J       OK IF NOT - DON'T WORRY ABOUT IT.         01083000
         SLR   R14,R14                                         @V200820 01084000
         IC    R14,VMPSWDCT   PICK UP INVALID PASSWORD COUNT   @V200820 01085000
         LA    R14,1(0,R14)   ...INCREMENT                     @V200820 01086000
         STC   R14,VMPSWDCT   RESET FOR LATER VALIDATION       @V200820 01087000
         B     ERROR14J       NOW GO FINISH UP AND GIVE MESSAGE.        01088000
*                                                                       01089000
ERROR115 DS    0H     EXCESSIVE INCORRECT PASSWORDS HAVE BEEN ENTERED:  01090000
         LA    R0,4           LENGTH OF LINK COMMAND           @VM03198 01091000
         LA    R1,VMCOMND     ADDRESS OF THE COMMAND           @VM03198 01092000
         LA    R2,115         ERROR MESSAGE NUMBER             @VM03198 01093000
         B     CALERMSG       GO TO IT...                      @VM03198 01094000
ERR116P  DS    0H             SOMEBODY HAS A LOCK ON ME:                01097000
         BAL   R10,UNLOKUSR   FIRST UNLOCK THE OTHER LOCK               01098000
*                                 LET "ERROR116" DO ALL THE WORK:       01099000
*                                                                       01100000
ERROR116 DS    0H             USERID EITHER LOCKED IN OR LOGON PROCESS: 01101000
         LA    R15,EMSG116    SET FOR ERROR 116 - CP DIRECTORY IN USE   01102000
         B     ERROR14J       NOW GO FILL IN 'USERID XXX' FIELDS ETC.   01103000
ERROR119 BAL   R10,UNLOKSUB   UNLOCK BOTH USERIDS              @V407466 01103100
         LA    R15,EMSG119    INSUFFICIENT STORAGE MSG         @V407466 01103200
         B     ERROR14J       ISSUE DMKLNK119E MSG             @V407466 01103300
         SPACE                                                          01104000
*        PASSWORD ON COMMAND LINE WITH PASSWORD SUPPRESSION ON.         01104150
ERRORPS  DS    0H                                              @V60BBBB 01104300
         LA    R15,EMSG118    SET FOR COMMAND FORMAT NOT VALID @V60BBBB 01104450
         B     ERROR14J       GO FILL IN FIELDS, ETC.          @V60BBBB 01104600
         SPACE 1                                                        01104750
TERMOFF  DS    0H             CONDITION-CODE 3 FROM DMKEPSWD:           01105000
         L     R1,SAVERETN    RETURN-ADDRESS + 8 FOR DMKCFM             01106000
         LA    R1,8(,R1)      MEANS THIS GUY ALREADY LOGGED OFF         01107000
         ST    R1,SAVERETN    DUE TO TERMINAL HAVING BEEN TURNED OFF.   01108000
         ST    R11,SAVER11    BE SURE TO RETURN CORRECT R11             01109000
         B     LINKEXIT       AND GO EXIT.                              01110000
         SPACE                                                          01111000
ERRORSUB DS    0H     SUBROUTINE TO INITIALIZE ERROR MESSAGES 104 UP:   01112000
         MVC   0(ZZ,R4),COMERMSG   COMMON ERROR MESSAGE TO STORAGE      01113000
         LA    R14,6          LET R14 = 6 TO POINT TO MVMSG104          01114000
         LA    R8,ZZ+1        LET R8 = LENGTH OF COMMON ERROR MESSAGE+1 01115000
ERRORSBJ SR    R1,R1          GET THE ERROR-NUMBER                      01116000
         IC    R1,0(,R15)     ...                                       01117000
         SLR   R2,R2          AND                                       01118000
         IC    R2,1(,R15)     NOW GET THE NUMBER OF BYTES IN THE MSG    01119000
         BCTR  R2,0           LESS 1 FOR EX-MVC                         01120000
         EX    R2,MVMSG101(R14)  MOVE ERROR-MESSAGE TO FREE STORAGE     01121000
         AR    R8,R2          COMPUTE LENGTH FOR CALL TO DMKQCNWT LATER 01122000
ERRORSB1 ST    R1,SAVER2      STORE ERROR-CODE FOR RETURNING TO CALLER  01123000
         CALL  DMKCVTBD       CONVERT ERROR-NUMBER TO DECIMAL,          01124000
         STCM  R1,7,6(R4)     STORE IN NNN PART OF DMKLNKNNN PREFIX     01125000
         BR    R10                 AND RETURN TO CALLER.                01126000
         SPACE                                                          01127000
ERRORSB2 DS    0H     SUBROUTINE TO INITIALIZE ERROR MESSAGES 101-103:  01128000
         MVC   0(11,R4),COMERMSG   FIRST 11 BYTES OF COMMON ERROR MSG   01129000
         MVI   9(R4),C'W'          'W' FOR MESSAGES 101-103             01130000
         SLR   R14,R14        LET R14 = 0 TO POINT TO MVMSG101          01131000
         LA    R8,11+1        LET R8 = LENGTH OF 11-BYTE PREFIX+1       01132000
         B     ERRORSBJ       JOIN ERROR SUBROUTINE INITIALIZER ABOVE.  01133000
*                                                                       01134000
* KEEP THE FOLLOWING TWO IN ORDER:                                      01135000
MVMSG101 MVC   11(*-*,R4),2(R15) TO SET UP ERROR MESSAGES 101-103       01136000
MVMSG104 MVC   ZZ(*-*,R4),2(R15) TO SET UP ERROR MESSAGES 104 UP        01137000
         SPACE                                                          01138000
         DROP  R0,R12                                                   01139000
         EJECT                                                          01140000
         USING DMKLNK,R0    (FOR USE BY S-CONSTANTS)                    01141000
         SPACE                                                          01142000
* FLAG-BIT DEFINITIONS FOR FIRST BYTE OF "DTBL" DECISION-TABLE WORD:    01143000
*                                                                       01144000
NOL      EQU   X'80'          NO LINK CAN BE GIVEN                      01145000
SRO      EQU   X'40'          SET TO READ/ONLY                          01146000
FRO      EQU   X'20'          FORCED TO READ/ONLY                       01147000
SWT      EQU   X'10'          SET TO WRITE                              01148000
GMS      EQU   X'08'          GIVE A MESSAGE                            01149000
*                                                                       01150000
*              (KEEP THE NEXT THREE "AS IS" - 1, 2, AND 3):             01151000
RPS      EQU   X'01'          CHECK READ PASSWORD                       01152000
WPS      EQU   X'02'          CHECK WRITE PASSWORD                      01153000
MPS      EQU   X'03'          CHECK MULT PASSWORD                       01154000
         SPACE                                                          01155000
* THE NEXT BYTE CORRESPONDS TO UDEVMODE BYTE OF UDEVBLOK                01156000
         SPACE                                                          01157000
* THE NEXT HALFWORD IS AN S-CONSTANT "JUMP ADDRESS" TO THE CORRECT CODE 01158000
         SPACE                                                          01159000
         DS    0F       DECISION TABLES FOR DETERMINING LINKING LOGIC:  01160000
*                                                                       01161000
*                                                    EXISTING   MODE    01162000
*              DESIRED LOGIC:                          LINKS  REQUESTED 01163000
*              ----------------------------          -------- --------- 01164000
TBLNONE  DTBL  RPS+SRO,UDEVLR+UDEVLW+UDEVLM,LNKSC      NONE      R      01165000
         DTBL  RPS+SRO,UDEVLR+UDEVLW+UDEVLM,LNKSC      NONE      RR     01166000
         DTBL  WPS+SWT,UDEVLW+UDEVLM,LNKSC             NONE      W      01167000
         DTBL  WPS+SWT,UDEVLW+UDEVLM,LNKSC             NONE      WR     01168000
         DTBL  MPS+SWT,UDEVLM,LNKSC                    NONE      M      01169000
         DTBL  MPS+SWT,UDEVLM,LNKSC                    NONE      MR     01170000
         DTBL  MPS+SWT,UDEVLM,LNKSC                    NONE      MW     01171000
TBLREAD  DTBL  RPS+SRO,UDEVLR+UDEVLW+UDEVLM,LNKSC      READ      R      01172000
         DTBL  RPS+SRO,UDEVLR+UDEVLW+UDEVLM,LNKSC      READ      RR     01173000
         DTBL  NOL,UDEVLW+UDEVLM,NOTLNKRO              READ      W      01174000
         DTBL  WPS+FRO+GMS,UDEVLW+UDEVLM,LINKFRO1      READ      WR     01175000
         DTBL  MPS+SWT+GMS,UDEVLM,LNKRO                READ      M      01176000
         DTBL  MPS+SWT+GMS,UDEVLM,LNKRO                READ      MR     01177000
         DTBL  MPS+SWT+GMS,UDEVLM,LNKRO                READ      MW     01178000
TBLWRITE DTBL  NOL,UDEVLR+UDEVLW+UDEVLM,NOTLNKRW       WRITE     R      01179000
         DTBL  RPS+SRO+GMS,UDEVLR+UDEVLW+UDEVLM,LNKRW  WRITE     RR     01180000
         DTBL  NOL,UDEVLW+UDEVLM,NOTLNKRW              WRITE     W      01181000
         DTBL  WPS+FRO+GMS,UDEVLW+UDEVLM,LINKFRO2      WRITE     WR     01182000
         DTBL  NOL,UDEVLM,NOTLNKRW                     WRITE     M      01183000
         DTBL  MPS+FRO+GMS,UDEVLM,LINKFRO2             WRITE     MR     01184000
         DTBL  MPS+SWT+GMS,UDEVLM,LNKRW                WRITE     MW     01185000
*                                                                       01186000
*------- END OF "LINK" DECISION-TABLE FOR VARIOUS POSSIBLE CASES ------ 01187000
*                                                                       01188000
         USING PSA,R0         RE-ESTABLISH NORMAL PSA USAGE IN R0,      01189000
         USING DMKLNK,R12   AND NORMAL REGULAR ADDRESSABILITY           01190000
*                                                                       01191000
* INDEXING TABLE FOR DETERMINING IF A LINK IS FEASIBLE WITHOUT          01192000
* A PASSWORD - I.E. IF THE ORIGINAL USER ACCESS MODE                    01193000
* IS ADEQUATE FOR THE LINK MODE DESIRED WITHOUT REQUIRING THE           01194000
* ENTERING OF A PASSWORD:                                               01195000
*                                                                       01196000
BYTABLE  DC    2AL1(UDEVLR)   0-1: FOR 'R' & 'RR'                       01197000
         DC    2AL1(UDEVLW)   2-3: FOR 'W' & 'WR'                       01198000
         DC    3AL1(UDEVLM)   4-6: FOR 'M' & 'MR' & 'MW'                01199000
         EJECT                                                          01200000
*                                                                       01201000
*              MESSAGES FOR RETURNING TO USER:                          01202000
*              (SEE "LMSG" MACRO DEFINITION)                            01203000
         SPACE                                                          01204000
* "RESPONSES":                                                          01205000
*                                                                       01206000
*        NOTE - IN THE FOLLOWING, FIELDS INCLUDING $ DENOTE             01207000
*               THAT THEY ARE "FILLED IN" FIELDS.                       01208000
*                                                                       01209000
* KEEP THE NEXT TWO IN ORDER:                                           01210000
RESPON1  DC    C'DASD $Y$ LINKED R/O'                                   01211000
RESPON2  DC    C'; R/O BY N$N USERS'                                    01212000
*                                                                       01213000
RESPON1A EQU   5              DISP. OF YYY FROM RESPON1                 01214000
RESPON1B EQU   18             DISP. OF 'O' OR 'W' FROM RESPON1          01215000
*                                                                       01216000
RESPON2A EQU   L'RESPON1+4    DISP. OF 'O' OR 'W' FROM RESPON1          01217000
RESPON2B EQU   L'RESPON1+9    DISP. OF NNN OR USERID FROM RESPON1       01218000
RESPON2C EQU   RESPON2B+8     DISP. OF NEEDED BLANK AFTER USERID        01219000
         SPACE                                                          01219100
BIN0     EQU   X'00'          DELIMITER                        @V407466 01219200
L10      EQU   10             LENGTH OF MSG 139                @V407466 01219300
MSG139   EQU   139            MESSAGE NUMBER                   @V407466 01219400
         SPACE 2                                                        01220000
* "ERROR MESSAGES":                                                     01221000
*                                                                       01222000
EMSG101  LMSG  101,'DASD $Y$ FORCED R/O; R/O BY N$N USERS'              01223000
EMSG101A EQU   16             DISP. OF YYY FROM BEG. OF MSG             01224000
EMSG101B EQU   34             DISP. OF 'O' OR 'W' FROM BEG. OF MSG.     01225000
EMSG101C EQU   39             DISP. OF NNN OR USERID FROM BEG. OF MSG   01226000
EMSG101D EQU   47             DISP. OF NEEDED BLANK AFTER USERID        01227000
         SPACE                                                          01228000
EMSG102  EQU   102      NO. FOR 'DASD $Y$ FORCED R/O; R/W BY N$N USERS' 01229000
EMSG103  EQU   103            DITTO - BUT ALSO AT LEAST ONE R/O USER    01230000
         SPACE                                                          01231000
COMERMSG DC    C'DMKLNK100E $USERID$ $X$ NOT LINKED; ' COMMON ERROR MSG 01232000
ZZ       EQU   *-COMERMSG     = L'COMERMSG                              01233000
*                                                                       01234000
EMSG104  LMSG  104,'R/O BY $N$ USERS'                                   01235000
EMSG104A EQU   11             DISP. OF 1ST $USERID$ FROM BEG. OF MSG.   01236000
EMSG104B EQU   20             DISP. OF XXX FROM BEG. OF MSG             01237000
EMSG104C EQU   ZZ+2           DISP. OF 'O' OR 'W' FROM BEG. OF MSG.     01238000
EMSG104D EQU   ZZ+7           DISP. OF NNN OR 2ND USERID FROM BEG./MSG  01239000
EMSG104E EQU   ZZ+15          DISP. OF NEEDED BLANK AFTER 2ND USERID    01240000
         SPACE                                                          01241000
EMSG105  EQU   105 NO. FOR '$USERID$ $X$ NOT LINKED; R/W BY $N$ USERS'  01242000
EMSG106  EQU   106            DITTO - BUT ALSO AT LEAST ONE R/O USER    01243000
         SPACE                                                          01244000
EMSG107  LMSG  107,'NOT IN CP DIRECTORY'                                01245000
         SPACE                                                          01246000
EMSG108  LMSG  108,'VOLID DSKLAB NOT MOUNTED'                           01247000
EMSG108A EQU   ZZ+6           DISP. OF DSKLAB FROM BEG. OF MSG          01248000
         SPACE                                                          01249000
EMSG109  LMSG  109,'INVALID LINK DEVICE'                                01250000
         SPACE                                                          01251000
EMSG110  LMSG  110,'DEV  $Y$ ALREADY DEFINED'                           01252000
EMSG110A EQU   ZZ             DISP. OF 'DEV' FROM BEG. OF MSG           01253000
EMSG110B EQU   ZZ+5           DISP. OF YYY DEVICE FROM BEG. OF MSG.     01254000
         SPACE                                                          01255000
EMSG111  LMSG  111,'NO READ PASSWORD'                                   01256000
         SPACE                                                          01257000
EMSG112  LMSG  112,'NO WRITE PASSWORD'                                  01258000
         SPACE                                                          01259000
EMSG113  LMSG  113,'NO MULT PASSWORD'                                   01260000
         SPACE                                                          01261000
EMSG114  LMSG  114,'PASSWORD INCORRECT'                                 01262000
         SPACE                                                          01263000
EMSG116  LMSG  116,'CP DIRECTORY IN USE'                                01264000
         SPACE                                                          01264100
EMSG117  LMSG  117,'VOLID DSKLAB CONFLICT'                              01265000
         SPACE                                                          01265100
EMSG118  LMSG  118,'COMMAND FORMAT NOT VALID'                  @V60BBBB 01265130
         SPACE 1                                                        01265160
EMSG119  LMSG  119,'INSUFFICIENT FREE STORAGE'                 @V407466 01265200
         SPACE                                                          01266000
HIGHX80  DC    X'80'          TO SIGNAL DMKERMSG TO PLEASE RETURN       01267000
         SPACE 2                                                        01268000
LNKLIMIT EQU   10     HOW MANY WRONG PASSWORDS WE'LL TOLERATE FROM V.M. 01269000
*                                                                       01270000
LEVLIMIT EQU   2     PRACTICAL LIMIT (+1) FOR LEVEL OF INDIRECT LINK(S) 01271000
         EJECT                                                          01272000
*.                                                                      01273000
* SUBROUTINE NAME -                                                     01274000
*                                                                       01275000
*        DMKEPSWD - ENTER PASSWORD                                      01276000
*                                                                       01277000
* FUNCTION -                                                            01278000
*                                                                       01279000
*        TO PROMPT THE USER TO ENTER A PASSWORD, TYPE MASKING           01280000
*        CHARACTERS IF APPROPRIATE, READ THE PASSWORD FROM THE          01281000
*        TERMINAL, AND CHECK IT FOR A MATCH.                            01282000
*                                                                       01283000
* ATTRIBUTES -                                                          01284000
*                                                                       01285000
*        REENTRANT, PAGEABLE, CALLED VIA SVC                            01286000
*                                                                       01287000
* ENTRY POINT -                                                         01288000
*                                                                       01289000
*        DMKEPSWD                                                       01290000
*                                                                       01291000
* ENTRY CONDITIONS -                                                    01292000
*                                                                       01293000
*        GPR  0 = 0, 1, 2, OR 3, INDICATING MSG TO BE TYPED AS FOLLOWS: 01294000
*                                0 = 'ENTER PASSWORD'                   01295000
*                                1 = 'ENTER READ PASSWORD'              01296000
*                                2 = 'ENTER WRITE PASSWORD'             01297000
*                                3 = 'ENTER MULT PASSWORD'              01298000
*        GPR  0 = 4, 5, 6, OR 7, INDICATING THE SAME FOUR               01298200
*                      MESSAGES AS ABOVE, BUT ALSO REQUESTING           01298400
*                      THAT IF AN INVALID PASSWORD IS ENTERED           01298600
*                      IT BE RETURNED IN REGISTERS 0 & 1.               01298800
*        GPR  1 = ADDRESS OF 8-BYTE PASSWORD TO BE COMPARED             01299000
*        GPR 11 = ADDRESS OF USER'S VMBLOK                              01300000
*        GPR 12 = ADDRESS OF DMKEPSWD                                   01301000
*        GPR 13 = ADDRESS OF STANDARD SAVE AREA                         01302000
*                                                                       01303000
* EXIT CONDITIONS -                                                     01304000
*                                                                       01305000
*        CC = 0 IF PASSWORD MATCHES                                     01306000
*        CC = 1 OR 2 IF 'PASSWORD INCORRECT'                            01307000
*        CC = 3 IF PERMANENT ERROR ON TERMINAL                          01308000
*                                                                       01309000
* CALLS TO OTHER ROUTINES -                                             01310000
*                                                                       01311000
*        DMKFREE  - OBTAIN FREE STORAGE                                 01312000
*        DMKQCNWT - SEND PROMPTING MESSAGE TO TERMINAL                  01313000
*        DMKQCNRD - READ PASSWORD FROM TERMINAL                         01314000
*        DMKDSPCH - GO TO 'DISPATCH' WHILE AWAITING PASSWORD            01315000
*        DMKSCNFD - GET PASSWORD FROM TERMINAL INPUT LINE               01316000
*        DMKFRET  - RETURN FREE STORAGE                                 01317000
*                                                                       01318000
* EXTERNAL REFERENCES -                                                 01319000
*                                                                       01320000
*        NONE                                                           01321000
*                                                                       01322000
* TABLES / WORK AREAS -                                                 01323000
*                                                                       01324000
*        VMBLOK                                                         01325000
*        TERMINAL RDEVBLOK                                              01326000
         EJECT                                                          01327000
* REGISTER USAGE -                                                      01328000
*                                                                       01329000
*        GPR 4 & 5 HOLD PASSWORD TO BE COMPARED AGAINST (FROM CALLER)   01330000
*        GPR  8 = ADDRESS OF TERMINAL RDEVBLOK                          01331000
*        GPR  9 = ADDRESS OF COMMAND BUFFER                             01332000
*        GPR 11 = VMBLOK ADDRESS                                        01333000
*        GPR 12 = BASE REGISTER                                         01334000
*        GPR 13 = ADDRESS OF STANDARD SAVE AREA                         01335000
*                                                                       01336000
*        GPRS 0-3 AND 14-15 ARE WORK REGISTERS.                         01337000
*                                                                       01338000
*        GPRS 6-7 AND 10 ARE NOT USED.                                  01339000
*                                                                       01340000
* NOTES -                                                               01341000
*                                                                       01342000
*        NONE                                                           01343000
         EJECT                                                          01344000
* OPERATION -                                                           01345000
*                                                                       01346000
*        1.  SAVES PASSWORD TO BE COMPARED AGAINST IN TWO REGISTERS;    01347000
*        TYPES PROMPTING MESSAGE SPECIFIED BY GPR 0 AT INPUT -          01348000
*        EITHER 'ENTER PASSWORD', 'ENTER READ PASSWORD',                01349000
*        'ENTER WRITE PASSWORD', OR 'ENTER MULT PASSWORD'.              01350000
*                                                                       01351000
*        2.  CALLS DMKFREE TO GET A BUFFER INTO WHICH TO READ THE       01352000
*        PASSWORD.  IF THE TERMINAL IS A TELETYPE, OR IF THE            01353000
*        TERMINAL RDEVBLOK INDICATES THAT THE TERMINAL DOES NOT         01354000
*        HAVE A PRINT-INHIBIT FEATURE, 'MASKING' CHARACTERS OF          01355000
*        OVERPRINTED H'S, S'S, AND *'S ARE TYPED ON THE TERMINAL        01356000
*        AFTER THE PROMPTING MESSAGE.  OTHERWISE, A "BY-PASS" OR        01357000
*        PRINT-INHIBIT CHARACTER IS SENT TO THE TERMINAL VIA DMKQCNWT.  01358000
*        FOR A 3215-TYPE TERMINAL (WHERE NEITHER PRINT-INHIBIT,         01359000
*        BACKSPACE, NOR LINE-FEED WITHOUT CARRIAGE RETURN IS            01360000
*        AVAILABLE), A SIMPLE MASKING LINE OF "XXXXXXXX" IS             01361000
*        ALWAYS GIVEN.                                                  01362000
*                                                                       01363000
*        3.  DMKQCNRD IS CALLED TO HAVE THE PASSWORD ENTERED, AND       01364000
*        CONTROL IS THEN TRANSFERRED TO DMKDSPCH, WITH THE RETURN       01365000
*        SPECIFIED TO COME BACK TO STEP 4 WHEN THE PASSWORD HAS BEEN    01366000
*        ENTERED.                                                       01367000
*                                                                       01368000
*        4.  WHEN THE PASSWORD HAS BEEN ENTERED, DMKEPSWD CHECKS FOR    01369000
*        A PERMANENT ERROR ON THE TERMINAL (WHICH COULD OCCUR, FOR      01370000
*        EXAMPLE, IF THE USER TURNED OFF THE TERMINAL INSTEAD OF        01371000
*        ENTERING THE PASSWORD, OR IF THE COMMUNICATIONS LINE OPENED);  01372000
*        IF SO, RETURNS THE FREE STORAGE AND EXITS TO THE CALLER WITH   01373000
*        A CONDITION-CODE 3.                                            01374000
*                                                                       01375000
*        IF THERE WAS NO PROBLEM OF THIS KIND, DMKEPSWD CHECKS FOR      01376000
*        A ZERO BYTE COUNT (I.E. NULL LINE WAS ENTERED).  IF YES, GOES  01377000
*        TO STEP 9.                                                     01378000
*                                                                       01379000
*        5.  OTHERWISE, BLANK-FILLS AN EIGHT-BYTE AREA (SAVEWRK6) AND   01380000
*        CALLS DMKSCNFD TO OBTAIN THE PASSWORD.  IF THE LINE WAS BLANK, 01381000
*        GOES TO STEP 9.  IF THE PASSWORD WAS MORE THAN 8 BYTES,        01382000
*        TREATS AS AN ERROR (RETURNS CONDITION-CODE 2 TO THE CALLER     01383000
*        IN STEP 8 AFTER RETURNING THE FREE STORAGE IN STEP 7).         01384000
         EJECT                                                          01385000
*        6.  IF THE PASSWORD IS NOT NULL, AND NO MORE THAN 8 BYTES,     01386000
*        THEN IT IS SAVED (IN SAVEWRK6) FOR COMPARING WITH THAT         01387000
*        PROVIDED AT ENTRY, JUST BEFORE RETURN IS MADE IN STEP 8.       01388000
*                                                                       01389000
*        7.  THE FREE STORAGE USED FOR THE INPUT BUFFER IS NOW RETURNED 01390000
*        VIA A CALL TO DMKFRET.                                         01391000
*                                                                       01392000
*        8.  FINALLY, THE PASSWORD ENTERED IS COMPARED AGAINST THE      01393000
*        PASSWORD PROVIDED BY THE CALLER, AND EXIT IS IMMEDIATELY MADE  01394000
*        TO THE CALLER, WITH THE CONDITION-CODE SET FROM THE COMPARE.   01395000
*                                                                       01396000
*        9.  IF A NULL OR BLANK LINE WAS ENTERED, THEN THE MASKING      01397000
*        CHARACTERS ARE TYPED FOR EITHER TELETYPE OR OTHER TERMINAL,    01398000
*        AND REJOINS MAIN LOGIC AT STEP 3 ABOVE, TO HAVE THE USER       01399000
*        AGAIN ENTER THE PASSWORD.  (FOR A 3215-TYPE TERMINAL, A        01400000
*        SIMPLE MASKING LINE OF "XXXXXXXX" IS GIVEN TO PROMPT THE       01401000
*        USER TO RE-ENTER THE PASSWORD.)                                01402000
*                                                                       01403000
* PROMPTING MESSAGES:                                                   01404000
*                                                                       01405000
*        'ENTER PASSWORD'                                               01406000
*        'ENTER READ PASSWORD'                                          01407000
*        'ENTER WRITE PASSWORD'                                         01408000
*        'ENTER MULT PASSWORD'                                          01409000
*.                                                                      01410000
         EJECT                                                          01411000
*********************************************************************** 01412000
*                                                                       01413000
*                             DMKEPSWD                                  01414000
*                                                                       01415000
*********************************************************************** 01416000
         SPACE                                                          01417000
         ENTRY DMKEPSWD       "ENTER PASSWORD" ENTRY                    01418000
         SPACE                                                          01419000
         USING DMKEPSWD,R12                                             01420000
DMKEPSWD ENTER                "ENTER PASSWORD" ENTRY                    01421000
         TM    VMOSTAT,VMKILL IS THE USER BEING LOG OFF?                01422000
         BO    SETCC3         YES--EXIT WITH CC=3                       01423000
         LM    R4,R5,0(R1)         SAVE PASSWORD TO BE CHECKED AGAINST  01424000
         MVI   SAVEWRK1,X'00' INITIALIZE INVALID PASSWORD      @V60BBBB 01424100
*                             RETURN FLAG.                              01424200
         C     R0,F4          RETURN INVALID PASSWORD?         @V60BBBB 01424300
         BL    NOPASRET       BR IF NOT                        @V60BBBB 01424400
         OI    SAVEWRK1,RETPASS TURN ON FLAG TO CAUSE ANY      @V60BBBB 01424500
*                             INVALID PASSWORD TO BE RETURNED.          01424600
         S     R0,F4          GET REGISTER BACK TO THE RANGE   @V60BBBB 01424700
*                             UNDERSTOOD BY FOLLOWING CODE.             01424800
NOPASRET DS    0H                                              @V60BBBB 01424900
         LTR   R2,R0          R0 INTO R2 AND SET CONDITION-CODE         01425000
         MSG   'ENTER PASSWORD:'   (TENTATIVELY)                        01426000
         BZ    ENTP02              TRF IF R0 WAS 0 - REGULAR PASSWORD.  01427000
         MSG   'ENTER READ PASSWORD:'   (TENTATIVELY)                   01428000
         S     R2,F2               (R2) - 2 GIVES US CLUE TO R0         01429000
         BM    ENTP02              TRF IF R0 WAS 1.                     01430000
         MSG   'ENTER WRITE PASSWORD:'  (TENTATIVELY)                   01431000
         BZ    ENTP02              TRF IF R0 WAS 2.                     01432000
         MSG   'ENTER MULT PASSWORD:'   (R0 MUST HAVE BEEN 3)           01433000
*                                                                       01434000
ENTP02   L     R2,=A(NOTRESP)      SET NON-COMMAND MSG         @V60C2B8 01434600
         CALL  DMKQCNWT,PARM=NORET(,R2)      PROMPT USER       @V60C2B8 01435200
         LA    R0,BUFSIZE     NOW WE NEED AN INPUT BUFFER               01436000
         CALL  DMKFREE        GET ONE FOR THE PASSWORD                  01437000
         LR    R9,R1          INTO R9 THE ADDRESS SHALL GO              01438000
ENTP03   EQU   *              READ THE PASSWORD                @V200820 01439000
         LA    R0,BUFINLTH-2  SET EXPECTED INPUT COUNT                  01440000
         CALL  DMKQCNRD,PARM=(EDIT+UCASE+INHIBIT)              @V200730 01441000
         BZ    ENTP04         ALL O.K. - CHECK COUNT           @VA04462 01442150
         C     R2,F8          ATTN OR LINE DROP?               @VA04462 01442300
         BH    ENTP13         LINE DROP - EXIT GRACEFULLY      @VA04462 01442450
         B     ENTP03         RETRY THE READ                   @VA04462 01442600
         EJECT                                                          01442750
ENTP04   EQU   *              CHECK FOR VALID INPUT COUNT      @VA04462 01442900
         LTR   R2,R0          BE CAREFUL OF ZERO INPUT COUNT   @V200820 01443000
         BNP   ENTP03         TRY AGAIN IF NULL LINE           @V200820 01444000
         USING BUFFER,R9                                                01445000
         STM   R1,R2,BUFNXT   STORE POINTER AND COUNT FOR SCANFLD       01446000
         MVC   SAVEWRK6(8),BLANKS  BLANK-FILL WHERE WE WILL PUT PASSWRD 01447000
         CALL  DMKSCNFD       GET THE PASSWORD                          01448000
         BNZ   ENTP03         TRY AGAIN IF NULL INPUT          @V200820 01449000
         LR    R15,R0                                                   01452000
         BCTR  R15,0                                                    01453000
         N     R15,F7         MOVE NO MORE THAN 8 BYTES        @V60BBBB 01453500
         EX    R15,SAVEPASS   SAVE 8-BYTE BLANK-FILLED PASSWORD         01454000
         C     R0,F8          NO MORE THAN 8 BYTES, PLEASE     @V60BBBB 01454300
         BH    PASSFRET       CONSIDER PASSWORD INCORRECT IF > @V60BBBB 01454600
PASSFRET LA    R0,BUFSIZE     NOW GIVE BACK THE INPUT BUFFER            01455000
         LR    R1,R9          ...                                       01456000
         CALL  DMKFRET        ...                                       01457000
         CL    R4,SAVEWRK6    WELL, DOES THE PASSWORD MATCH ?           01458000
         BNE   PASSCHK1       TRF IF NOT.                      @V60BBBB 01459000
         CL    R5,SAVEWRK6+4  IF 1ST HALF MATCHES, CHECK 2ND HALF       01460000
         BE    PASSEXIT       RETURN IF ALL'S WELL             @V60BBBB 01460200
PASSCHK1 BALR  R2,0           SAVE CONDITION CODE              @V60BBBB 01460400
         TM    SAVEWRK1,RETPASS SHOULD INVALID PASSWORD BE     @V60BBBB 01460600
*                             RETURNED?                                 01460800
         BZ    PASSCHK2       BR IF NOT                        @V60BBBB 01461000
         MVC   SAVER0(L'UDIRPASS),SAVEWRK6 RETURN INVALID PSWD.@V60BBBB 01461200
PASSCHK2 SPM   R2             RESTORE CONDITION CODE           @V60BBBB 01461400
PASSEXIT DS    0H             EXIT WITH CONDITION-CODE SET     @V60BBBB 01461600
         EXIT                 FROM COMPARE.                    @V60BBBB 01461800
*                                                                       01462000
* FATAL ERROR FROM TERMINAL ON ENTRY OF PASSWORD:                       01463000
ENTP13   LA    R0,BUFSIZE     GIVE BACK THE FREE STORAGE BUFFER         01464000
         LR    R1,R9          ...                                       01465000
         CALL  DMKFRET        ...                                       01466000
SETCC3   ST    R11,SAVER11    BESURE TO RETURN CORRECT R11              01467000
         TM    FFS,X'FF'      SET CONDITION-CODE 3                      01468000
         EXIT                 AND EXIT FORTHWITH.                       01469000
         DROP  R9,R12                                          @V200820 01470000
         EJECT                                                          01471000
*        EXECUTED INSTRUCTIONS AND CONSTANTS:                           01472000
*                                                                       01473000
SAVEID   MVC   SAVEWRK2(*-*),0(R1)      TO SAVE USERID                  01474000
*                                                                       01475000
SAVEPASS MVC   SAVEWRK6(*-*),0(R1)      TO SAVE THE PASSWORD            01476000
*                                                                       01477000
RETPASS  EQU   X'80'                    FLAG BIT IN SAVEWRK1   @V60BBBB 01477200
*                                       WHICH INDICATES ANY             01477400
*                                       INVALID PASSWORDS ARE           01477600
*                                       TO BE RETURNED.                 01477800
         LTORG                                                          01478000
         EJECT                                                          01479000
         COPY  SAVE           (R13)                                     01480000
*                                                                       01481000
*        SCRATCH-STORAGE IN 'SAVEAREA' USED BY LINK:                    01482000
*                                                                       01483000
*        SAVEWRK2-3 CONTAIN  USERID                                     01484000
*        SAVEWRK4   CONTAINS XXX (DISK TO BE LINKED TO)                 01485000
*        SAVEWRK5   CONTAINS YYY (DISK TO BE LINKED AS)                 01486000
*        SAVEWRK6-7 CONTAIN  PASSWORD IF INCLUDED WITH LINK COMMAND     01487000
*        SAVEWRK8-9 HOLDS USERID OF ANY USER FOUND LINKED TO DEVICE     01488000
*                                                                       01489000
*        SAVEWRK1 (CLEARED AT THE BEGINNING) IS USED AS FOLLOWS:        01490000
*                                                                       01491000
LINKFLAG EQU   SAVEWRK1       ONE BYTE:                                 01492000
*                                                                       01493000
JMYSELF  EQU   X'80'          IT'S ME  (USERID = MYSELF OR '* ')        01494000
JGOTPASS EQU   X'40'          WE'VE ALREADY GOT THE PASSWORD            01495000
DETOLD   EQU   X'20'          DETACH OLD LINK BEFORE DOING NEW ONE:     01496000
LINKSUBR EQU   X'10'          INDICATES "LINK SUBROUTINE" INVOKED       01497000
ADDROMSG EQU   X'08'          "R/O BY NNN USERS" SUFFIX TO BE ADDED     01498000
JLNKPRV  EQU   X'04'          LINK PRIVILEGE - ORIGINAL UDEVBLOK MINE   01499000
SSENT    EQU   X'02'          ENTRY AT DMKLNKSS AFTER MSS MOUNT@V60B6B8 01499150
PASSALL  EQU   X'01'          PASSWORD WAS 'ALL' - DON'T       @V60BBBB 01499300
*                              JOURNAL THIS LINK.                       01499450
RC4      EQU   4                                               @V60B6B8 01499600
MSGPROC  EQU   X'10'          FLAG IN MSSCOM: MSC DONE, PCI NOT@VMI2018 01499750
*                                                                       01500000
LINKMODE EQU   SAVEWRK1+1     COPY OF UDEVMODE FROM ORIGINAL UDEVBLOK   01501000
*                                                                       01502000
LINKHALF EQU   SAVEWRK1+2     HALFWORD "INDEXER" TO DECISION TABLE      01503000
         EJECT                                                          01504000
OSVSCOM  MSSCOM                                                @V60B6B8 01504300
DMKLNK   CSECT                                                 @V60B6B8 01504600
         PSA            (R0)                                            01505000
         JPSCBLOK                                              @V60BBBB 01505500
         COPY  VMBLOK         (R11)                                     01506000
         COPY  RBLOKS                                                   01507000
         COPY  VBLOKS                                                   01508000
         COPY  UDIRECT        (R4)                                      01509000
         COPY  EQU                                                      01510000
         COPY  DEVTYPES                                                 01511000
         COPY  CONBUF                                                   01512000
         END                                                            01513000