PER      TITLE 'DMKPER     (CP)        VM/370 - RELEASE 6'              00001000
DMKPER   START                                                          00002000
         USING VMBLOK,11                                                00003000
         DC    CL8'DMKDUMMY'                                            00004000
         SPACE                                                          00005000
         ENTRY DMKPERCH,DMKPERT,DMKPERIL                                00006000
         SPACE                                                          00007000
DMKPERCH EQU   *              COMMAND ENTRY                             00008000
         SLR   2,2            RETURN CODE ZERO                          00009000
         SVC   12             EXIT                                      00010000
         SPACE                                                          00011000
DMKPERIL EQU   *              INTERRUPT ENTRY                           00012000
         NI    VMPEND,X'FF'-VMPERPND                                    00013000
DMKPERT  EQU   *              RESET ENTRY                               00014000
         NI    VMTRCTL,X'FF'-VMTRPER                                    00015000
         SVC   12             EXIT                                      00016000
         EJECT                                                          00017000
         COPY  VMBLOK                                                   00018000
         END   DMKPER                                                   00019000