RND      TITLE 'DMKRND     (CP)        VM/370 - RELEASE 6'              00001000
         ISEQ  73,80          VALIDATE SERIALIZATION OF INPUT  @V200899 00002000
*.                                                                      00003000
* SUBROUTINE NAME -                                                     00004000
*                                                                       00005000
*        DMKRND                                                         00006000
*                                                                       00007000
* FUNCTION -                                                            00008000
*                                                                       00009000
*        DMKRND IS THE INTERFACE BETWEEN THE VM/370 DUMP SPOOL FILE     00010000
*        AND THE OS-SSP DUMP FORMAT PROGRAM FOR PRINTING AND FORMAT-    00011000
*        TING DUMPS OF THE 3704 AND 3705 COMMUNICATIONS CONTROLLERS     00012000
*                                                                       00013000
* ATTRIBUTES -                                                          00014000
*                                                                       00015000
*        NON-REUSEABLE, INVOKED VIA NCPDUMP COMMAND IN CMS              00016000
*                                                                       00017000
* COMMAND LINE FORMAT -                                                 00018000
*                                                                       00019000
*   +---------+------------------------------------------------------+  00020000
*   |         |                                                      |  00021000
*   | NCPDUMP | <DUMPNN> <(<ERASE> <NOFORM> <MNEMONIC> <NCPBUFF><)>> |  00022000
*   |         |                                                      |  00023000
*   +---------+------------------------------------------------------+  00024000
*                                                                       00025000
* ENTRY CONDITIONS -                                                    00026000
*                                                                       00027000
*        GR15 = ADDRESS OF DMKRND (NCPDUMP)                             00028000
*        GR14 = RETURN ADDRESS TO CMS MONITOR                           00029000
*        GR13 = ADDRESS OF 18-WORD SAVEAREA                             00030000
*        GR 1 = ADDRESS OF CMS PARAMETER BUFFER                         00031000
*                                                                       00032000
* EXIT CONDITIONS -                                                     00033000
*                                                                       00034000
*        GR0-14 RESTORED                                                00035000
*        GR15 = RETURN CODE (SEE MESSAGES) OR ZERO (SUCCESSFUL)         00036000
*                                                                       00037000
* CALLS TO OTHER ROUTINES -                                             00038000
*                                                                       00039000
*        FSSTATE - TO DETERMINE THE EXISTENCE OF A CMS FILE             00040000
*        FSERASE - TO ERASE A TEMPORARY OR WORK FILE                    00041000
*        FSWRITE - TO CREATE OR ADD TO A CMS DISK FILE                  00042000
*        FILEDEF - TO SPECIFY OS-SIMULATION DDNAMES FOR IFLDUMP         00043000
*        LINEDIT - TO BUILD AND TYPE INFORMATION MESSAGES               00044000
*        IFLDUMP - OS-SSP DUMP PROCESSOR FOR 3704/3705 CCU'S            00045000
*                                                                       00046000
* EXTERNAL REFERENCES -       NONE                                      00047000
*                                                                       00048000
* TABLES / WORK AREAS -       NONE                                      00049000
*                                                                       00050000
* NOTES -                                                               00051000
*                                                                       00052000
*        USE IS MADE OF THE DIAGNOSE CODE X'0034' TO READ 4096-BYTE     00053000
*        SPOOL RECORDS FROM THE DUMP FILE CREATED BY VM/370 CP.         00054000
         EJECT                                                          00055000
* REGISTER USAGE -                                                      00056000
*                                                                       00057000
*        GR14-15 LINKAGE REGISTERS                                      00058000
*        GR13 = SAVEAREA BASE ADDRESSABILITY                            00059000
*        GR12 = MODULE BASE ADDRESSABILITY                              00060000
*        GR11 = FSCB DSECT ADDRESSABILITY                               00061000
*        GR0-10 ARE WORK REGISTERS                                      00062000
*                                                                       00063000
* OPERATION -                                                           00064000
*                                                                       00065000
*        1. IF NO DUMP FILE WAS SPECIFIED ('DUMPNN' OMITTED), THE       00066000
*           DIAGNOSE X'0034' IS USED TO READ A DUMP SPOOL FILE ONTO     00067000
*           THE CMS PRIMARY DISK. A CHECK IS MADE FOR EXISTING FILES    00068000
*           WITH THE NAME 'DUMPNN NCPDUMP', WHERE 'NN' GOES FROM        00069000
*           '00' TO '09'. THE NEW DUMP FILE IS GIVEN THE FIRST SUCH     00070000
*           NAME WHICH DOES NOT ALREADY EXIST. AN INFORMATION MSG       00071000
*           IS TYPED INFORMING THE USER OF WHICH FILE WAS CREATED.      00072000
*                                                                       00073000
*        2. FOR EACH 4096-BYTE SPOOL RECORD, EIGHT 512-BYTE RECORDS     00074000
*           ARE WRITTEN INTO THE CMS DISK FILE.                         00075000
*                                                                       00076000
*        3. AFTER THE CMS FILE HAS BEEN CREATED, THE CMS FILEDEF        00077000
*           FUNCTION IS USED TO SETUP THE DDNAME SPECIFICATIONS         00078000
*           EXPECTED BY IFLDUMP. THE CMS 'COMPSWT' IS USED TO FORCE     00079000
*           A CMS 'LOADMOD' WHEN THE OS LINK MACRO IS USED TO           00080000
*           EXECUTE THE IFLDUMP PROGRAM. ALL DUMP OUTPUT IS DIRECTED    00081000
*           TO THE VIRTUAL SPOOL PRINTER. A SINGLE-ITEM TEMPORARY       00082000
*           FILE IS CREATED TO PASS A CONTROL RECORD TO THE DUMP        00083000
*           PROCESSOR, AND THIS FILE IS ERASED FOLLOWING THE DUMP.      00084000
*                                                                       00085000
* RESPONSES -                                                           00086000
*                                                                       00087000
*        'DUMPNN NCPDUMP' FILE CREATED.                                 00088000
*        'DUMPNN NCPDUMP' FILE ERASED.                                  00089000
*                                                                       00090000
         EJECT                                                          00091000
* ERROR MESSAGES -                                                      00092000
*                                                                       00093000
*        DMKRND850I UNABLE TO READ DUMP FROM READER                     00094000
*              RETURN CODE = 21                                         00095000
*                                                                       00096000
*        DMKRND851I TEN DUMP FILES ALREADY EXIST                        00097000
*              RETURN CODE = 22                                         00098000
*                                                                       00099000
*        DMKRND852I FATAL I/O ERROR WRITING DUMP                        00100000
*              RETURN CODE = FROM FSWRITE MACRO                         00101000
*                                                                       00102000
*        DMKRND853I NO DUMP FILES EXIST                                 00103000
*              RETURN CODE = 23                                         00104000
*                                                                       00105000
*        DMKRND861I FILE 'DUMPNN NCPDUMP' NOT FOUND                     00106000
*              RETURN CODE = 28                                         00107000
*                                                                       00108000
*        DMKRND863I INVALID PARAMETER - 'PARAMETER'                     00109000
*              RETURN CODE = 24                                         00110000
*                                                                       00111000
*        DMKRND870I UNABLE TO CREATE CONTROL FILE FOR IFLDUMP           00112000
*              RETURN CODE = 16                                         00113000
*.                                                                      00114000
         EJECT                                                          00115000
DMKRND   START 0                                               @V200899 00116000
         ENTRY NCPDUMP                                         @V200820 00117000
         REGEQU                                                @V200899 00118000
NCPDUMP  DS    0D             370X DUMP PROCESSOR INTERFACE    @V200820 00119000
         STM   R14,R12,12(R13)     SAVE INPUT REGISTERS        @V200820 00120000
         LR    R12,R15        USE GR12 AS MODULE BASE          @V200820 00121000
         USING NCPDUMP,R12                                     @V200820 00122000
         LA    R14,SAVEAR     POINT TO MY SAVE AREA            @V200820 00123000
         ST    R13,4(0,R14)   BACK POINTER                     @V200820 00124000
         ST    R14,8(0,R13)   FWD POINTER                      @V200820 00125000
         LR    R13,R14        . . .                            @V200820 00126000
         SPACE 2                                                        00127000
*---------------------------------------------------------------------* 00128000
*        DETERMINE DUMP FILENAME SPECIFIED (IF ANY)                   * 00129000
*---------------------------------------------------------------------* 00130000
         USING DFSCB,R11                                       @V200820 00131000
         LA    R11,OUTFSCB     POINT TO THE DUMP FILE FSCB     @V200820 00132000
         LA    R4,8(0,R1)       MOVE PNTR TO 2ND PLIST ENTRY   @V200820 00133000
         CLC   DUMP(4),0(R4)  IS THIS A 'DUMPNN' FILENAME ?    @V200820 00134000
         BNE   TESTOPT        BR IF NO - TEST OPTIONS          @V200899 00135000
         MVC   FSCBFN(8),0(R4)   MOVE DEFINED FILE NAME TO FSCB@V200820 00136000
         LA    R4,8(0,R4)       MOVE PNTR PAST FILE NAME       @V200820 00137000
TESTOPT  DS    0H                                              @V200899 00138000
         CLI   0(R4),C'('     IS THIS THE START OF THE OPTIONS @V200899 00139000
         BE    OPTIONS        BR IF YES                        @V200899 00140000
         CLC   FFS(8),0(R4)      END OF OPTIONS ?              @V200899 00141000
         BE    OPTEND         BR IF YES                        @V200899 00142000
         B     OPTERROR       INVALID PARAMETER - ERROR        @V200820 00143000
         SPACE                                                          00144000
*---------------------------------------------------------------------* 00145000
*              ANALYZE SPECIFIED INPUT PARAMETERS                     * 00146000
*---------------------------------------------------------------------* 00147000
OPTIONS  DS    0H                                              @V200899 00148000
         LA    R4,8(0,R4)       MOVE PNTR TO NXT PARAMETER     @V200899 00149000
         CLC   FFS(8),0(R4)      END OF OPTIONS ?              @V200899 00150000
         BE    OPTEND         BR IF YES                        @V200899 00151000
         CLI   0(R4),C')'     IS THIS THE END OF OPTIONS       @V200899 00152000
         BE    OPTEND         BR IF YES                        @V200899 00153000
         LA    R3,OPTLIST     LOAD ADDR OF OPTION LIST         @V200899 00154000
         LA    R6,L'OPTLIST   LENGTH OF OPTION LIST ENTRY      @V200899 00155000
         LA    R7,OPTLEND     ENDING ADDR OF OPTION LIST       @V200899 00156000
OPTLOOP  DS    0H                                              @V200899 00157000
         CLC   0(8,R3),0(R4)  VALID OPTION FOUND               @V200899 00158000
         BE    OPTFND         BR IF YES                        @V200899 00159000
         BXLE  R3,R6,OPTLOOP  LOOP UNTIL END OF LIST           @V200899 00160000
         B     OPTERROR       IF FALL-THRU INVALID PARM        @V200899 00161000
OPTFND   DS    0H                                              @V200899 00162000
         MVI   8(R3),X'01'    SET OPTION 'ON'                  @V200899 00163000
         B     OPTIONS                                         @V200899 00164000
         EJECT                                                          00165000
*---------------------------------------------------------------------* 00166000
*        FIND THE FIRST 'DUMPNN NCPDUMP' FILEID AVAILABLE             * 00167000
*---------------------------------------------------------------------* 00168000
OPTEND   DS    0H                                              @V200899 00169000
         CLC   DUMP(4),FSCBFN    WAS FILE NAME DEFINED         @V200899 00170000
         BE    STRTDUMP       BR IF YES                        @V200899 00171000
         MVC   FSCBFN(8),DUMP     LOOK FOR AVAILABLE FILE      @V200899 00172000
         SLR   R3,R3                                           @VM08836 00173000
         ICM   R3,2+1,DUMP+4  CHARACTER '00' FOR DUMP FNAME    @VM08836 00174000
         LA    R6,10(0)       MAXIMUM NUMBER OF DUMP FILES     @VM08836 00175000
LOOKLOOP DS    0H                                              @V200899 00176000
         FSSTATE  FSCB=OUTFSCB,ERROR=READNXT   JUMP WHEN FOUND @V200820 00177000
         LA    R3,1(0,R3)       BUMP TO NXT NAME               @V200820 00178000
         STH   R3,FSCBFN+4    STORE NXT SEQUENCE NAME          @V200899 00179000
         BCT   R6,LOOKLOOP    SEARCH FOR A FREE NAME           @VM08836 00180000
         SPACE 2                                                        00181000
NODUMP   DS    0H             TEN DUMP FILES ALREADY EXIST     @V200820 00182000
         WRTERM  'DMKRND851I TEN DUMP FILES ALREADY EXIST',    @V200820*00183000
               COLOR=R        TYPE ERROR MESSAGE IN RED        @V200820 00184000
         LA    R15,22(0)      ERROR RETURN CODE                @V200820 00185000
         ST    R15,SVREG15    SET FOR EXIT                     @V200820 00186000
         B     RETURN                                          @V200820 00187000
         EJECT                                                          00188000
*---------------------------------------------------------------------* 00189000
*              READ DUMP SPOOL FILE DATA INTO CMS DISK FILE           * 00190000
*---------------------------------------------------------------------* 00191000
READNXT  DS    0H             READ SPOOL FILE VIA DIAGNOSE     @V200820 00192000
         MSG   'SPOOL 00C CLASS E'      NCPDUMP = CLASS E      @V200820 00193000
         DC    X'83100008'    SETUP READER CLASS FOR DUMP      @V200820 00194000
         LTR   R0,R0          WAS SPOOL CMD SUCCESSFUL ?       @VM08584 00195000
         BNZ   UNAREAD        NO -- CANNOT READ THE DUMP       @VM08584 00196000
         L     R6,INPUTAD     ADDRESS OF 4096-BYTE BUFFER      @V200820 00197000
         LA    R7,X'00C'      STANDARD CARD-READER ADDRESS     @V200820 00198000
         DC    X'83670034'    READ SYSTEM DUMP SPOOL FILE      @V200820 00199000
         BC    1,UNAREAD      CANNOT READ THE DUMP FILE        @V200820 00200000
         BC    2,NODFILE      NO DUMP FILES EXIST              @V200820 00201000
         BC    4,EODFILE      END OF FILE REACHED (?)          @V200820 00202000
         SPACE 2                                                        00203000
         LA    R2,8(0,0)      NUMBER OF 512'S IN 4096          @V200820 00204000
         STH   R2,FSCBNOR     WRITE EIGHT RECORDS AT ONCE      @V200820 00205000
         MVC   FSCBLRL(4),=A(4096)      BUFFER SIZE = 4096     @V200820 00206000
         B     DUMPWRT        WRITE THE FIRST 4K RECORD        @VM08584 00207000
         SPACE                                                          00208000
SPOOLRD  DS    0H             READ FROM SPOOL, WRITE TO DISK   @V200820 00209000
         DC    X'83670034'    READ ANOTHER RECORD (GR6,7 OK)   @V200820 00210000
         BC    4+2,EODFILE    END OF FILE REACHED              @V200820 00211000
         BC    1,UNAREAD      I/O ERROR READING DUMP FILE      @V200820 00212000
         SPACE                                                          00213000
DUMPWRT  DS    0H             WRITE EIGHT 512-BYTE RECORDS     @VM08584 00214000
         FSWRITE  FSCB=OUTFSCB,BUFFER=(R6),ERROR=WRITERR       @V200820 00215000
         B     SPOOLRD        READ FROM CP ONCE MORE           @V200820 00216000
         EJECT                                                          00217000
*---------------------------------------------------------------------* 00218000
*              CLOSE CMS FILE AND SPOOL READER FILE                   * 00219000
*---------------------------------------------------------------------* 00220000
EODFILE  DS    0H             END OF DUMP FILE REACHED         @V200820 00221000
         FSCLOSE  FSCB=OUTFSCB     CLOSE THE DUMPNN FILE       @V200820 00222000
         LINEDIT  TEXT='''.................'' FILE CREATED',   @V200820*00223000
               SUB=(CHAR8A,OUTFSCB+8)                          @V200820 00224000
         SPACE                                                          00225000
         MSG   'CLOSE 00C'    CLOSE THE READER FILE            @V200820 00226000
         DC    X'83100008'    . . .                            @V200820 00227000
*        B     STRTDUMP       SETUP FOR IFLDUMP EXECUTION      @V200820 00228000
         EJECT                                                          00229000
*---------------------------------------------------------------------* 00230000
*        BUILD CONTROL FILE FOR IFLDUMP PROCESSING ROUTINE            * 00231000
*---------------------------------------------------------------------* 00232000
STRTDUMP DS    0H                                              @V200899 00233000
         MVC   NAMEFIL1(8),FSCBFN       NAME FOR SYSUT2 FILEDEF@V200820 00234000
         MVC   NAMEFIL2(8),FSCBFN       NAME FOR SYSIN FILEDEF @V200820 00235000
         MVC   SYSINAM(8),FSCBFN        NAME IN CONTROL RECORD @V200820 00236000
         LA    R11,SYSFSCB    POINT TO CONTROL-FILE FSCB       @V200820 00237000
         MVC   FSCBFN(8),SYSINAM   FILENAME FOR CONTROL FILE   @V200820 00238000
         FSSTATE  FSCB=OUTFSCB,ERROR=FILENOT    CHECK FOR DUMPN@V200820 00239000
         SPACE                                                          00240000
         CLI   NOFORM+8,X'00' HAS NOFORM BEEN SPECIFIED        @V200899 00241000
         BE    *+8            NO -- LEAVE IT 'YES'             @V200820 00242000
         MVI   FORMOPT,C'N'   SET PARAMETER TO NOFORM          @V200899 00243000
         CLI   MNEMONIC+8,X'00'    MENMONICS REQUESTED ?       @V200820 00244000
         BE    *+8                 NO -- LEAVE IT AS IS        @V200820 00245000
         MVI   MNEMOPT,C'Y'   SET PARAMETER TO MNEMONICS       @V200899 00246000
         CLI   NCPBUFF+8,X'00'     FORMAT NCP BUFFER POOL?     @V366838 00246250
         BE    *+8            NOPE -- LEAVE OPTION AS IS       @V366838 00246500
         MVI   BUFFOPT,C'Y'   YES -- SET UP THE ARG.           @V366838 00246750
         FSERASE  FSCB=SYSFSCB     ERASE ANY OLD SYSIN FILE    @V200899 00247000
         FSWRITE  FSCB=SYSFSCB,ERROR=CTLFERR                   @V200899 00248000
*        B     LINKDMP        GO SETUP FOR IFLDUMP             @V200820 00249000
         EJECT                                                          00250000
*---------------------------------------------------------------------* 00251000
*        ISSUE FILEDEF COMMANDS FOR IFLDUMP DDNAME DEFINITIONS        * 00252000
*---------------------------------------------------------------------* 00253000
LINKDMP  DS    0H                                              @V200820 00254000
         LA    R1,FILEDEF1    ADDR OF 1-ST FILE DEF            @V200899 00255000
         SVC   202            DEFINE 'SYSUT2' DDNAME           @V200820 00256000
         DC    AL4(FILDERR)   ERROR RETURN ADDRESS             @V200820 00257000
         SPACE                                                          00258000
         LA    R1,FILEDEF2    ADDR OF 2-ND FILE DEF            @V200899 00259000
         SVC   202            DEFINE 'SYSIN' DDNAME            @V200820 00260000
         DC    AL4(FILDERR)   ERROR RETURN ADDRESS             @V200820 00261000
         SPACE                                                          00262000
         LA    R1,FILEDEF3    ADDR OF 3-RD FILE DEF            @V200899 00263000
         SVC   202            DEFINE 'SYSPRINT' DDNAME         @V200820 00264000
         DC    AL4(FILDERR)   ERROR RETURN ADDRESS             @V200820 00265000
         SPACE                                                          00266000
         GETMAIN  R,LV=X'5000'    SIZE OF LONGEST IFLDUMP PATH @VA12806 00267100
         LR    R10,R1         SAVE ADDRESS FOR LATER RELEASE   @V200820 00268000
         SPACE                                                          00269000
         COMPSWT ON           SET SWITCH TO LOADMOD IFLDUMP    @V200820 00270000
         SPACE 2                                                        00271000
         LA    R1,DUMPARAS    ADDR OF DUMMY PARAMETER LIST     @V200899 00272000
         LINK  EP=IFLDUMP     LINK TO OS IFLDUMP               @V200820 00273000
         ST    R15,SVREG15    SAVE RETURN CODE                 @V200899 00274000
         EJECT                                                          00275000
         FREEMAIN  R,LV=X'5000',A=(R10) RELEASE GOTTEN STORAGE @VA12806 00276100
         L     R15,SVREG15    RESTORE RETURN CODE FROM IFLDUMP @V200820 00277000
         LTR   R15,R15        TEST RETURN CODE FOR 00          @V200899 00278000
         BNZ   RETURN                                          @V200899 00279000
         CLI   ERASE+8,X'00'  WAS ERASE REQUESTED              @V200899 00280000
         BE    RETURN         BR IF ERASE NOT REQUESTED        @V200899 00281000
         FSERASE  FSCB=OUTFSCB     ERASE THE DUMPNN FILE       @V200820 00282000
         LINEDIT  TEXT='''.................'' FILE ERASED',    @V200820*00283000
               SUB=(CHAR8A,OUTFSCB+8)   FILE ERASED MESSAGE    @V200820 00284000
         B     RETURN                                          @V200899 00285000
         EJECT                                                          00286000
*---------------------------------------------------------------------* 00287000
*                ERROR MESSAGES AND ERROR HANDLING                    * 00288000
*---------------------------------------------------------------------* 00289000
         PRINT NOGEN                                                    00290000
OPTERROR DS    0H             INVALID OPTION                   @V200820 00291000
         LINEDIT  TEXT='DMKRND863I INVALID PARAMETER - ''........''',  *00292000
               SUB=(CHAR8A,(R4))   TYPE ERROR MESSAGE          @V200820 00293000
         LA    R15,24(0)      RETURN CODE = 24                 @V200820 00294000
         ST    R15,SVREG15    PASS ALONG FOR EXIT              @V200820 00295000
         B     RETURN                                          @V200820 00296000
         SPACE                                                          00297000
UNAREAD  DS    0H             UNABLE TO READ DUMP FILE         @V200820 00298000
         WRTERM  'DMKRND850I UNABLE TO READ DUMP FROM READER', @V200820*00299000
               COLOR=R        TYPE ERROR IN RED                @V200820 00300000
         FSCLOSE  FSCB=OUTFSCB     CLOSE FILE FOR PARTIAL DUMP @V200820 00301000
         LA    R15,21(0)      ERROR RETURN CODE                @V200820 00302000
         ST    R15,SVREG15    PASS ALONG FOR EXIT              @V200820 00303000
         B     RETURN                                          @V200820 00304000
         SPACE                                                          00305000
WRITERR  DS    0H             FATAL I/O ERROR WRITING DUMP     @V200820 00306000
         ST    R15,SVREG15    PASS WRBUF ERROR RETURN CODE     @V200820 00307000
         WRTERM  'DMKRND852I FATAL I/O ERROR WRITING DUMP',    @V200820*00308000
               COLOR=R        TYPE ERROR MESSAGE IN RED        @V200820 00309000
         FSCLOSE  FSCB=OUTFSCB     CLOSE FILE FOR PARTIAL DUMP @V200820 00310000
         B     RETURN         RETURN CODE IS ALL SET           @V200820 00311000
         SPACE                                                          00312000
FILENOT  DS    0H             DUMP FILE NOT FOUND              @V200820 00313000
         LINEDIT  TEXT='DMKRND861I FILE ''.................'' NOT FOUND*00314000
               ',SUB=(CHAR8A,OUTFSCB+8)   FILE NOT FOUND MSG   @V200820 00315000
         LA    R15,28(0)      ERROR RETURN CODE                @V200820 00316000
         ST    R15,SVREG15    PASS IT ALONG FOR RETURN         @V200820 00317000
         B     RETURN                                          @V200820 00318000
         SPACE                                                          00319000
CTLFERR  DS    0H             UNABLE TO BUILD CONTROL FILE     @V200820 00320000
         WRTERM  'DMKRND870I UNABLE TO CREATE CONTROL FILE FOR IFLDUMP'*00321000
               ,COLOR=R       ERROR MESSAGES ARE RED           @V200820 00322000
         LA    R15,16(0)      ERROR RETURN CODE                @V200820 00323000
         ST    R15,SVREG15    PASS IT ALONG                    @V200820 00324000
         B     RETURN                                          @V200820 00325000
         SPACE                                                          00326000
NODFILE  DS    0H             NO DUMP FILES IN THE READER      @V200820 00327000
         WRTERM  'DMKRND853I NO DUMP FILES EXIST',COLOR=R      @V200820 00328000
         LA    R15,23(0)      ERROR RETURN CODE                @V200820 00329000
         ST    R15,SVREG15    PASS IT ALONG                    @V200820 00330000
         B     RETURN                                          @V200820 00331000
         SPACE                                                          00332000
FILDERR  DS    0H             ERROR IN CALL TO FILEDEF         @V200820 00333000
         ST    R15,SVREG15    PASS ALONG FILEDEF ERROR         @V200820 00334000
         PRINT GEN                                             @V200820 00335000
         EJECT                                                          00336000
*---------------------------------------------------------------------* 00337000
*              ERASE CONTROL FILE, RETURN TO CMS MONITOR              * 00338000
*---------------------------------------------------------------------* 00339000
RETURN   DS    0H                                              @V200899 00340000
         FSERASE FSCB=SYSFSCB      ERASE DUMPNN SYSIN FILE     @V200820 00341000
         MSG   'CLOSE PRT'    CLOSE THE SPOOL PRINTER          @V200820 00342000
         DC    X'83100008'    VIA CP CONSOLE FUNCTION          @V200820 00343000
         L     R13,4(0,R13)   BACK POINTER TO SAVEAREA         @V200820 00344000
         L     R14,12(0,R13)  RETURN ADDRESS                   @V200820 00345000
         L     R15,SVREG15    RETURN CODE TO GR15              @V200820 00346000
         LM    R0,R12,12(R13)      RESTORE REGISTERS           @V200820 00347000
         BR    R14                                             @V200899 00348000
         EJECT                                                          00349000
*---------------------------------------------------------------------* 00350000
*        CONSTANTS, LITERALS, BUFFERS, AND CONTROL DATA AREAS         * 00351000
*---------------------------------------------------------------------* 00352000
DUMP     DC    C'DUMP',C'00  '     DUMPNN FILENAME SKELETON    @V200899 00353000
         DS    0H             1 OF 2                           @V200899 00354000
DMPNMEND DC    C'09'          HALF. BDRY END LOOKING FOR FILE  @V200899 00355000
FFS      DC    X'FFFFFFFFFFFFFFFF'      DBL-WD OF X'FF'        @V200820 00356000
         SPACE 3                                                        00357000
*---------------------------------------------------------------------* 00358000
*              PARAMETER LIST OPTION SEARCH TABLE                     * 00359000
*---------------------------------------------------------------------* 00360000
OPTLIST  DS    0CL9           OPTION KEYWORD & SWITCH          @V200899 00361000
ERASE    DC    C'ERASE   ',X'00'                               @V200899 00362000
NOFORM   DC    C'NOFORM  ',X'00'                               @V200899 00363000
MNEMONIC DC    C'MNEMONIC',X'00'                               @V200899 00364000
NCPBUFF  DC    C'NCPBUFF ',X'00'                               @V366838 00364500
OPTLEND  EQU   *              END OF PARM'S                    @V200899 00365000
         SPACE 2                                                        00366000
*---------------------------------------------------------------------* 00367000
*        IFLDUMP DUMMY PARAMETER LIST                                 * 00368000
*---------------------------------------------------------------------* 00369000
DUMPARAS DS    0F                                              @V200899 00370000
         DC    X'80000000'    NO PARAMETERS PASSED             @V200820 00371000
         EJECT                                                          00372000
*---------------------------------------------------------------------* 00373000
*        CMS COMMANDS                                                 * 00374000
*---------------------------------------------------------------------* 00375000
FILEDEF1 DS    0D             FILEDEF FOR SYSUT2               @V200820 00376000
         DC    CL8'FILEDEF '                                   @V200899 00377000
         DC    CL8'SYSUT2  '                                   @V200899 00378000
         DC    CL8'DISK    '                                   @V200899 00379000
NAMEFIL1 DC    CL8'        '                                   @V200899 00380000
         DC    CL8'NCPDUMP '                                   @V200899 00381000
         DC    CL8'A1      '                                   @V200899 00382000
         DC    CL8'(',CL8'RECFM',CL8'F'                        @V200820 00383000
         DC    CL8'BLOCK',CL8'512'                             @V200820 00384000
         DC    CL8'XTENT',CL8'513'                             @V200820 00385000
         DC    X'FFFFFFFFFFFFFFFF'                             @V200899 00387000
         SPACE 2                                                        00388000
FILEDEF2 DS    0D             FILEDEF FOR SYSIN                @V200899 00389000
         DC    CL8'FILEDEF '                                   @V200899 00390000
         DC    CL8'SYSIN   '                                   @V200899 00391000
         DC    CL8'DISK    '                                   @V200899 00392000
NAMEFIL2 DC    CL8'        '                                   @V200899 00393000
         DC    CL8'SYSIN   ',CL8'A1      '                     @V200899 00394000
         DC    X'FFFFFFFFFFFFFFFF'                             @V200899 00395000
         SPACE 2                                                        00396000
FILEDEF3 DS    0D             FILEDEF FOR SYSPRINT             @V200899 00397000
         DC    CL8'FILEDEF '                                   @V200899 00398000
         DC    CL8'SYSPRINT'                                   @V200820 00399000
         DC    CL8'PRINTER'                                    @V200820 00400000
         DC    X'FFFFFFFFFFFFFFFF'                             @V200899 00401000
         SPACE 2                                                        00402000
*---------------------------------------------------------------------* 00403000
*              CONTROL CARD SKELETON FOR IFLDUMP PROCESSOR            * 00404000
*---------------------------------------------------------------------* 00405000
SYSINREC DS    0CL80                                           @V200899 00406000
SYSINAM  DC    CL8'        '                                   @V200899 00407000
         DC    C' DUMP'                                        @V200899 00408000
         DC    C' FORMAT='                                     @V200899 00409000
FORMOPT  DC    C'Y'                                            @V200899 00410000
         DC    C',MNEMONIC='                                   @V200899 00411000
MNEMOPT  DC    C'N'                                            @V200899 00412000
         DC    C',BUF='                                        @V366838 00413250
BUFFOPT  DC    C'N'                                            @V366838 00413500
         DC    41C' '                                          @V366838 00413750
         EJECT                                                          00414000
*---------------------------------------------------------------------* 00415000
*              FILE SYSTEM CONTROL BLOCKS                             * 00416000
*---------------------------------------------------------------------* 00417000
OUTFSCB  FSCB  'X NCPDUMP A1',BUFFER=INPUT,BSIZE=512           @V200820 00418000
         SPACE 2                                                        00419000
SYSFSCB  FSCB  'DUMPNN SYSIN A1',BUFFER=SYSINREC,BSIZE=80      @V200820 00420000
         SPACE 2                                                        00421000
SVREG15  DC    F'0'           RETURN CODE HOLD FIELD           @V200820 00422000
SAVEAR   DS    18F            STANDARD OS-FORMAT SAVEAREA      @V200820 00423000
         SPACE                                                          00424000
         LTORG                                                 @V200899 00425000
         EJECT                                                          00426000
*---------------------------------------------------------------------* 00427000
*          SPOOL INPUT BUFFER AND DISK OUTPUT BUFFER                  * 00428000
*---------------------------------------------------------------------* 00429000
INPUTAD  DC    A(INPUT)       ADDR OF INPUT/OUTPUT AREA        @V200899 00430000
         ORG   DMKRND+4096    START BUFFER ON PAGE BOUNDARY    @V200899 00431000
INPUT    DS    CL4096' '      OUTPUT & INPUT THE SAME FIELD    @V200899 00432000
         SPACE 3                                                        00433000
*---------------------------------------------------------------------* 00434000
*              FILE SYSTEM CONTROL BLOCK DEFINITION                   * 00435000
*---------------------------------------------------------------------* 00436000
         SPACE                                                          00437000
DFSCB    DSECT ,              FILE SYSTEM CONTROL BLOCK        @V200820 00438000
FSCBCMD  DS    CL8            COMMAND NAME (FUNCTION)          @V200820 00439000
FSCBFN   DS    CL8            FILENAME                         @V200820 00440000
FSCBFT   DS    CL8            FILETYPE                         @V200820 00441000
FSCBFM   DS    CL2            FILEMODE                         @V200820 00442000
FSCBITM  DS    1H             RELATIVE ITEM NUMBER             @V200820 00443000
FSCBBUF  DS    1F             BUFFER ADDRESS                   @V200820 00444000
FSCBLRL  DS    1F             BUFFER SIZE IN BYTES             @V200820 00445000
FSCBFMT  DS    CL2            RECORD FORMAT (F/V)              @V200820 00446000
FSCBNOR  DS    1H             NUMBER OF ITEMS                  @V200820 00447000
FSCBINC  DS    1F             NUMBER OF BYTES ACTUALLY READ    @V200820 00448000
         DS    1F                                              @V200820 00449000
         SPACE 2                                               @V200820 00450000
         END   DMKRND                                          @V200820 00451000