TBM      TITLE 'DMKTBM     (CP)        VM/370 - RELEASE 6'              00001000
         ISEQ  73,80          VALIDATE SEQUENCING OF SYSIN     @VM03172 00002000
*.                                                                      00003000
* MODULE NAME -                                                         00004000
*                                                                       00005000
*        DMKTBM                                                         00006000
*                                                                       00007000
* FUNCTION -                                                            00008000
*                                                                       00009000
*        TERMINAL TRANSLATE TABLES FOR APL                              00010000
*                                                                       00011000
* CONTENTS -                                                            00012000
*                                                                       00013000
*        DMKTBMZO - APL 3270 COMPOUND WRITE TRANSLATION                 00014000
*        DMKTBMZI - APL 3270 COMPOUND READ TRANSLATION                  00015000
*        DMKTBMMO - EBCDIC -> APL CORRESPONDENCE TERMINAL CODE          00016000
*        DMKTBMMI - APL CORRESPONDENCE TERMINAL CODE -> EBCDIC          00017000
*        DMKTBMNO - EBCDIC -> APL PTTC/EBCD TERMINAL CODE               00018000
*        DMKTBMNI - APL PTTC/EBCD TERMINAL CODE -> EBCDIC               00019000
*        DMKTBMTO - TEXT 3270 COMPOUND WRITE TRANSLATION                00019300
*        DMKTBMTI - TEXT 3270 COMPOUND READ TRANSLATION                 00019600
*                                                                       00020000
* ATTRIBUTES -                                                          00021000
*                                                                       00022000
*        NON-EXECUTABLE, PAGEABLE,CALLED VIA SVC                        00023000
*                                                                       00024000
*.                                                                      00025000
         EJECT                                                          00026000
DMKTBM   CSECT                                                 @VM03172 00027000
         SPACE 3                                                        00028000
         ENTRY DMKTBMZO                                        @VM03172 00029000
         ENTRY DMKTBMZI                                        @VM03172 00030000
         ENTRY DMKTBMMO,DMKTBMMI                               @VM03172 00031000
         ENTRY DMKTBMNO,DMKTBMNI                               @VM03172 00032000
         ENTRY DMKTBMTO,DMKTBMTI                               @V387398 00032500
         EJECT                                                          00033000
*                                                                       00033300
*        EBCDIC COMPOUND CHARACTERS -> 3270 APL                         00033600
*                                                                       00034000
DMKTBMZO EQU   *                                               @VM03172 00035000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00036000
         DC    X'00000000000000000000000000000000' 00          @VM03172 00037000
         DC    X'0000000000000000000000BCAC00ABBB' 10          @V387398 00038000
         DC    X'8D9D8E8C00000000000000008FBF0000' 20          @V387398 00039000
         DC    X'B0B1B2B3B415B6B7B81900BD00ADBEAE' 30          @V387398 00040000
         DC    X'00818283848586878889000000000000' 40          @VM03172 00041000
         DC    X'00919293949596979899000000000000' 50          @VM03172 00042000
         DC    X'0000A2A3A4A5A6A7A8A9000000000000' 60          @VM03172 00043000
         DC    X'006AC38A9AAABAA16B00000000000000' 70          @V387398 00044000
         DC    X'7B00000000000000000000C200000000' 80          @VA04773 00045500
         DC    X'0000000000000000000000009B001E00' 90          @V387398 00046300
         DC    X'00000000000000000000000000000000' A0          @VA04773 00047100
         DC    X'00000000009F000000AF000000000000' B0          @V387398 00048000
         DC    X'900000000000000000004A4B004E004F' C0          @V387398 00048900
         DC    X'A0000000000000000000D2D3D6D75A5B' D0          @V387398 00049800
         DC    X'000000000000000000005E5F00E2E3E6' E0          @VM03172 00051000
         DC    X'0000000000000000000000C6F3C7E700' F0          @VM03172 00052000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00053000
         EJECT                                                          00054000
*                                                                       00055000
*        3270 APL ->EBCDIC COMPOUND CHARACTER TABLE                     00056000
*                                                                       00057000
DMKTBMZI EQU   *                                               @VM03172 00058000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00059000
         DC    X'40404040404040404040404040404040' 00          @VM03172 00060000
         DC    X'40404040403540404039404040409E40' 10          @V387398 00061000
         DC    X'40404040404040404040404040404040' 20          @VM03172 00062000
         DC    X'40404040404040404040404040404040' 30          @VM03172 00063000
         DC    X'40404040404040404040CACB4040CDCF' 40          @VM03172 00064000
         DC    X'40404040404040404040DEDF4040EAEB' 50          @VM03172 00065000
         DC    X'40404040404040404040717840404040' 60          @VM03172 00066000
         DC    X'40404040404040404040408040404040' 70          @VA04773 00067500
         DC    X'4041424344454647484973402320222C' 80          @V387398 00068400
         DC    X'C0515253545556575859749C402140B5' 90          @V387398 00069300
         DC    X'D0776263646566676869751E1C3D3FB9' A0          @V387398 00070200
         DC    X'30313233344036373840761F1B3B3E2D' B0          @V387398 00071100
         DC    X'40408B724040FBFD4040404040404040' C0          @VM03172 00072000
         DC    X'4040DADB4040DCDD4040404040404040' D0          @VM03172 00073000
         DC    X'4040EDEE4040EFFE4040404040404040' E0          @VM03172 00074000
         DC    X'404040FC404040404040404040404040' F0          @VM03172 00075000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00076000
         EJECT                                                          00077000
*                                                                       00078000
*        EBCDIC -> APL CORRESPONDENCE TERMINAL CODE                     00079000
*                                                                       00080000
DMKTBMMO EQU   *                                               @VM03172 00081000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00082000
         DC    X'01010101017A7C7F0101010101010101' 00          @VM03172 00083000
         DC    X'5E010101585B5D5E0101010101010101' 10          @VM03172 00084000
         DC    X'01010101383B3D3E0101010101010101' 20          @VM03172 00085000
         DC    X'0101010101011C010101010101010101' 30          @VM03172 00086000
         DC    X'018284908D8E9693E464014587EB76C3' 40          @VM03172 00087000
         DC    X'01D7A9CAA0F3A6CCD1400101E8C9EE01' 50          @VM03172 00088000
         DC    X'F670C0CFD2AAE2B2E1B16B6E01E78BED' 60          @VM03172 00089000
         DC    X'4995A3AFC6B7A5F00101C50101AC8801' 70          @VM03172 00090000
         DC    X'01010101010101010101010101010101' 80          @VM03172 00091000
         DC    X'01010101010101010101010101010101' 90          @VM03172 00092000
         DC    X'01010101010101010101010101010101' A0          @VM03172 00093000
         DC    X'01010101010101010101010101010101' B0          @VM03172 00094000
         DC    X'014F372F2A296762324C010101010101' C0          @VM03172 00095000
         DC    X'01612C31432551686D4A010101010101' D0          @VM03172 00096000
         DC    X'01015220264657237315010101010101' E0          @VM03172 00097000
         DC    X'1302040710080D0B0E16010101010101' F0          @VM03172 00098000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00099000
         EJECT                                                          00100000
*                                                                       00101000
*        APL CORRESPONDENCE TERMINAL CODE -> EBCDIC                     00102000
*                                                                       00103000
DMKTBMMI EQU   *                                               @VM03172 00104000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00105000
         DC    X'4040F140F24040F3F54040F740F6F840' 00          @VM03172 00106000
         DC    X'F44040F040E9F9404040404036404037' 10          @VM03172 00107000
         DC    X'E34040E740D5E44040C5C440D24040C3' 20          @VM03172 00108000
         DC    X'40D3C840404040C24040404040404040' 30          @VM03172 00109000
         DC    X'594040D4404BE5404070D940C94040C1' 40          @VM03172 00110000
         DC    X'40D6E240404040E64040401540164040' 50          @VM03172 00111000
         DC    X'40D1C740494040C6D740406A40D86B40' 60          @VM03172 00112000
         DC    X'614040E840404E404040054006404040' 70          @VM03172 00113000
         DC    X'404041404240404C7E40406E40444540' 80          @VM03172 00114000
         DC    X'43404047407146404040404036404037' 90          @VM03172 00115000
         DC    X'5440407240765640405265407D404073' A0          @VM03172 00116000
         DC    X'40696740404040754040404040404040' B0          @VM03172 00117000
         DC    X'6240404F407A7440405D534057404063' C0          @VM03172 00118000
         DC    X'40586440404040514040401540164040' D0          @VM03172 00119000
         DC    X'406866404840406D5C40404D406F5E40' E0          @VM03172 00120000
         DC    X'77404055404060404040054006404040' F0          @VM03172 00121000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00122000
         EJECT                                                          00123000
*                                                                       00124000
*        EBCDIC -> APL PTTC/EBCD TERMINAL CODE                          00125000
*                                                                       00126000
DMKTBMNO EQU   *                                               @VM03172 00127000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00128000
         DC    X'01010101017A7C7F0101010101010101' 00          @VM03172 00129000
         DC    X'5E010101585B5D5E0101010101010101' 10          @VM03172 00130000
         DC    X'01010101383B3D3E0101010101010101' 20          @VM03172 00131000
         DC    X'0101010101011C010101010101010101' 30          @VM03172 00132000
         DC    X'018284888D909395E161017687D740C9' 40          @VM03172 00133000
         DC    X'01ACEBD2A6B1A9F3CC200101CF96B701' 50          @VM03172 00134000
         DC    X'C023A0E2A5E8EEF0C3C6573701ED8ED1' 60          @VM03172 00135000
         DC    X'16B2AFE7AAE4CAA30101F60101C58B01' 70          @VM03172 00136000
         DC    X'01010101010101010101010101010101' 80          @VM03172 00137000
         DC    X'01010101010101010101010101010101' 90          @VM03172 00138000
         DC    X'01010101010101010101010101010101' A0          @VM03172 00139000
         DC    X'01010101010101010101010101010101' B0          @VM03172 00140000
         DC    X'01626467686B6D6E7073010101010101' C0          @VM03172 00141000
         DC    X'01434546494A4C4F5152010101010101' D0          @VM03172 00142000
         DC    X'01012526292A2C2F3132010101010101' E0          @VM03172 00143000
         DC    X'15020407080B0D0E1013010101010101' F0          @VM03172 00144000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00145000
         EJECT                                                          00146000
*                                                                       00147000
*        APL PTTC/EBCD TERMINAL CODE -> EBCDIC                          00148000
*                                                                       00149000
DMKTBMNI EQU   *                                               @VM03172 00150000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00151000
         DC    X'4040F140F24040F3F44040F540F6F740' 00          @VM03172 00152000
         DC    X'F84040F940F070404040404036404037' 10          @VM03172 00153000
         DC    X'5940406140E2E34040E4E540E64040E7' 20          @VM03172 00154000
         DC    X'40E8E9404040406B4040402540264040' 30          @VM03172 00155000
         DC    X'4E4040D140D2D34040D4D540D64040D7' 40          @VM03172 00156000
         DC    X'40D8D9404040406A4040401540161740' 50          @VM03172 00157000
         DC    X'4049C140C24040C3C44040C540C6C740' 60          @VM03172 00158000
         DC    X'C84040C940404B404040054006404007' 70          @VM03172 00159000
         DC    X'404041404240404C4340407E40446E40' 80          @VM03172 00160000
         DC    X'4540404640475D404040404036404037' 90          @VM03172 00161000
         DC    X'62404077406454404056744051404072' A0          @VM03172 00162000
         DC    X'405571404040405E4040402540264040' B0          @VM03172 00163000
         DC    X'60404068407D6940404F76405840405C' C0          @VM03172 00164000
         DC    X'406F53404040404D4040401540161740' D0          @VM03172 00165000
         DC    X'404863407540407365404052406D6640' E0          @VM03172 00166000
         DC    X'6740405740407A404040054006404007' F0          @VM03172 00167000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00168000
         EJECT                                                          00168020
*                                                                       00168040
*        EBCDIC COMPOUND CHARACTERS TRT TABLE                           00168060
*                                                                       00168080
DMKTBMTO EQU   *                                               @V387398 00168100
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00168120
         DC    X'00000000000000000000000000000000' 00          @V387398 00168140
         DC    X'00000000000000000000000000000000' 10          @V387398 00168160
         DC    X'00000000000000000000000000BF0000' 20          @VA08735 00168185
         DC    X'00000000000000000000000000000000' 30          @V387398 00168200
         DC    X'00000000000000000000000000000000' 40          @V387398 00168220
         DC    X'00515253000000000059000000000000' 50          @V387398 00168240
         DC    X'00000000000000000000000000000000' 60          @V387398 00168260
         DC    X'70000000000000000000000000000000' 70          @V387398 00168280
         DC    X'00000000000000000000008B008D8E8F' 80          @V387398 00168300
         DC    X'00000000000000000000009B9C9D9E9F' 90          @V387398 00168320
         DC    X'A0A1000000000000000000ABAC0000AF' A0          @V387398 00168340
         DC    X'B0B1B2B3B4B5B6B7B8B900BBBC0000BF' B0          @V387398 00168360
         DC    X'000000000000000000000000CCCDCECF' C0          @V387398 00168380
         DC    X'00000000000000000000DADBDCDD0000' D0          @V387398 00168400
         DC    X'00000000000000000000EAEBECEDEEEF' E0          @V387398 00168420
         DC    X'000000000000000000000000FCFD0000' F0          @V387398 00168440
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00168460
*                                                                       00168480
*        EBCDIC TEXT -> 3270 TEXT                                       00168500
*                                                                       00168520
         ORG   DMKTBMTO+256   THESE TABLES MUST BE CONTIGUOUS  @V387398 00168540
*                                                                       00168560
*                                                                       00168580
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00168600
         DC    X'40404040404040404040404040404040' 00          @V387398 00168620
         DC    X'404040404040404040404040401D4040' 10          @V387398 00168640
         DC    X'40404040404040404040404040404040' 20          @V387398 00168660
         DC    X'40404040404040404040404040404040' 30          @V387398 00168680
         DC    X'404040404040404040404A4B4C4D4E4F' 40          @V387398 00168700
         DC    X'508A9AAA4040404040C25A5B5C5D5E5F' 50          @V387398 00168720
         DC    X'60614040404040404040406B6C6D6E6F' 60          @V387398 00168740
         DC    X'BA4040404040404040407A7B7C7D7E7F' 70          @V387398 00168760
         DC    X'408182838485868788898A908C8D8E8F' 80          @V387398 00168780
         DC    X'9091929394959697989940A09B9D1E9F' 90          @V387398 00168800
         DC    X'8CA1A2A3A4A5A6A7A8A940ABACADAEAF' A0          @V387398 00168820
         DC    X'B0B1B2B3B415B6B7B819BABBBCBDBEBF' B0          @V387398 00168840
         DC    X'40C1C2C3C4C5C6C7C8C9BB8D6A6B5E5F' C0          @V387398 00168860
         DC    X'40D1D2D3D4D5D6D7D8D9E3F3C6C79F8F' D0          @V387398 00168880
         DC    X'B740E2E3E4E5E6E7E8E9BDBED6D7ADAE' E0          @V387398 00168900
         DC    X'F0F1F2F3F4F5F6F7F8F9BF8EE6E74040' F0          @V387398 00168920
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00168940
         EJECT                                                          00168960
*                                                                       00168980
*        3270 TEXT ->EBCDIC COMPOUND CHARACTER TABLE                    00169000
*                                                                       00169020
DMKTBMTI EQU   *                                               @V387398 00169040
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00169060
         DC    X'40404040404040404040404040404040' 00          @V387398 00169080
         DC    X'4040404040B5404040B9404040409E40' 10          @V387398 00169100
         DC    X'40404040404040404040404040404040' 20          @V387398 00169120
         DC    X'40404040404040404040404040404040' 30          @V387398 00169140
         DC    X'40404040404040404040404040404040' 40          @V387398 00169160
         DC    X'4040404040404040404040404040CECF' 50          @V387398 00169180
         DC    X'40404040404040404040CCCD40404040' 60          @V387398 00169200
         DC    X'40404040404040404040404040404040' 70          @V387398 00169220
         DC    X'404040404040404040405140A08D8E8F' 80          @V387398 00169240
         DC    X'8B404040404040404040529C409D409F' 90          @V387398 00169260
         DC    X'9BA1404040404040404053ABACEEEFAF' A0          @V387398 00169280
         DC    X'B0B1B2B3B440B6B7B84070BBBCEAEB2D' B0          @VA08735 00169305
         DC    X'404059404040DCDD4040404040404040' C0          @V387398 00169320
         DC    X'404040404040ECED4040404040404040' D0          @V387398 00169340
         DC    X'404040DA4040FCFD4040404040404040' E0          @V387398 00169360
         DC    X'404040DB404040404040404040404040' F0          @V387398 00169380
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00169400
*                                                                       00169420
*        3270 TEXT -> EBCDIC TEXT SINGLE BYTE CODES                     00169440
*                                                                       00169460
         ORG   DMKTBMTI+256   THESE TABLES MUST BE CONTIGUOUS  @V387398 00169480
*                                                                       00169500
*                                                                       00169520
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00169540
         DC    X'40404040404040404040404040404040' 00          @V387398 00169560
         DC    X'40404040404040404040404040404040' 10          @V387398 00169580
         DC    X'40404040404040404040404040404040' 20          @V387398 00169600
         DC    X'40404040404040404040404040404040' 30          @V387398 00169620
         DC    X'404040404040404040404A4B4C4D4E4F' 40          @V387398 00169640
         DC    X'504040404040404040405A5B5C5D5E5F' 50          @V387398 00169660
         DC    X'606140404040404040406A6B6C6D6E6F' 60          @V387398 00169680
         DC    X'404040404040404040407A7B7C7D7E7F' 70          @V387398 00169700
         DC    X'408182838485868788898A408CCBFBDF' 80          @V387398 00169720
         DC    X'909192939495969798994040404040DE' 90          @V387398 00169740
         DC    X'4040A2A3A4A5A6A7A8A9404040ADAE40' A0          @V387398 00169760
         DC    X'40404040404040E04040BACA40BDBEFA' B0          @V387398 00169780
         DC    X'40C1C2C3C4C5C6C7C8C9404040404040' C0          @V387398 00169800
         DC    X'40D1D2D3D4D5D6D7D8D9404040404040' D0          @V387398 00169820
         DC    X'4040E2E3E4E5E6E7E8E9404040404040' E0          @V387398 00169840
         DC    X'F0F1F2F3F4F5F6F7F8F9404040404040' F0          @V387398 00169860
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00169880
         SPACE                                                          00169900
         END                                                            00170000