SYS      TITLE 'DMTSYS     (RSCS)      VM/370 - RELEASE 6'              00001000
*.                                                                      00002000
* MODULE NAME -                                                         00003000
*                                                                       00004000
*        DMTSYS                                                         00005000
*                                                                       00006000
* FUNCTION -                                                            00007000
*                                                                       00008000
*        THIS MODULE SERVES AS THE COMMON SYSTEM CONTROL                00009000
*        INFORMATION AREA WHICH IS SHARED BY ALL TASK LEVEL             00010000
*        FUNCTIONS OF RSCS.  ALL INSTALLATION VARIABLE INFOR-           00011000
*        MATION USED BY AN RSCS SYSTEM IS REFLECTED IN THE              00012000
*        ASSEMBLY OF THIS MODULE, SO THIS MODULE IS THE ONLY            00013000
*        MODULE WHICH MUST BE ASSEMBLED AS PART OF AN RSCS              00014000
*        SYSTEM GENERATION.                                             00015000
*                                                                       00016000
* ATTRIBUTES -                                                          00017000
*                                                                       00018000
*        SHARED                                                         00019000
*                                                                       00020000
* ENTRY POINTS -                                                        00021000
*                                                                       00022000
*        DMTSYSLK - START OF THE LINK TABLE CONTROL AREA                00023000
*        DMTSYSRT - START OF THE ROUTING TABLE CONTROL AREA             00024000
*        DMTSYSPT - START OF THE ALLOCATABLE PORT TABLE CONTROL AREA    00025000
*        DMTSYSTQ - START OF THE FILE TAG QUEUE CONTROL AREA            00026000
*        DMTSYSND - END OF DMTSYS, AND END OF THE REX TASK              00027000
*                                                                       00028000
* ENTRY CONDITIONS -                                                    00029000
*                                                                       00030000
*        THIS MODULE CONTAINS NO EXECUTABLE CODE.                       00031000
*                                                                       00032000
*                                                                       00033000
         EJECT                                                          00034000
* EXTERNAL REFERENCES -                                                 00035000
*                                                                       00036000
*        NONE                                                           00037000
*                                                                       00038000
* TABLES / WORKAREAS -                                                  00039000
*                                                                       00040000
*        1.  LINK TABLE - EACH ENTRY IN THE LINK TABLE SECTION          00041000
*                  DESCRIBES A DEFINED LINK, OR REPRESENTS A            00042000
*                  LINK WHICH MAY BE DEFINED BY CONSOLE COMMAND         00043000
*                                                                       00044000
*        2.  ROUTING TABLE - EACH ENTRY IN THE ROUTING TABLE            00045000
*                  DESCRIBES A LINK WHICH CAN HANDLE FILES              00046000
*                  WHICH ARE ADDRESSED TO A PARTICULAR LOCATION         00047000
*                  OTHER THAN THE LINK'S LOCATION                       00048000
*                                                                       00049000
*        3.  PORT TABLE - EACH ENTRY IN THE PORT TABLE DESCRIBES        00050000
*                  A SWITCHED LINE PORT WHICH MAY BE ALLOCATED          00051000
*                  FOR USE BY ANY LINK TO BE ACTIVATED                  00052000
*                                                                       00053000
*        4.  TAG QUEUE - EACH TAG QUEUE ELEMENT MAY REPRESENT           00054000
*                  ONE SPOOL FILE WHICH IS TO BE PROCESSED BY           00055000
*                  RSCS.  INACTIVE FILE TAGS ARE ENQUEUED ON            00056000
*                  THE LINK TABLE FOR THE LINK ON WHICH THEY            00057000
*                  ARE TO BE TRANSMITTED.  ACTIVE INPUT FILES           00058000
*                  AND ACTIVE OUTPUT FILES ARE ENQUEUED ON              00059000
*                  THEIR RESPECTIVE QUEUES, ANCHORED IN THE             00060000
*                  TAG QUEUE CONTROL AREA.                              00061000
* NOTES -                                                               00062000
*                                                                       00063000
*        EACH OF THE FIELDS IN THE VARIOUS SHARED AREAS IS              00064000
*        ASSIGNED TO A PARTICULAR TASK FOR MODIFICATION.                00065000
*        OTHER TASKS MAY READ THE FIELDS, BUT MODIFICATION IS           00066000
*        PERMITTED ONLY BY THE TASK WHICH OWNS THE FIELD.               00067000
*                                                                       00068000
*.                                                                      00069000
         EJECT                                                          00070000
         COPY  LINKTABL                                                 00071000
         EJECT                                                          00072000
         COPY  ROUTE                                                    00073000
         EJECT                                                          00074000
         COPY  TAG                                                      00075000
         EJECT                                                          00076000
DMTSYS   CSECT                                                          00077000
         ENTRY DMTSYSLK,DMTSYSRT,DMTSYSPT,DMTSYSTQ,DMTSYSND             00078000
DMTSYSLK DC    0D'0',A((LINKEND-LINKS)/LINKLEN),AL2(16),AL2(0)          00079000
LINKS    EQU   *                                                        00080000
         COPY  AXSLINKS                                                 00081000
LINKEND  EQU   *                                                        00082000
         EJECT                                                          00083000
DMTSYSRT DC    0D'0',A((ROUTEND-ROUTES)/ROUTSIZE),A(0)                  00084000
ROUTES   EQU   *                                                        00085000
         COPY  AXSROUTE                                                 00086000
ROUTEND  EQU   *                                                        00087000
         EJECT                                                          00088000
DMTSYSPT DC    0D'0',A((LINEND-LINES)/LINLEN),A(0)                      00089000
LINES    EQU   *                                                        00090000
         COPY  LAXLINES                                                 00091000
LINEND   EQU   *                                                        00092000
LINLEN   EQU   2                                                        00093000
         EJECT                                                          00094000
DMTSYSTQ DC    0D'0'               TAG QUEUE CONTROL AREA               00095000
SYSTFREE DC    A(SYSTAGS)          START OF FILE TAG SLOTS              00096000
SYSACIN  DC    A(0)                START OF ACTIVE INPUT QUEUE          00097000
SYSACOUT DC    A(0)                START OF ACTIVE OUTPUT QUEUE         00098000
SYSTGOT  DC    H'0'                NUMBER OF FREE SLOTS LEFT            00099000
SYSTHOLD DC    H'0'                NUMBER OF SLOTS TO BE HELD           00100000
         SPACE                                                          00101000
TAGWORDS EQU   (TAGLEN+3)/4 LENGTH OF A FILE TAG IN WORDS               00102000
         SPACE                                                          00103000
         COPY  TAGQUEUE                                        @VM01091 00104000
         SPACE                                                          00105000
DMTSYSND EQU   *                                                        00106000
         EJECT                                                          00107000
         COPY  RSSEQU                                                   00108000
         END                                                            00109000