         TITLE 'DMKMSS                                                 *00001000
                        '                                               00002000
DMKMSS   CSECT ,                                                   0001 00003000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00004000
         BALR  @11,0                                               0001 00005000
@PSTART  DS    0H                                                  0001 00006000
         USING @PSTART,@11                                         0001 00007000
*                                                                ##C##  00008000
        MODESET MODE=SUP,KEY=ZERO    PLACE IN SUPERVISOR STATE   ##C##  00009000
        L R2,@SIZDATD                LOAD DYNAMIC AREA SIZE      ##C##  00010000
        GETMAIN R,LV=(2),SP=241      GET THE VIRT. STORAGE       ##C##  00011000
        LR R10,R1                                                ##C##  00012000
        USING @DATD,R10              ESTABLISH ADDRESSIBILITY    ##C##  00013000
        ST R13,@SA00001+4            CHAIN SAVE AREAS ....       ##C##  00014000
        LA R15,@SA00001                                          ##C##  00015000
        ST R15,8(,R13)                                           ##C##  00016000
        LR R13,R15                                               ##C##  00017000
*   COMMDCB=ACTDCB;                 /* COPY THE DCB TO WORKAREA      */ 00018000
         MVC   COMMDCB(92),ACTDCB                                  0097 00019000
*   MSSECB=ZEROFULL;                                               0098 00020000
         SLR   @12,@12                                             0098 00021000
         ST    @12,MSSECB                                          0098 00022000
*   RCODE=ZEROFULL;                                                0099 00023000
         STH   @12,RCODE                                           0099 00024000
*   CPUID=CPUID&&CPUID;             /* CLEAR THE CPU ID              */ 00025000
         XC    CPUID(5),CPUID                                      0100 00026000
*   COMMPTR=ADDR(BUFFER);           /* MSSCOM MACRO MAPPING        0101 00027000
*                                      ESTABLISHED                   */ 00028000
         LA    COMMPTR,BUFFER                                      0101 00029000
*   OPENLIST=HEX80;                                                0102 00030000
         L     @12,HEX80                                           0102 00031000
         ST    @12,OPENLIST                                        0102 00032000
*   DCBPTR=ADDR(COMMDCB);           /* ESTABLISH DCB MAPPING         */ 00033000
         LA    DCBPTR,COMMDCB                                      0103 00034000
*   GEN(OPEN (COMMDCB,OUTPUT),MF=(E,OPENLIST));                    0104 00035000
*                                                                  0104 00036000
         OPEN (COMMDCB,OUTPUT),MF=(E,OPENLIST)                          00037000
*/* **************************************************************** */ 00038000
*/*    SET THE MSSINIT BIT TO '1'B (ON) IF THE MSS WAS               */ 00039000
*/*    INITILIZED CORRECTLY, OTHERWISE SET IT TO '0'B (OFF)          */ 00040000
*/* **************************************************************** */ 00041000
*                                                                  0105 00042000
*   MSSINIT=OFF;                                                   0105 00043000
*   INITCTR=OFF;                    /* INITIALIZE COUNTER    @VA11319*/ 00044000
         NI    MSSINIT,B'01011111'                                 0106 00045000
*   IF CVTICB^=ZEROFULL THEN        /* DOES CONTROL BLOCK EXIST      */ 00046000
         L     @12,CVTPTR                                          0107 00047000
         L     @12,CVTEXT2(,@12)                                   0107 00048000
         L     @12,CVTICB(,@12)                                    0107 00049000
         LTR   @12,@12                                             0107 00050000
         BZ    @RF00107                                            0107 00051000
*     DO;                           /* YES                           */ 00052000
*       ICBPTR=CVTICB;                                             0109 00053000
         LR    ICBPTR,@12                                          0109 00054000
*RECHEK:                                                           0110 00055000
*       IF ICBI=ON THEN                                            0110 00056000
RECHEK   TM    ICBI(ICBPTR),B'10000000'                            0110 00057000
         BNO   @RF00110                                            0110 00058000
*         MSSINIT=ON;               /*                       @VA11319*/ 00059000
         OI    MSSINIT,B'10000000'                                 0111 00060000
*       ELSE                                                       0112 00061000
*         IF INITCTR=OFF THEN       /*                       @VA11319*/ 00062000
         B     @RC00110                                            0112 00063000
@RF00110 TM    INITCTR,B'00100000'                                 0112 00064000
         BNZ   @RF00112                                            0112 00065000
*           DO;                     /*                       @VA11319*/ 00066000
*             INITCTR=ON;           /* LET EVERYONE KNOW BEEN HERE 0114 00067000
*                                                            @VA11319*/ 00068000
         OI    INITCTR,B'00100000'                                 0114 00069000
*             GEN CODE;                                            0115 00070000
*                                                     /*   @VA11319 */  00071000
           WTO ' DMKMSS WAITING 10 MINUTES FOR MSS INITIALIZATION',   XX00072000
               DESC=(4),ROUTCDE=(2)                                     00073000
           STIMER WAIT,DINTVL=WAITTIME                                  00074000
*             GOTO RECHEK;          /*                       @VA11319*/ 00075000
         B     RECHEK                                              0116 00076000
*           END;                    /*                       @VA11319*/ 00077000
*     END;                                                         0118 00078000
*   ELSE                                                           0119 00079000
*     ;                             /*                       @VA11343*/ 00080000
@RF00107 DS    0H                                                  0120 00081000
*/* **************************************************************** */ 00082000
*/*         SET A FLAG TO INDICATE THAT DMKMSS IS RUNNING            */ 00083000
*/*         IN A VIRTUAL MACHINE,ELSE SET FLAG TO ZERO               */ 00084000
*/* **************************************************************** */ 00085000
*                                                                  0120 00086000
*   VIRTFLAG=OFF;                   /* CLEAR VIRTUAL MACH. FLAG      */ 00087000
@RC00107 NI    VIRTFLAG,B'10111111'                                0120 00088000
*   GEN(STIDP VIRT);                /* ISSUE STORE CPU ID INST. THIS    00089000
*                                      WILL                          */ 00090000
         STIDP VIRT                                                     00091000
*/*                               SET BYTE ZERO OF VIRT TO 'FF'X IF  */ 00092000
*/*                               DMKMSS IS RUNNING IN A VIRTUAL MACH*/ 00093000
*                                                                  0122 00094000
*   IF VIRT(1)=VIRTTEST THEN        /* SET FLAG IF OK                */ 00095000
         CLC   VIRT(1),VIRTTEST                                    0122 00096000
         BNE   @RF00122                                            0122 00097000
*     VIRTFLAG=ON;                                                 0123 00098000
         OI    VIRTFLAG,B'01000000'                                0123 00099000
*   ELSE                                                           0124 00100000
*     ;                             /*                       @VA11343*/ 00101000
@RF00122 DS    0H                                                  0125 00102000
*/* **************************************************************** */ 00103000
*/*       IF DCB OPENED OK AND THE MSS IS INITILIZED AND             */ 00104000
*/*         DMKMSS IS RUNNING IN A VIRTUAL MACHINE THEN              */ 00105000
*/*         CONTINUE TO PROCESS, ELSE ERROR MESSAGE AND EXIT         */ 00106000
*/* **************************************************************** */ 00107000
*                                                                  0125 00108000
*   IF DCBOFOPN=ON&MSSINIT=ON&VIRTFLAG=ON THEN                     0125 00109000
         TM    DCBOFOPN+40(DCBPTR),B'00010000'                     0125 00110000
         BNO   @RF00125                                            0125 00111000
         TM    MSSINIT,B'11000000'                                 0125 00112000
         BNO   @RF00125                                            0125 00113000
*L1:                                                               0126 00114000
*     DO;                                                          0126 00115000
*                                                                  0126 00116000
L1       DS    0H                                                  0127 00117000
*/* **************************************************************** */ 00118000
*/*      FOLLOW POINTERS THROUGH DCB,DEB AND UCB CONTROL             */ 00119000
*/*      BLOCKS TO FIND THE CHANNEL/UNIT ADDRESS ASSIGNED            */ 00120000
*/*      BY THE VS SCHEDULER. PLACE THE VALUE IN REGISTER 4.         */ 00121000
*/* **************************************************************** */ 00122000
*                                                                  0127 00123000
*       CALL RPLYPROC;              /* ISSUE TERMINATION MSG @VA12978*/ 00124000
         BAL   @14,RPLYPROC                                        0127 00125000
*       DEBPTR=DCBDEBAD;            /* ESTABLISH DEB ADDRESSING      */ 00126000
         L     DEBPTR,DCBDEBAD+40(,DCBPTR)                         0128 00127000
*       DEBDAPTR=ADDR(DEBBASND);                                   0129 00128000
         LA    @12,DEBBASND(,DEBPTR)                               0129 00129000
         ST    @12,DEBDAPTR                                        0129 00130000
*       UCBPTR=DEBUCBAD;            /* ESTABLISH UCB ADDRESSING      */ 00131000
         L     UCBPTR,DEBUCBAD(,@12)                               0130 00132000
*       TEMP=UCBCHA&MASK2;                                         0131 00133000
         SLR   @12,@12                                             0131 00134000
         IC    @12,UCBCHA(,UCBPTR)                                 0131 00135000
         SLR   @15,@15                                             0131 00136000
         IC    @15,MASK2                                           0131 00137000
         NR    @12,@15                                             0131 00138000
         ST    @12,TEMP                                            0131 00139000
*       SLL(TEMP,8);                                               0132 00140000
         SLL   @12,8                                               0132 00141000
         ST    @12,TEMP                                            0132 00142000
*       R4=TEMP|UCBUA;              /* PUT THE CHANNEL UNIT ADDRESS     00143000
*                                      IN REG 4                      */ 00144000
         SLR   R4,R4                                               0133 00145000
         IC    R4,UCBUA(,UCBPTR)                                   0133 00146000
         O     R4,TEMP                                             0133 00147000
*/* **************************************************************** */ 00148000
*/*    SET POINTER IN THE COMMUNICATIONS UCB TO POINT TO ECB         */ 00149000
*/* **************************************************************** */ 00150000
*                                                                  0134 00151000
*       ADECB=ADDR(MSSECB);         /* PLACE THE ADDRESS OF THE ECB     00152000
*                                      TO                            */ 00153000
         LA    @12,MSSECB                                          0134 00154000
         STCM  @12,7,ADECB                                         0134 00155000
*       ADECB=ADECB|MASK;           /* TURN ON HIGH ORDER BIT TO   0135 00156000
*                                      INDICATE CROSS MEMORY POST    */ 00157000
         O     @12,MASK                                            0135 00158000
         STCM  @12,7,ADECB                                         0135 00159000
*       SAVE1=MSSECBAD;             /* SAVE FOR UCB RESTORATION    0136 00160000
*                                                            @VA11318*/ 00161000
         L     @15,MSSECBAD(,UCBPTR)                               0136 00162000
         ST    @15,SAVE1                                           0136 00163000
*       MSSECBAD=ADECB;             /* POSTED AT UNUSED LOCATION IN     00164000
*                                      UCB                           */ 00165000
         ST    @12,MSSECBAD(,UCBPTR)                               0137 00166000
*       RFY                                                        0138 00167000
*         R1 UNRSTD;                                               0138 00168000
*                                                                  0138 00169000
*/* **************************************************************** */ 00170000
*/*      FIND MSC'S UCB AND INSERT THE INDEX TO THE ATTN TABLE,      */ 00171000
*/*      FOUND THERE,INTO THE COMMUNICATIONS UCB.                    */ 00172000
*/* **************************************************************** */ 00173000
*                                                                  0139 00174000
*       RFY                                                        0139 00175000
*         R12 RSTD;                                                0139 00176000
*       ICBPTR=CVTICB;              /* GET POINTER TO IEZICB         */ 00177000
         L     @15,CVTPTR                                          0140 00178000
         L     @15,CVTEXT2(,@15)                                   0140 00179000
         L     ICBPTR,CVTICB(,@15)                                 0140 00180000
*       R12=ICBPUCB;                /* GET POINTER TO MSC'S UCB AND  */ 00181000
         L     R12,ICBPUCB(,ICBPTR)                                0141 00182000
*       RFY                                                        0142 00183000
*         UCBOB BASED(R12);         /* ESTABLISH THE MAPPING FOR UCB */ 00184000
*       INDEX=UCBATI;               /* GET THE ATTN ROUTINE INDEX    */ 00185000
         SLR   @15,@15                                             0143 00186000
         IC    @15,UCBATI(,R12)                                    0143 00187000
         ST    @15,INDEX                                           0143 00188000
*       RFY                                                        0144 00189000
*         UCBOB BASED(UCBPTR);      /* REESTABLISH COMM. UCB MAPPING */ 00190000
*       SAVE3=UCBATI;               /* SAVE FOR UCB RESTORATION    0145 00191000
*                                                            @VA11318*/ 00192000
         SLR   @14,@14                                             0145 00193000
         IC    @14,UCBATI(,UCBPTR)                                 0145 00194000
         ST    @14,SAVE3                                           0145 00195000
*       UCBATI=INDEX;               /* PUT INDEX IN COMM. UCB        */ 00196000
         STC   @15,UCBATI(,UCBPTR)                                 0146 00197000
*       RFY                                                        0147 00198000
*         R12 UNRSTD;                                              0147 00199000
*                                                                  0147 00200000
*/* **************************************************************** */ 00201000
*/*           BUILD AND ISSUE THE DIAGNOSE INSTRUCTION               */ 00202000
*/*           TO TELL VM THE CHANNEL/UNIT ADDRESS.                   */ 00203000
*/*           REG 4 CONTAINS THE CHANNEL UNIT ADDRESS.               */ 00204000
*/*           SET UP RETURN PATH FOR ABEND EXIT... STAE MACRO        */ 00205000
*/* **************************************************************** */ 00206000
*                                                                  0148 00207000
*       R5=ADDCODE;                                                0148 00208000
         SLR   R5,R5                                               0148 00209000
*       GEN( EX R0,DIAGNOSE );                                     0149 00210000
          EX R0,DIAGNOSE                                                00211000
*       GEN( STAE  ABNEXIT );       /* DEFINE LABEL FOR ABEND EXIT   */ 00212000
          STAE  ABNEXIT                                                 00213000
*       CALL QRYMSC;                /* GET VUA CONFIGURATION FOR CP     00214000
*                                                            @VA11343*/ 00215000
         BAL   @14,QRYMSC                                          0151 00216000
*       RFY                                                        0152 00217000
*         R15 RSTD;                 /*                       @VA11343*/ 00218000
*       TEMP3=R15;                  /* SAVE RETURN CODE OVER MACROS     00219000
*                                                            @VA11343*/ 00220000
         ST    R15,TEMP3                                           0153 00221000
*       IF R15=4 THEN                                              0154 00222000
         C     R15,@CF00109                                        0154 00223000
         BNE   @RF00154                                            0154 00224000
*         DO;                       /* RC^=0 INDICATES ERROR @VA11343*/ 00225000
*           DO;                     /* WTO('DMKMSS ERROR READING MSS    00226000
*                                      CONFIGURATION TABLE') DESC(4)    00227000
*                                      ROUTCDE(2)                    */ 00228000
*             RFY                                                  0157 00229000
*               GPR01P RSTD;        /* RESTRICT REG 1                */ 00230000
*             GPR01P=ADDR(I03506);  /* ADDRESS CONTROL PROGRAM LIST  */ 00231000
         LA    GPR01P,I03506                                       0158 00232000
*             SVC(35);              /* ISSUE WTO SVC                 */ 00233000
         SVC   35                                                  0159 00234000
*             RFY                                                  0160 00235000
*               GPR01P UNRSTD;      /* RELEASE REG 1                 */ 00236000
*           END;                    /* WTO('DMKMSS ERROR READING MSS    00237000
*                                      CONFIGURATION TABLE') DESC(4)    00238000
*                                      ROUTCDE(2)                    */ 00239000
*           DECLARE                 /* WTO PARAMETER LIST            */ 00240000
*             1 I03506 STATIC BDY(WORD),                           0162 00241000
*              2 I0350601 FIXED(15) INIT(48),/* TEXT LENGTH          */ 00242000
*              2 I0350602 BIT(16) INIT('1000000000000000'B),/* MCS 0162 00243000
*                                      FLAG                          */ 00244000
*              2 I0350603 CHAR(44) INIT(                           0162 00245000
*                    'DMKMSS ERROR READING MSS CONFIGURATION TABLE'),   00246000
*                                   /* MESSAGE TEXT                  */ 00247000
*              2 I0350604 BIT(16) INIT('0001000000000000'B),/*     0162 00248000
*                                      DESCRIPTOR CODES              */ 00249000
*              2 I0350605 BIT(16) INIT('0100000000000000'B);/*     0162 00250000
*                                      ROUTING CODES         @VA11343*/ 00251000
*         END;                      /*                       @VA11343*/ 00252000
*       ELSE                                                       0164 00253000
*         IF R15=8 THEN                                            0164 00254000
         B     @RC00154                                            0164 00255000
@RF00154 C     R15,@CF00072                                        0164 00256000
         BNE   @RF00164                                            0164 00257000
*           DO;                     /* RC^=0 INDICATES ERROR @VA11343*/ 00258000
*             DO;                   /* WTO('DMKMSS CPUID NOT FOUND IN   00259000
*                                      MSS CONFIGURATION TABLES')  0166 00260000
*                                      DESC(4) ROUTCDE(2)            */ 00261000
*               RFY                                                0167 00262000
*                 GPR01P RSTD;      /* RESTRICT REG 1                */ 00263000
*               GPR01P=ADDR(I03508);/* ADDRESS CONTROL PROGRAM LIST  */ 00264000
         LA    GPR01P,I03508                                       0168 00265000
*               SVC(35);            /* ISSUE WTO SVC                 */ 00266000
         SVC   35                                                  0169 00267000
*               RFY                                                0170 00268000
*                 GPR01P UNRSTD;    /* RELEASE REG 1                 */ 00269000
*             END;                  /* WTO('DMKMSS CPUID NOT FOUND IN   00270000
*                                      MSS CONFIGURATION TABLES')  0171 00271000
*                                      DESC(4) ROUTCDE(2)            */ 00272000
*             DECLARE               /* WTO PARAMETER LIST            */ 00273000
*               1 I03508 STATIC BDY(WORD),                         0172 00274000
*                2 I0350801 FIXED(15) INIT(54),/* TEXT LENGTH        */ 00275000
*                2 I0350802 BIT(16) INIT('1000000000000000'B),/* MCS    00276000
*                                      FLAG                          */ 00277000
*                2 I0350803 CHAR(50) INIT(                         0172 00278000
*'DMKMSS CPUID NOT FOUND IN MSS CONFIGURATION TABLES'),/* MESSAGE  0172 00279000
*                                      TEXT                          */ 00280000
*                2 I0350804 BIT(16) INIT('0001000000000000'B),/*   0172 00281000
*                                      DESCRIPTOR CODES              */ 00282000
*                2 I0350805 BIT(16) INIT('0100000000000000'B);/*   0172 00283000
*                                      ROUTING CODES         @VA11343*/ 00284000
*           END;                    /*                       @VA11343*/ 00285000
*         ELSE                                                     0174 00286000
*           IF R15=12 THEN                                         0174 00287000
         B     @RC00164                                            0174 00288000
@RF00164 C     R15,@CF00901                                        0174 00289000
         BNE   @RF00174                                            0174 00290000
*             DO;                   /* RC^=0 INDICATES ERROR @VA11343*/ 00291000
*               DO;                 /* WTO('DMKMSS ERROR CREATING MSS   00292000
*                                      CONFIGURATION TABLE') DESC(4)    00293000
*                                      ROUTCDE(2)                    */ 00294000
*                 RFY                                              0177 00295000
*                   GPR01P RSTD;    /* RESTRICT REG 1                */ 00296000
*                 GPR01P=ADDR(I03510);/* ADDRESS CONTROL PROGRAM LIST*/ 00297000
         LA    GPR01P,I03510                                       0178 00298000
*                 SVC(35);          /* ISSUE WTO SVC                 */ 00299000
         SVC   35                                                  0179 00300000
*                 RFY                                              0180 00301000
*                   GPR01P UNRSTD;  /* RELEASE REG 1                 */ 00302000
*               END;                /* WTO('DMKMSS ERROR CREATING MSS   00303000
*                                      CONFIGURATION TABLE') DESC(4)    00304000
*                                      ROUTCDE(2)                    */ 00305000
*               DECLARE             /* WTO PARAMETER LIST            */ 00306000
*                 1 I03510 STATIC BDY(WORD),                       0182 00307000
*                  2 I0351001 FIXED(15) INIT(49),/* TEXT LENGTH      */ 00308000
*                  2 I0351002 BIT(16) INIT('1000000000000000'B),/* 0182 00309000
*                                      MCS FLAG                      */ 00310000
*                  2 I0351003 CHAR(45) INIT(                       0182 00311000
*                        'DMKMSS ERROR CREATING MSS CONFIGURATION TABLE 00312000
*                        ),         /* MESSAGE TEXT                  */ 00313000
*                  2 I0351004 BIT(16) INIT('0001000000000000'B),/* 0182 00314000
*                                      DESCRIPTOR CODES              */ 00315000
*                  2 I0351005 BIT(16) INIT('0100000000000000'B);/* 0182 00316000
*                                      ROUTING CODES         @VA11343*/ 00317000
*             END;                  /*                       @VA11343*/ 00318000
*           ELSE                                                   0184 00319000
*             ;                     /*                       @VA11343*/ 00320000
@RF00174 DS    0H                                                  0185 00321000
*       R15=TEMP3;                  /* RESTORE RETURN CODE TO PROPER    00322000
*                                      REG                   @VA11343*/ 00323000
@RC00164 DS    0H                                                  0185 00324000
@RC00154 L     R15,TEMP3                                           0185 00325000
*       IF R15^=0 THEN                                             0186 00326000
         LTR   R15,R15                                             0186 00327000
         BZ    @RF00186                                            0186 00328000
*         DO;                       /* TERMINATE CEN SERVER ON ERROR    00329000
*                                                            @VA11343*/ 00330000
*           CALL DIAG(EXITABND);    /* TELL CP WE'RE               0188 00331000
*                                      TERMINATING@VA11343           */ 00332000
         LA    @01,@AL00188                                        0188 00333000
         BAL   @14,DIAG                                            0188 00334000
*           GO TO FINISH;           /* BRANCH PAST REST OF MAIN LOOP    00335000
*                                                            @VA11343*/ 00336000
         B     FINISH                                              0189 00337000
*         END;                      /*                       @VA11343*/ 00338000
*       ELSE                                                       0191 00339000
*         ;                         /*                       @VA11343*/ 00340000
@RF00186 DS    0H                                                  0192 00341000
*       RFY                                                        0192 00342000
*         R15 UNRSTD;               /*                       @VA11343*/ 00343000
*/* **************************************************************** */ 00344000
*/*     GO INTO WAIT STATE UNTIL VM ISSUES ATTN. INTERRUPT AND       */ 00345000
*/*     THE MSSECB IS POSTED.                                        */ 00346000
*/* **************************************************************** */ 00347000
*                                                                  0193 00348000
*       GOTO WAIT1;                 /*                       @VA11318*/ 00349000
         B     WAIT1                                               0193 00350000
*                                                                  0194 00351000
*/* **************************************************************** */ 00352000
*/*   THE FOLLOWING LOOP WILL RUN IN THE VS MACHINE AS LONG AS MSS   */ 00353000
*/*   SUPPORT IS IN EFFECT. THE PROGRAM WILL BE IN WAIT STATE IF     */ 00354000
*/*   THERE ARE NO REQUESTS TO BE PROCESSED.                         */ 00355000
*/* **************************************************************** */ 00356000
*                                                                  0194 00357000
*MAINLOOP:                                                         0194 00358000
*                                                                  0194 00359000
*/* **************************************************************** */ 00360000
*/*        ISSUE THE DIAGNOSE TO REQUEST WORK FROM VM                */ 00361000
*/* **************************************************************** */ 00362000
*                                                                  0194 00363000
*       CALL DIAG(REQCODE);         /* ASK CP FOR WORK TO DO         */ 00364000
MAINLOOP LA    @01,@AL00194                                        0194 00365000
         BAL   @14,DIAG                                            0194 00366000
*       IF MSSFLAG1^=ZERO THEN      /* IS THERE ANY TO DO?   @VA11343*/ 00367000
*                                                                  0195 00368000
         CLI   MSSFLAG1(COMMPTR),0                                 0195 00369000
         BE    @RF00195                                            0195 00370000
*         /***********************************************************/ 00371000
*         /*                                                         */ 00372000
*         /* *********************************************************/ 00373000
*         /* WORK IS REQUESTED BY VM                                 */ 00374000
*         /* *********************************************************/ 00375000
*         /*                                                         */ 00376000
*         /***********************************************************/ 00377000
*                                                                  0196 00378000
*L2:                                                               0196 00379000
*         DO;                       /*                       @VA11343*/ 00380000
L2       DS    0H                                                  0197 00381000
*           IF MOUNT=ON THEN                                       0197 00382000
         TM    MOUNT(COMMPTR),B'10000000'                          0197 00383000
         BNO   @RF00197                                            0197 00384000
*             DO;                   /* IS MOUNT BIT SET ?    @VA11343*/ 00385000
*                                                                  0198 00386000
*               /*****************************************************/ 00387000
*               /*                                                   */ 00388000
*               /* ***************************************************/ 00389000
*               /* MOUNT IS REQUESTED                                */ 00390000
*               /* ***************************************************/ 00391000
*               /*                                                   */ 00392000
*               /*****************************************************/ 00393000
*                                                                  0199 00394000
*/* **************************************************************** */ 00395000
*/* IN ORDER TO KEEP LOW THE AVERAGE AMOUNT OF TIME REQUIRED TO PER- */ 00396000
*/* FORM A MOUNT, AN ALGORITHM FOR DATA REUSE IS IMPLEMENTED. THIS   */ 00397000
*/* ALGORITHM IS DESIGNED TO WORK WITH EXISTING CODE IN THIS MODULE  */ 00398000
*/* (THE CENTRAL SERVER) AND IN CP, WITH MINIMAL CHANGE REQUIRED TO  */ 00399000
*/* EITHER.                                                          */ 00400000
*/*                                                                  */ 00401000
*/* CP INITIALLY PASSES THE VUA AND ITS ASSOCIATED SDG NUMBER IN THE */ 00402000
*/* MSSCOM FOR THE MOUNT REQUEST. THE 'RETRY' BIT IS TURNED ON IF    */ 00403000
*/* THE REQUEST IS FOR A NON-SPECIFIC VUA. IF THE BIT IS OFF, THEN   */ 00404000
*/* THE MOUNT MUST BE PERFORMED ON THAT PARTICULAR VUA, OR NOT AT    */ 00405000
*/* ALL. THEREFORE, WHENEVER THE 'RETRY' BIT IS OFF, THE MOUNT ORDER */ 00406000
*/* WILL BE ISSUED DIRECTLY; AND WHENEVER THE BIT IS ON, THE MOUNTED */ 00407000
*/* VOLUME TABLE WILL FIRST BE CHECKED FOR ANY SPACE IN ANY SDG      */ 00408000
*/* CURRENTLY ALLOCATED FOR THE REQUESTED VOLUME. IF NONE IS FOUND,  */ 00409000
*/* THEN THE ORIGINAL ORDER IS ISSUED. HOWEVER, IF SPACE IS FOUND    */ 00410000
*/* FOR THE VOLUME, THEN THE SDG OF THAT SPACE IS COMPARED WITH THE  */ 00411000
*/* SDG OF THE VUA INITIALLY SELECTED FOR THIS MOUNT REQUEST. IF THE */ 00412000
*/* TWO ARE EQUAL, THEN THE MOUNT REQUEST IS ISSUED JUST AS IT IS,   */ 00413000
*/* SINCE IT MAY NOT HAVE TO REPICK A CARTRIDGE. HOWEVER, WHEN THE   */ 00414000
*/* SDG'S DON'T MATCH, THE CORRECT SDG (THE ONE IN WHICH SPACE IS    */ 00415000
*/* CURRENTLY ALLOCATED) IS PLACED INTO THE MSSCOM, AND AN ERROR     */ 00416000
*/* RETURN WITH RETURN CODE 10 IS EFFECTED.                          */ 00417000
*/* **************************************************************** */ 00418000
*                                                                  0199 00419000
*               IF MSSRETRY=ON THEN                                0199 00420000
         TM    MSSRETRY(COMMPTR),B'00001000'                       0199 00421000
         BNO   @RF00199                                            0199 00422000
*                 DO;               /* IS MOUNT RETRIABLE?@VA12420   */ 00423000
*                   CALL QRYPROC;   /* YES - THEN QRY MVT    @VA12420*/ 00424000
         BAL   @14,QRYPROC                                         0201 00425000
*                   RFY                                            0202 00426000
*                     R15 RSTD;     /* RESTRICT R15          @VA12420*/ 00427000
*                   IF R15='0'X THEN                               0203 00428000
         LTR   R15,R15                                             0203 00429000
         BNZ   @RF00203                                            0203 00430000
*                     DO;           /* QUERY GO OKAY?        @VA12420*/ 00431000
*                       CALL MNTPROC;/* YES - ISSUE MOUNT    @VA12420*/ 00432000
         BAL   @14,MNTPROC                                         0205 00433000
*                     END;          /*                       @VA12420*/ 00434000
*                   ELSE                                           0207 00435000
*                     DO;           /* NO - THEN RC10        @VA12420*/ 00436000
         B     @RC00203                                            0207 00437000
@RF00203 DS    0H                                                  0208 00438000
*                       RSNCODE=R15;/* SET THAT RSN CODE     @VA12420*/ 00439000
         STCM  R15,15,RSNCODE                                      0208 00440000
*                       MSSRC=RSNCODE(3:4);/* PUT RC IN MSSCOM     0209 00441000
*                                                            @VA12420*/ 00442000
         MVC   MSSRC(2,COMMPTR),RSNCODE+2                          0209 00443000
*                     END;          /*                       @VA12420*/ 00444000
*                 END;              /*                       @VA12420*/ 00445000
*               ELSE                                               0212 00446000
*                 DO;               /* NO - NOT RETRIABLE    @VA12420*/ 00447000
         B     @RC00199                                            0212 00448000
@RF00199 DS    0H                                                  0213 00449000
*                   CALL MNTPROC;   /* ISSUE MOUNT ORDER     @VA12420*/ 00450000
         BAL   @14,MNTPROC                                         0213 00451000
*                 END;              /*                       @VA12420*/ 00452000
*               IF R15=0 THEN                                      0215 00453000
@RC00199 LTR   R15,R15                                             0215 00454000
         BNZ   @RF00215                                            0215 00455000
*                 DO;               /* GOOD RETURN CODE?     @VA12420*/ 00456000
*                   RFY                                            0217 00457000
*                     R15 UNRSTD;   /* FREE UP R15           @VA12420*/ 00458000
*                   CALL DIAG(DONEOK);/* YES - GOOD RETURN   @VA12420*/ 00459000
         LA    @01,@AL00218                                        0218 00460000
         BAL   @14,DIAG                                            0218 00461000
*                 END;              /*                       @VA12420*/ 00462000
*               ELSE                                               0220 00463000
*                 DO;               /* NO - THEN...          @VA12420*/ 00464000
         B     @RC00215                                            0220 00465000
@RF00215 DS    0H                                                  0221 00466000
*                   CALL MSSERROR;  /* ERROR RETURN          @VA12420*/ 00467000
         BAL   @14,MSSERROR                                        0221 00468000
*                 END;              /*                       @VA12420*/ 00469000
*             END;                  /*                       @VA12420*/ 00470000
*/* **************************************************************** */ 00471000
*/* IF A MOUNT WAS NOT REQUESTED, MAYBE A DEMOUNT WAS.               */ 00472000
*/* **************************************************************** */ 00473000
*                                                                  0224 00474000
*           ELSE                                                   0224 00475000
*             IF DEMOUNT=ON THEN    /* DEMOUNT BIT SET?      @VA11343*/ 00476000
*                                                                  0224 00477000
         B     @RC00197                                            0224 00478000
@RF00197 TM    DEMOUNT(COMMPTR),B'00100000'                        0224 00479000
         BNO   @RF00224                                            0224 00480000
*               /*****************************************************/ 00481000
*               /*                                                   */ 00482000
*               /* ********************************************      */ 00483000
*               /* DEMOUNT WAS REQUESTED DO A DEMOUNT BY VUA...DMFLAG*/ 00484000
*               /* IS SET                                            */ 00485000
*               /* ********************************************      */ 00486000
*               /*                                                   */ 00487000
*               /*****************************************************/ 00488000
*                                                                  0225 00489000
*               DO;                                                0225 00490000
*                                                                  0225 00491000
*                 /***************************************************/ 00492000
*                 /*                                                 */ 00493000
*                 /* *************************************************/ 00494000
*                 /* ********                                @Y30LB02*/ 00495000
*                 /* MACMEAN MSSC MOUNT/DEMOUNT MACRO        @Y30LB02*/ 00496000
*                 /* VS1-4/VS2-3 VERSION-- 01/19/76 LEVEL 00 @ZDR2048*/ 00497000
*                 /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.        */ 00498000
*                 /*                                         @Y30LB02*/ 00499000
*                 /* THE LIST FORM OF THIS MACRO SHOULD BE   @Y30LB02*/ 00500000
*                 /* INVOKED FIRST IN ORDER TO SET UP NECESSARY      */ 00501000
*                 /*                                         @Y30LB02*/ 00502000
*                 /* DECLARES. IF THE COMPLETE ARGUMENT IS   @Y30LB02*/ 00503000
*                 /* SPECIFIED THE REQ BLOCK WILL BE ZEROED. @Y30LB02*/ 00504000
*                 /* *************************************************/ 00505000
*                 /* ********                                @Y30LB02*/ 00506000
*                 /*                                                 */ 00507000
*                 /***************************************************/ 00508000
*                                                                  0226 00509000
*                 RFY                                              0226 00510000
*                   MDREG1 RSTD;    /* RESTRICT REG 1        @Y30LB02*/ 00511000
*                 MDREG1=ADDR(DMOBLK);/* R1 PTR TO REQ BLOCK @Y30LB02*/ 00512000
         LA    MDREG1,DMOBLK                                       0227 00513000
*                 DMLEN='1C'X;      /* LENGTH DEMOUNT REQUEST BLOCK     00514000
*                                                            @Y30LB02*/ 00515000
         LA    @12,28                                              0228 00516000
         ST    @12,DMLEN                                           0228 00517000
*                 DMOPCD='06'X;     /* DEMOUNT OPCODE        @Y30LB02*/ 00518000
         MVI   DMOPCD,X'06'                                        0229 00519000
*                 DMNTFLAG=(DMFLAG);/* VALUE OF FLAGS        @Y30LB02*/ 00520000
         LH    @12,DMFLAG                                          0230 00521000
         N     @12,@CF02341                                        0230 00522000
         STH   @12,DMNTFLAG                                        0230 00523000
*                 DMVOL=(MSSSER);   /* VALUE OF VOLID        @Y30LB02*/ 00524000
         MVC   DMVOL(6),MSSSER(COMMPTR)                            0231 00525000
*                 DMNTVUA=(MSSVUA); /* FILL VALUE OF VUA     @ZDR2048*/ 00526000
         LH    @12,MSSVUA(,COMMPTR)                                0232 00527000
         N     @12,@CF02341                                        0232 00528000
         STH   @12,DMNTVUA                                         0232 00529000
*                 DMVUAVAL='1'B;    /* OR ON THE VUA VALID ATTRIBUTE    00530000
*                                      FLAG                  @ZDR2048*/ 00531000
         OI    DMVUAVAL,B'00100000'                                0233 00532000
*                 DMHOST=(CPUID);   /* FILLIN HOSTID         @Y30LB02*/ 00533000
         MVC   DMHOST(5),CPUID                                     0234 00534000
*                 SVC(126);         /* INVOKE THE SSC SVC    @Y30LB02*/ 00535000
         SVC   126                                                 0235 00536000
*                 RFY                                              0236 00537000
*                   MDREG1 UNRSTD;  /* UNREST REG 1          @Y30LB02*/ 00538000
*                 RFY                                              0237 00539000
*                   R15 RSTD;                                      0237 00540000
*                 RETCODE=R15;      /* GET THE RETURN CODE           */ 00541000
         ST    R15,RETCODE                                         0238 00542000
*                 IF RETCODE^=ZEROFULL THEN/*                @VA11320*/ 00543000
         L     @14,RETCODE                                         0239 00544000
         LTR   @14,@14                                             0239 00545000
         BZ    @RF00239                                            0239 00546000
*                   DO;             /*                       @VA11320*/ 00547000
*                     RFY                                          0241 00548000
*                       R0 RSTD;    /*                       @VA11320*/ 00549000
*                     TEMP4=R0;     /* GET ERROR RET CODE    @VA11343*/ 00550000
         STCM  R0,15,TEMP4                                         0242 00551000
*                     MSSRC=TEMP4(3:4);/* LAST 2 BYTES!      @VA11343*/ 00552000
         MVC   MSSRC(2,COMMPTR),TEMP4+2                            0243 00553000
*                     RFY                                          0244 00554000
*                       R0 UNRSTD;  /*                       @VA11320*/ 00555000
*                   END;            /*                       @VA11320*/ 00556000
*                 ELSE                                             0246 00557000
*                   MSSRC=ZEROFULL; /*                       @VA11320*/ 00558000
         B     @RC00239                                            0246 00559000
@RF00239 SLR   @14,@14                                             0246 00560000
         STH   @14,MSSRC(,COMMPTR)                                 0246 00561000
*                 RFY                                              0247 00562000
*                   R15 UNRSTD;                                    0247 00563000
@RC00239 DS    0H                                                  0248 00564000
*                 CALL MSSCHEK;                                    0248 00565000
         BAL   @14,MSSCHEK                                         0248 00566000
*               END;                /*                       @VA11343*/ 00567000
*/* **************************************************************** */ 00568000
*/* IF NEITHER MOUNT NOR DEMOUNT, MAYBE IT'S A RELINQUISH REQUEST.   */ 00569000
*/*                                                                  */ 00570000
*/* IF SO, THEN JUST ISSUE THE RELINQUISH ORDER AND RETURN TO CALLER */ 00571000
*/* (THE RETURN CODE MUST BE 0). NO PACK CHANGE INTERRUPT WILL BE    */ 00572000
*/* GENERATED. PROCESSING SHOULD CONTINUE NORMALLY.                  */ 00573000
*/* **************************************************************** */ 00574000
*                                                                  0250 00575000
*             ELSE                                                 0250 00576000
*               IF RELINQSH=ON THEN                                0250 00577000
         B     @RC00224                                            0250 00578000
@RF00224 TM    RELINQSH(COMMPTR),B'00010000'                       0250 00579000
         BNO   @RF00250                                            0250 00580000
*                 DO;               /*                       @VA11344*/ 00581000
*                   BEGCC='0000'X;  /* SET BEGIN EXTENTS     @VA11344*/ 00582000
         SLR   @12,@12                                             0252 00583000
         STH   @12,BEGCC                                           0252 00584000
*                   ENDCC='0193'X;  /* SET END EXTENTS       @VA11344*/ 00585000
         MVC   ENDCC(2),@CH02154                                   0253 00586000
*                   ARFLG=RLQSH;    /* SET FLAG FOR RLQSH@VA11344    */ 00587000
         IC    @12,RLQSH                                           0254 00588000
         STC   @12,ARFLG                                           0254 00589000
*                   ARVOL=MSSSER;   /* VOLID                 @VA11344*/ 00590000
         MVC   ARVOL(6),MSSSER(COMMPTR)                            0255 00591000
*                   ARNMEXT=NMBREXTS;/* NMBR OF EXTENTS      @VA11344*/ 00592000
         IC    @12,NMBREXTS                                        0256 00593000
         STC   @12,ARNMEXT                                         0256 00594000
*                   AREXT=MDSKEXTS; /* EXTENTS FOR VOLID     @VA11344*/ 00595000
*                                                                  0257 00596000
         MVC   AREXT(4),MDSKEXTS                                   0257 00597000
*                   /*************************************************/ 00598000
*                   /*                                               */ 00599000
*                   /* MACRO INVOCATION:                     @ZA28964*/ 00600000
*                   /* ICBACREL MF(E,RLQBLK)TYPE(REL)EXTS(MDSKEXTS)NM*/ 00601000
*                   /* EXTS(NMBREXTS)VOLID(MSSSER)FLAGS(RLQSH)       */ 00602000
*                   /*                                       @ZA28964*/ 00603000
*                   /* ***********************************************/ 00604000
*                   /* ********                              @Y30LB02*/ 00605000
*                   /* MACMEAN MSSC ACQUIRE/RELINQUISH MACRO (OS/VS2 */ 00606000
*                   /* MVS)                                  @G94SB08*/ 00607000
*                   /* VERSION 1.0 RELEASE 1 5/8/78          @G94SB08*/ 00608000
*                   /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.      */ 00609000
*                   /*                                       @Y30LB02*/ 00610000
*                   /* THE LIST FORM OF THIS MACRO SHOULD BE @Y30LB02*/ 00611000
*                   /* INVOKED FIRST IN ORDER TO SET UP NECESSARY    */ 00612000
*                   /*                                       @Y30LB02*/ 00613000
*                   /* DECLARES. THE EXECUTE FORM WILL ONLY  @Y30LB02*/ 00614000
*                   /* ISSUE THE SVC.                        @Y30LB02*/ 00615000
*                   /* ***********************************************/ 00616000
*                   /* ********                              @Y30LB02*/ 00617000
*                   /*                                               */ 00618000
*                   /*************************************************/ 00619000
*                                                                  0258 00620000
*                   RFY                                            0258 00621000
*                    (ARR1) RSTD;   /* RESTRICT R1           @Y30LB02*/ 00622000
*                   ARR1=ADDR(RLQBLK);/* SET ARR1 TO ADDR OF LIST  0259 00623000
*                                                            @Y30LB02*/ 00624000
         LA    ARR1,RLQBLK                                         0259 00625000
*                   SVC(126);       /* ISSUE SVC             @Y30LB02*/ 00626000
         SVC   126                                                 0260 00627000
*                   RFY                                            0261 00628000
*                    (ARR1) UNRSTD; /* UNRESTRICT REG 1      @Y30LB02*/ 00629000
*                                                                  0261 00630000
*                   /*************************************************/ 00631000
*                   /*                                               */ 00632000
*                   /*                                       @VA11344*/ 00633000
*                   /*                                               */ 00634000
*                   /*************************************************/ 00635000
*                                                                  0262 00636000
*                   RETCODE=ZEROFULL;/* SET RET CODE         @VA11344*/ 00637000
         SLR   @12,@12                                             0262 00638000
         ST    @12,RETCODE                                         0262 00639000
*                   MSSRC=ZEROFULL; /*                       @VA11344*/ 00640000
         STH   @12,MSSRC(,COMMPTR)                                 0263 00641000
*                   CALL MSSCHEK;   /*                       @VA11344*/ 00642000
         BAL   @14,MSSCHEK                                         0264 00643000
*                 END;              /*                       @VA11344*/ 00644000
*                                                                  0265 00645000
*           /*********************************************************/ 00646000
*           /*                                                       */ 00647000
*           /* ***************************************** INVALID     */ 00648000
*           /* REQUEST WAS MADE                                      */ 00649000
*           /* *****************************************             */ 00650000
*           /*                                                       */ 00651000
*           /*********************************************************/ 00652000
*                                                                  0266 00653000
*               ELSE                                               0266 00654000
*                 DO;               /*                       @VA11344*/ 00655000
         B     @RC00250                                            0266 00656000
@RF00250 DS    0H                                                  0267 00657000
*                   DO;             /* WTO('INVALID REQUEST CODE IN     00658000
*                                      VM REQUEST') DESC(4)        0267 00659000
*                                      ROUTCDE(2)                    */ 00660000
*                     RFY                                          0268 00661000
*                       GPR01P RSTD;/* RESTRICT REG 1                */ 00662000
*                     GPR01P=ADDR(I03514);/* ADDRESS CONTROL PROGRAM    00663000
*                                      LIST                          */ 00664000
         LA    GPR01P,I03514                                       0269 00665000
*                     SVC(35);      /* ISSUE WTO SVC                 */ 00666000
         SVC   35                                                  0270 00667000
*                     RFY                                          0271 00668000
*                       GPR01P UNRSTD;/* RELEASE REG 1               */ 00669000
*                   END;            /* WTO('INVALID REQUEST CODE IN     00670000
*                                      VM REQUEST') DESC(4)        0272 00671000
*                                      ROUTCDE(2)                    */ 00672000
*                   DECLARE         /* WTO PARAMETER LIST            */ 00673000
*                     1 I03514 STATIC BDY(WORD),                   0273 00674000
*                      2 I0351401 FIXED(15) INIT(38),/* TEXT LENGTH  */ 00675000
*                      2 I0351402 BIT(16) INIT('1000000000000000'B),    00676000
*                                   /* MCS FLAG                      */ 00677000
*                      2 I0351403 CHAR(34) INIT(                   0273 00678000
*                            'INVALID REQUEST CODE IN VM REQUEST'),/*   00679000
*                                      MESSAGE TEXT                  */ 00680000
*                      2 I0351404 BIT(16) INIT('0001000000000000'B),    00681000
*                                   /* DESCRIPTOR CODES              */ 00682000
*                      2 I0351405 BIT(16) INIT('0100000000000000'B);    00683000
*                                   /* ROUTING CODES                 */ 00684000
*                   CALL MSSERROR;  /* TELL VM ERROR OCCURED         */ 00685000
         BAL   @14,MSSERROR                                        0274 00686000
*                 END;              /*                       @VA11343*/ 00687000
*         END L2;                                                  0276 00688000
*       ELSE                                                       0277 00689000
*                                                                  0277 00690000
*         /***********************************************************/ 00691000
*         /*                                                         */ 00692000
*         /* ******************************************************* */ 00693000
*         /* THE FLAG1 FIELD WAS = 0 INDICATING THAT THERE WERE NO   */ 00694000
*         /* OUTSTANDING REQUESTS... GO INTO WAIT              STATE.*/ 00695000
*         /* ******************************************************* */ 00696000
*         /*                                                         */ 00697000
*         /***********************************************************/ 00698000
*                                                                  0277 00699000
*         DO;                                                      0277 00700000
         B     @RC00195                                            0277 00701000
@RF00195 DS    0H                                                  0278 00702000
*WAIT1:                                                            0278 00703000
*           MSSECB=ZEROFULL;        /* CLEAR MSSECB          @VA11318*/ 00704000
WAIT1    SLR   @12,@12                                             0278 00705000
         ST    @12,MSSECB                                          0278 00706000
*           ADMSSECB=ADDR(MSSECB);  /* ASSIGN ADDRESS        @VA11318*/ 00707000
         LA    @01,MSSECB                                          0279 00708000
         ST    @01,ADMSSECB                                        0279 00709000
*           WTORECBA=ADDR(WTORECB); /* ASSIGN ADDRESS        @VA11318*/ 00710000
         LA    @01,WTORECB                                         0280 00711000
         STCM  @01,7,WTORECBA                                      0280 00712000
*           ENDLIST=LISTEND;        /* DENOTE END OF LIST    @VA11318*/ 00713000
         IC    @01,LISTEND                                         0281 00714000
         STC   @01,ENDLIST                                         0281 00715000
*           WTORECB=ZEROFULL;       /* CLEAR WTORECB         @VA11318*/ 00716000
         ST    @12,WTORECB                                         0282 00717000
*           GEN REFS(MSSECB)(WAIT ECBLIST=WTLIST);/*         @VA11318*/ 00718000
         WAIT ECBLIST=WTLIST                                            00719000
*           IF POSTFLAG=ON THEN                                    0284 00720000
         TM    POSTFLAG,B'01000000'                                0284 00721000
         BNO   @RF00284                                            0284 00722000
*             DO;                   /* TERMINATING DMKMSS    @VA12978*/ 00723000
*               IF WTOREPLY='Q' THEN/* CORRECT RESPONSE?     @VA12978*/ 00724000
         CLI   WTOREPLY,C'Q'                                       0286 00725000
         BE    @RT00286                                            0286 00726000
*                 GOTO ABNEXIT;     /*                       @VA11318*/ 00727000
*               ELSE                                               0288 00728000
*                 DO;               /* NO - REISSUE MSG      @VA12978*/ 00729000
*                   CALL RPLYPROC;  /* REISSUE TERMINATION INSTR   0289 00730000
*                                                            @VA12978*/ 00731000
         BAL   @14,RPLYPROC                                        0289 00732000
*                 END;              /*                       @VA12978*/ 00733000
*             END;                                                 0291 00734000
*           ELSE                                                   0292 00735000
*             ;                     /*                       @VA11318*/ 00736000
@RF00284 DS    0H                                                  0293 00737000
*         END;                      /*                       @VA12978*/ 00738000
*/* **************************************************************** */ 00739000
*/*       GO BACK TO THE MAIN LOOP TO REQUEST MORE WORK FROM VM      */ 00740000
*/* **************************************************************** */ 00741000
*                                                                  0294 00742000
*       GO TO MAINLOOP;                                            0294 00743000
         B     MAINLOOP                                            0294 00744000
*     END L1;                                                      0295 00745000
*                                                                  0295 00746000
*/* **************************************************************** */ 00747000
*/*   ERROR HAS OCCURED, DCB NOT OPENED | MSS NOT INITILIZED |       */ 00748000
*/*   DMKMSS IS NOT RUNNING IN A VIRTUAL MACHINE                     */ 00749000
*/*         WRITE TO OPERATOR, RETURN TO THE SYSTEM                  */ 00750000
*/* **************************************************************** */ 00751000
*                                                                  0296 00752000
*   ELSE                                                           0296 00753000
*     DO;                                                          0296 00754000
@RF00125 DS    0H                                                  0297 00755000
*       IF MSSINIT=OFF THEN                                        0297 00756000
         TM    MSSINIT,B'10000000'                                 0297 00757000
         BNZ   @RF00297                                            0297 00758000
*         DO;                       /* WTO('DMKMSS ENDING ERROR- MSS    00759000
*                                      NOT INITIALIZED') DESC(4)   0298 00760000
*                                      ROUTCDE(2)                    */ 00761000
*           RFY                                                    0299 00762000
*             GPR01P RSTD;          /* RESTRICT REG 1                */ 00763000
*           GPR01P=ADDR(I03516);    /* ADDRESS CONTROL PROGRAM LIST  */ 00764000
         LA    GPR01P,I03516                                       0300 00765000
*           SVC(35);                /* ISSUE WTO SVC                 */ 00766000
         SVC   35                                                  0301 00767000
*           RFY                                                    0302 00768000
*             GPR01P UNRSTD;        /* RELEASE REG 1                 */ 00769000
*         END;                      /* WTO('DMKMSS ENDING ERROR- MSS    00770000
*                                      NOT INITIALIZED') DESC(4)   0303 00771000
*                                      ROUTCDE(2)                    */ 00772000
*       DECLARE                     /* WTO PARAMETER LIST            */ 00773000
*         1 I03516 STATIC BDY(WORD),                               0304 00774000
*          2 I0351601 FIXED(15) INIT(44),/* TEXT LENGTH              */ 00775000
*          2 I0351602 BIT(16) INIT('1000000000000000'B),/* MCS FLAG  */ 00776000
*          2 I0351603 CHAR(40) INIT(                               0304 00777000
*                'DMKMSS ENDING ERROR- MSS NOT INITIALIZED'),/*    0304 00778000
*                                      MESSAGE TEXT                  */ 00779000
*          2 I0351604 BIT(16) INIT('0001000000000000'B),/* DESCRIPTOR   00780000
*                                      CODES                         */ 00781000
*          2 I0351605 BIT(16) INIT('0100000000000000'B);/* ROUTING 0304 00782000
*                                      CODES                         */ 00783000
@RF00297 DS    0H                                                  0305 00784000
*       IF DCBOFOPN=OFF THEN                                       0305 00785000
         TM    DCBOFOPN+40(DCBPTR),B'00010000'                     0305 00786000
         BNZ   @RF00305                                            0305 00787000
*         DO;                       /* WTO('DMKMSS ENDING ERROR- DCB    00788000
*                                      FOR COMM. DEVICE NOT OPENED')    00789000
*                                      DESC(4) ROUTCDE(2)            */ 00790000
*           RFY                                                    0307 00791000
*             GPR01P RSTD;          /* RESTRICT REG 1                */ 00792000
*           GPR01P=ADDR(I03518);    /* ADDRESS CONTROL PROGRAM LIST  */ 00793000
         LA    GPR01P,I03518                                       0308 00794000
*           SVC(35);                /* ISSUE WTO SVC                 */ 00795000
         SVC   35                                                  0309 00796000
*           RFY                                                    0310 00797000
*             GPR01P UNRSTD;        /* RELEASE REG 1                 */ 00798000
*         END;                      /* WTO('DMKMSS ENDING ERROR- DCB    00799000
*                                      FOR COMM. DEVICE NOT OPENED')    00800000
*                                      DESC(4) ROUTCDE(2)            */ 00801000
*       DECLARE                     /* WTO PARAMETER LIST            */ 00802000
*         1 I03518 STATIC BDY(WORD),                               0312 00803000
*          2 I0351801 FIXED(15) INIT(56),/* TEXT LENGTH              */ 00804000
*          2 I0351802 BIT(16) INIT('1000000000000000'B),/* MCS FLAG  */ 00805000
*          2 I0351803 CHAR(52) INIT(                               0312 00806000
*                'DMKMSS ENDING ERROR- DCB FOR COMM. DEVICE NOT OPENED' 00807000
*                ),                 /* MESSAGE TEXT                  */ 00808000
*          2 I0351804 BIT(16) INIT('0001000000000000'B),/* DESCRIPTOR   00809000
*                                      CODES                         */ 00810000
*          2 I0351805 BIT(16) INIT('0100000000000000'B);/* ROUTING 0312 00811000
*                                      CODES                         */ 00812000
@RF00305 DS    0H                                                  0313 00813000
*       IF VIRTFLAG=OFF THEN                                       0313 00814000
         TM    VIRTFLAG,B'01000000'                                0313 00815000
         BNZ   @RF00313                                            0313 00816000
*         DO;                       /* WTO('DMKMSS ENDING          0314 00817000
*                                      ERROR-DMKMSS MUST RUN IN A  0314 00818000
*                                      VIRTUAL MACH.') DESC(4)     0314 00819000
*                                      ROUTCDE(2)                    */ 00820000
*           RFY                                                    0315 00821000
*             GPR01P RSTD;          /* RESTRICT REG 1                */ 00822000
*           GPR01P=ADDR(I03520);    /* ADDRESS CONTROL PROGRAM LIST  */ 00823000
         LA    GPR01P,I03520                                       0316 00824000
*           SVC(35);                /* ISSUE WTO SVC                 */ 00825000
         SVC   35                                                  0317 00826000
*           RFY                                                    0318 00827000
*             GPR01P UNRSTD;        /* RELEASE REG 1                 */ 00828000
*         END;                      /* WTO('DMKMSS ENDING          0319 00829000
*                                      ERROR-DMKMSS MUST RUN IN A  0319 00830000
*                                      VIRTUAL MACH.') DESC(4)     0319 00831000
*                                      ROUTCDE(2)                    */ 00832000
*       DECLARE                     /* WTO PARAMETER LIST            */ 00833000
*         1 I03520 STATIC BDY(WORD),                               0320 00834000
*          2 I0352001 FIXED(15) INIT(58),/* TEXT LENGTH              */ 00835000
*          2 I0352002 BIT(16) INIT('1000000000000000'B),/* MCS FLAG  */ 00836000
*          2 I0352003 CHAR(54) INIT(                               0320 00837000
*'DMKMSS ENDING ERROR-DMKMSS MUST RUN IN A VIRTUAL MACH.'),/* MESSAGE   00838000
*                                      TEXT                          */ 00839000
*          2 I0352004 BIT(16) INIT('0001000000000000'B),/* DESCRIPTOR   00840000
*                                      CODES                         */ 00841000
*          2 I0352005 BIT(16) INIT('0100000000000000'B);/* ROUTING 0320 00842000
*                                      CODES                         */ 00843000
@RF00313 DS    0H                                                  0321 00844000
*FINISH:                            /*                       @VA11343*/ 00845000
*       RCODE=FOUR;                 /* EXPECTING RETCODE OF 4 IF   0321 00846000
*                                      ERROR                         */ 00847000
FINISH   MVC   RCODE(2),@CH00109                                   0321 00848000
*/* **************************************************************** */ 00849000
*/*       FREE THE OBTAINED STORAGE AND RETURN TO THE CALLER   ##C## */ 00850000
*/* **************************************************************** */ 00851000
*                                                                  0322 00852000
*       GEN CODE REFS(R13,R0,R1,R10,RCODE,R14,R12,R15);            0322 00853000
*                                                            /*##C##*/  00854000
          L R13,4(,R13)                                       ##C##     00855000
          L R2,@SIZDATD                                       ##C##     00856000
          LR R1,R10                                           ##C##     00857000
          FREEMAIN R,LV=(2),A=(1),SP=241                      ##C##     00858000
          L R15,RCODE                                         ##C##     00859000
          L R14,12(,R13)                                      ##C##     00860000
          LM R0,R12,20(R13)                                   ##C##     00861000
          BR R14                                              ##C##     00862000
*     END;                                                         0323 00863000
*                                                                  0324 00864000
*/* **************************************************************** */ 00865000
*/*      THE FOLLOWING CODE IS EXECUTED ONLY IF THIS PROCEDURE       */ 00866000
*/*      TERMINATES WITH ABEND. INFORM VM VIA THE DIAGNOSE INST.     */ 00867000
*/*      THAT COMMUNICATION WITH THE MSC IS NO LONGER POSSIBLE       */ 00868000
*/*      AND NO MORE REQUESTS CAN BE HONORED.                        */ 00869000
*/* **************************************************************** */ 00870000
*                                                                  0324 00871000
*ABNEXIT:                                                          0324 00872000
*   GEN CODE;                                                      0324 00873000
ABNEXIT  DS    0H                                                  0324 00874000
*                                                    /*   @VA11317 */   00875000
         BALR @11,0                                  /*   @VA11317 */   00876000
ABNEXIT1 EQU *                                       /*   @VA11317 */   00877000
         LA @14,ABNEXIT1-@PSTART                     /*   @VA11317 */   00878000
         SR @11,@14                                  /*   @VA11317 */   00879000
*   RFY                                                            0325 00880000
*     UCBOB BASED(UCBPTR);          /* GET COMM. UCB         @VA11318*/ 00881000
*   MSSECBAD=SAVE1;                 /* RESTORE COMM. UCB     @VA11318*/ 00882000
         L     @12,SAVE1                                           0326 00883000
         ST    @12,MSSECBAD(,UCBPTR)                               0326 00884000
*   UCBATI=SAVE3;                   /* RESTORE COMM. UCB     @VA11318*/ 00885000
         L     @12,SAVE3                                           0327 00886000
         STC   @12,UCBATI(,UCBPTR)                                 0327 00887000
*   CALL DIAG(EXITABND);                                           0328 00888000
*                                                                  0328 00889000
         LA    @01,@AL00328                                        0328 00890000
         BAL   @14,DIAG                                            0328 00891000
*/* **************************************************************** */ 00892000
*/*     FREE OBTAINED STORAGE AND RETURN TO CALLER          ##C##    */ 00893000
*/* **************************************************************** */ 00894000
*                                                                  0329 00895000
*   GEN CODE REFS(R13,R0,R1,R10,R12,R14);                          0329 00896000
*                                                          /*##C##*/    00897000
        L R13,4(,R13)                                      ##C##        00898000
        L R2,@SIZDATD                                      ##C##        00899000
        LR R1,R10                                          ##C##        00900000
        FREEMAIN R,LV=(2),A=(1),SP=241                     ##C##        00901000
        L R14,12(,R13)                                     ##C##        00902000
        LM R0,R12,20(R13)                                  ##C##        00903000
        BR R14                                             ##C##        00904000
*                                                                  0330 00905000
*/* **************************************************************** */ 00906000
*/* |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||*/ 00907000
*/* THE FOLLOWING INTERNAL PROCEDURE CHECKS THE RETURN CODE          */ 00908000
*/* TO DETERMINE IF AN MSC ERROR WAS DETECTED DURING THE             */ 00909000
*/* MOUNT OR DEMOUNT. AN ALTERNATE ENTRY IS PROVIDED FOR THE CASE    */ 00910000
*/* THAT THE REQUEST WAS NEITHER A MOUNT NOR A DEMOUNT- AT THIS      */ 00911000
*/* POINT IT IS KNOWN THAT AN ERROR EXISTS BUT VM MUST BE TOLD.      */ 00912000
*/* |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||*/ 00913000
*/* **************************************************************** */ 00914000
*                                                                  0330 00915000
*MSSCHEK:                                                          0330 00916000
*   PROC;                                                          0330 00917000
@EL00001 L     @13,4(,@13)                                         0330 00918000
@EF00001 DS    0H                                                  0330 00919000
@ER00001 LM    @14,@12,12(@13)                                     0330 00920000
         BR    @14                                                 0330 00921000
MSSCHEK  STM   @14,@12,@SA00002                                    0330 00922000
*   IF RETCODE=ZEROFULL THEN        /* CHECK RETURN CODE FROM      0331 00923000
*                                      ICBMNTDE                      */ 00924000
         L     @12,RETCODE                                         0331 00925000
         LTR   @12,@12                                             0331 00926000
         BNZ   @RF00331                                            0331 00927000
*/* **************************************************************** */ 00928000
*/*            TELL VM THAT ALL WENT OK                              */ 00929000
*/* **************************************************************** */ 00930000
*                                                                  0332 00931000
*     DO;                                                          0332 00932000
*       CALL DIAG(DONEOK);                                         0333 00933000
         LA    @01,@AL00333                                        0333 00934000
         BAL   @14,DIAG                                            0333 00935000
*     END;                                                         0334 00936000
*   ELSE                                                           0335 00937000
*     DO;                                                          0335 00938000
*                                                                  0335 00939000
         B     @RC00331                                            0335 00940000
@RF00331 DS    0H                                                  0336 00941000
*/* **************************************************************** */ 00942000
*/*               TELL VM THAT AN ERROR OCCURED                      */ 00943000
*/* **************************************************************** */ 00944000
*                                                                  0336 00945000
*MSSERROR:                                                         0336 00946000
*       ENTRY;                                                     0336 00947000
         B     @EC00336                                            0336 00948000
MSSERROR STM   @14,@12,@SA00002                                    0336 00949000
@EC00336 DS    0H                                                  0337 00950000
*       MSSERR=ON;                  /* SET THE FLAG IN MSSCOM        */ 00951000
         OI    MSSERR(COMMPTR),B'00000100'                         0337 00952000
*       CALL DIAG(ERRMSS);                                         0338 00953000
         LA    @01,@AL00338                                        0338 00954000
         BAL   @14,DIAG                                            0338 00955000
*     END;                                                         0339 00956000
*   END MSSCHEK;                                                   0340 00957000
@EL00002 DS    0H                                                  0340 00958000
@EF00002 DS    0H                                                  0340 00959000
@ER00002 LM    @14,@12,@SA00002                                    0340 00960000
         BR    @14                                                 0340 00961000
*                                                                  0341 00962000
*/* **************************************************************** */ 00963000
*/* |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||| */ 00964000
*/*         THIS PROCEDURE ISSUES THE DIAGNOSE INSTRUCTION           */ 00965000
*/*         WITH THE OPERATION CODE IN R5 AND THE REAL ADDRERSS      */ 00966000
*/*         OF THE ANSWER AREA IN R4.                                */ 00967000
*/* |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||| */ 00968000
*/* **************************************************************** */ 00969000
*                                                                  0341 00970000
*DIAG:                                                             0341 00971000
*   PROC(OPCODE);                                                  0341 00972000
DIAG     STM   @14,@12,@SA00003                                    0341 00973000
         MVC   @PC00003(4),0(@01)                                  0341 00974000
*   DCL                                                            0342 00975000
*     OPCODE FIXED;                                                0342 00976000
*   R5=OPCODE;                                                     0343 00977000
         L     @12,@PC00003                                        0343 00978000
         L     R5,OPCODE(,@12)                                     0343 00979000
*   R6=ADDR(BUFFER);                                               0344 00980000
         LA    R6,BUFFER                                           0344 00981000
*   GEN REFS(R0,R4,R6,DIAGNOSE);                                   0345 00982000
              LRA R4,0(R6)                                              00983000
              EX R0,DIAGNOSE                                            00984000
*   END DIAG;                                                      0346 00985000
@EL00003 DS    0H                                                  0346 00986000
@EF00003 DS    0H                                                  0346 00987000
@ER00003 LM    @14,@12,@SA00003                                    0346 00988000
         BR    @14                                                 0346 00989000
*                                                                  0347 00990000
*/* **************************************************************** */ 00991000
*/*  SUB-PROC TO ISSUE THE MESSAGE DESCRIBING HOW TO TERMINATE       */ 00992000
*/*  DMKMSS                                                          */ 00993000
*/* **************************************************************** */ 00994000
*                                                                  0347 00995000
*RPLYPROC:                                                         0347 00996000
*   PROC;                           /* TERMINATE MSG SUBPROC @VA12978*/ 00997000
RPLYPROC STM   @14,@12,@SA00004                                    0347 00998000
*   WTOREPLY=BLNK;                  /* CLEAR WTOREPLY        @VA11318*/ 00999000
         MVC   WTOREPLY(1),BLNK                                    0348 01000000
*   WTORECB=ZEROFULL;               /* ZERO WTORECB          @VA11318*/ 01001000
         SLR   @12,@12                                             0349 01002000
         ST    @12,WTORECB                                         0349 01003000
*   GEN CODE;                                                      0350 01004000
        WTOR ' REPLY ''Q'' TO TERMINATE DMKMSS ',                     XX01005000
               WTOREPLY,1,WTORECB,ROUTCDE=(2)                           01006000
*   RETURN;                         /* RETURN TO CALLER      @VA12978*/ 01007000
@EL00004 DS    0H                                                  0351 01008000
@EF00004 DS    0H                                                  0351 01009000
@ER00004 LM    @14,@12,@SA00004                                    0351 01010000
         BR    @14                                                 0351 01011000
*   END RPLYPROC;                                                  0352 01012000
*QRYPROC:                                                          0353 01013000
*   PROC;                           /*                       @VA12420*/ 01014000
QRYPROC  STM   @14,@12,@SA00005                                    0353 01015000
*   RFY                                                            0354 01016000
*    (R0,                                                          0354 01017000
*     R1) RSTD;                     /*                       @VA12420*/ 01018000
*   R0=512;                         /* SIZE OF THE MVT QUERY RESPONSE   01019000
*                                                            @VA11343*/ 01020000
         LA    R0,512                                              0355 01021000
*   GEN(GETMAIN R,LV=(0));          /* GET MVT BUFFER        @VA11343*/ 01022000
         GETMAIN R,LV=(0)                                               01023000
*   MVTPTR=R1;                      /* SAVE POINTER TO MVT BUFFER  0357 01024000
*                                                            @VA11343*/ 01025000
         ST    R1,MVTPTR                                           0357 01026000
*   RFY                                                            0358 01027000
*    (R0,                                                          0358 01028000
*     R1) UNRSTD;                   /* DONE WITH RSTD REGS   @VA11343*/ 01029000
*   QRYID='20'X;                    /* MVT TABLE ID          @VA11343*/ 01030000
         MVI   QRYID,X'20'                                         0359 01031000
*   QRYRD='01'X;                    /* DO READ-ONLY OF MVT TBL     0360 01032000
*                                                            @VA11343*/ 01033000
         MVI   QRYRD,X'01'                                         0360 01034000
*   QRYSEC='0000'X;                 /* NO CYL,HD,REC NEEDED  @VA11343*/ 01035000
         MVC   QRYSEC(2),@CB02003                                  0361 01036000
*   QRYVOL=MSSSER;                  /* LOOK FOR THIS VOLID   @VA11343*/ 01037000
         MVC   QRYVOL(6),MSSSER(COMMPTR)                           0362 01038000
*   QRYFILL=''B;                    /* BLANKS IN REST OF PARM      0363 01039000
*                                                            @VA11343*/ 01040000
         XC    QRYFILL(10),QRYFILL                                 0363 01041000
*   DCL                                                            0364 01042000
*     QUERR1 REG(1) PTR;            /* WILL CONTAIN BLK ADDRESS    0364 01043000
*                                                            @Z40LB22*/ 01044000
*                                                                  0364 01045000
*   /*****************************************************************/ 01046000
*   /*                                                               */ 01047000
*   /* *******************************************************       */ 01048000
*   /*                                                       @Z40LB22*/ 01049000
*   /* MSSC ICBQUERY QSWCS/QLAB/QTAB/QSWCS QCEL MACRO        @Z40LB22*/ 01050000
*   /* OS/VS2 VERSION-- 03/21/75 LEVEL 00                    @Z40LB22*/ 01051000
*   /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.              @Z40LB22*/ 01052000
*   /* THE LIST FORM OF THIS MACRO SHOULD BE                 @Z40LB22*/ 01053000
*   /* INVOKED FIRST IN ORDER TO SET UP NECESSARY            @Z40LB22*/ 01054000
*   /* DECLARES. IF THE COMPLETE ARGUMENT IS                 @Z40LB22*/ 01055000
*   /* SPECIFIED THE REQ BLOCK WILL BE ZEROED.               @Z40LB22*/ 01056000
*   /* *******************************************************       */ 01057000
*   /*                                                       @Z40LB22*/ 01058000
*   /*                                                               */ 01059000
*   /*****************************************************************/ 01060000
*                                                                  0365 01061000
*   RFY                                                            0365 01062000
*    (QUERR1) RSTD;                 /* RESTRICT R1           @Z40LB22*/ 01063000
*   QUERR1=ADDR(QUERLIST);          /* SET QUERR1 TO REQ BLOCK     0366 01064000
*                                                            @Z40LB22*/ 01065000
         LA    QUERR1,QUERLIST                                     0366 01066000
*   QUERLIST=QUERLIST&&QUERLIST;    /* ZERO REQUEST BLOCK    @Z40LB22*/ 01067000
         XC    QUERLIST(44),QUERLIST                               0367 01068000
*   QULEN='2C'X;                    /* SET LENGTH FIELD      @Z40LB22*/ 01069000
         LA    @12,44                                              0368 01070000
         ST    @12,QULEN                                           0368 01071000
*   QUORD='05'X;                    /* SET OPCODE FIELD      @Z40LB22*/ 01072000
         MVI   QUORD,X'05'                                         0369 01073000
*   QUCODE='06'X;                   /* SET CODE TYPE         @Z40LB22*/ 01074000
         MVI   QUCODE,X'06'                                        0370 01075000
*   QUPARM=(QRYPARM);               /* FILL IN PARAMETERS    @Z40LB22*/ 01076000
         MVI   QUPARM+20,C' '                                      0371 01077000
         MVC   QUPARM+21(11),QUPARM+20                             0371 01078000
         MVC   QUPARM(20),QRYPARM                                  0371 01079000
*   QUPTR=ADDR(MVTBL);              /* ADDR OF DATAPTR FIELD @Z40LB22*/ 01080000
         L     @12,MVTPTR                                          0372 01081000
         ST    @12,QUPTR                                           0372 01082000
*   SVC(126);                       /* ISSUE SVC INST.       @Z40LB22*/ 01083000
         SVC   126                                                 0373 01084000
*   RFY                                                            0374 01085000
*    (QUERR1) UNRSTD;               /* UNRESTRICT R1         @Z40LB22*/ 01086000
*                                                                  0374 01087000
*   /*****************************************************************/ 01088000
*   /*                                                               */ 01089000
*   /*                                                       @VA11343*/ 01090000
*   /*                                                               */ 01091000
*   /*****************************************************************/ 01092000
*                                                                  0375 01093000
*   RFY                                                            0375 01094000
*    (R0,                                                          0375 01095000
*     R1,                                                          0375 01096000
*     R15) RSTD;                    /*                       @VA11343*/ 01097000
*   IF R15=0 THEN                   /* QRY WAS OK IF R15 = 0 @VA11343*/ 01098000
         LTR   R15,R15                                             0376 01099000
         BNZ   @RF00376                                            0376 01100000
*     IF MVOLNDX=MVENT THEN         /* FIND AN ENTRY?        @VA11343*/ 01101000
         L     @14,MVTPTR                                          0377 01102000
         CLC   MVOLNDX(1,@14),MVENT                                0377 01103000
         BNE   @RF00377                                            0377 01104000
*       IF MSSSDG=SDGNDX THEN                                      0378 01105000
         CLC   MSSSDG(1,COMMPTR),SDGNDX(@14)                       0378 01106000
         BNE   @RF00378                                            0378 01107000
*         R15=0;                    /* SDG NUMBERS MATCH?    @VA11343*/ 01108000
         SLR   R15,R15                                             0379 01109000
*       ELSE                                                       0380 01110000
*         DO;                       /*                       @VA11343*/ 01111000
         B     @RC00378                                            0380 01112000
@RF00378 DS    0H                                                  0381 01113000
*           MSSSDG=SDGNDX;          /* NO - GET CORRECT SDG  @VA12420*/ 01114000
         L     @14,MVTPTR                                          0381 01115000
         MVC   MSSSDG(1,COMMPTR),SDGNDX(@14)                       0381 01116000
*           R15='10'X;              /* SET ERROR RETURN CODE @VA12420*/ 01117000
         LA    R15,16                                              0382 01118000
*           IF VOLMTD=ON|VOLMTDXC=ON THEN/* FLAG AS MTD      @VA12420*/ 01119000
         TM    VOLMTD(@14),B'11000000'                             0383 01120000
         BZ    @RF00383                                            0383 01121000
*             VOLMNTD=ON;           /* TURN ON MTD FLG IN MSSCOM IF     01122000
*                                      SO                    @VA12420*/ 01123000
         LA    @14,1                                               0384 01124000
         ST    @14,VOLMNTD                                         0384 01125000
*           ELSE                                                   0385 01126000
*             ;                     /*                       @VA12420*/ 01127000
@RF00383 DS    0H                                                  0386 01128000
*         END;                      /*                       @VA12420*/ 01129000
*     ELSE                                                         0387 01130000
*       R15='0'X;                   /* GET RSN CODE IF R15^=0      0387 01131000
*                                                            @VA11343*/ 01132000
         B     @RC00377                                            0387 01133000
@RF00377 SLR   R15,R15                                             0387 01134000
*   ELSE                                                           0388 01135000
*     R15='0'X;                                                    0388 01136000
         B     @RC00376                                            0388 01137000
@RF00376 SLR   R15,R15                                             0388 01138000
*   RSNCODE=R15;                    /* PRESERVE R15 ACROSS FREEMAIN     01139000
*                                                            @VA12420*/ 01140000
@RC00376 STCM  R15,15,RSNCODE                                      0389 01141000
*   R0=512;                         /* SIZE OF MVT BUFFER FOR      0390 01142000
*                                      FREEMAIN              @VA11343*/ 01143000
         LA    R0,512                                              0390 01144000
*   R1=MVTPTR;                      /* ADDRESS OF MVT BUFFER @VA11343*/ 01145000
         L     R1,MVTPTR                                           0391 01146000
*   GEN(FREEMAIN R,LV=(0),A=(1));   /*                       @VA11343*/ 01147000
         FREEMAIN R,LV=(0),A=(1)                                        01148000
*   R15=RSNCODE;                    /* RESTORE R15 AFTER FREEMAIN  0393 01149000
*                                                            @VA12420*/ 01150000
         ICM   R15,15,RSNCODE                                      0393 01151000
*   RETURN CODE(R15);               /*                       @VA12420*/ 01152000
         L     @14,@SA00005                                        0394 01153000
         LM    @00,@12,@SA00005+8                                  0394 01154000
         BR    @14                                                 0394 01155000
*   RFY                                                            0395 01156000
*    (R0,                                                          0395 01157000
*     R1,                                                          0395 01158000
*     R15) UNRSTD;                  /*                       @VA11343*/ 01159000
*   END QRYPROC;                    /*                       @VA12420*/ 01160000
*MNTPROC:                                                          0397 01161000
*   PROC;                           /*                       @VA12420*/ 01162000
MNTPROC  STM   @14,@12,12(@13)                                     0397 01163000
*/* **************************************************************** */ 01164000
*/* WHEN CP MOUNTS A VOLUME, NO UCB'S ARE GEN'D. THIS CAUSES THE MSC */ 01165000
*/* TO RESTRICT THE MOUNTED VOLUME SUCH THAT NO OS DATASETS MAY BE   */ 01166000
*/* ALLOCATED ON THAT VOLUME. IN ORDER TO GET AROUND THAT PROBLEM, A */ 01167000
*/* BIT IN THE MOUNT ORDER IS TURNED ON, INDICATING THAT THIS VOLUME */ 01168000
*/* IS A GENERAL-USE VOLUME (I.E. - MOUNTED BY THE CENTRAL SERVER).  */ 01169000
*/* **************************************************************** */ 01170000
*                                                                  0398 01171000
*   IF SHRDVUA=ON THEN                                             0398 01172000
         TM    SHRDVUA(COMMPTR),B'00000100'                        0398 01173000
         BNO   @RF00398                                            0398 01174000
*     DO;                           /* IS IT GEN-USE VOL?@VA11342    */ 01175000
*                                                                  0399 01176000
*       /*************************************************************/ 01177000
*       /*                                                           */ 01178000
*       /* ********************************************************  */ 01179000
*       /*                                                   @Y30LB02*/ 01180000
*       /* MACMEAN MSSC MOUNT/DEMOUNT MACRO                  @Y30LB02*/ 01181000
*       /* VS1-4/VS2-3 VERSION-- 01/19/76 LEVEL 00           @ZDR2048*/ 01182000
*       /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.          @Y30LB02*/ 01183000
*       /* THE LIST FORM OF THIS MACRO SHOULD BE             @Y30LB02*/ 01184000
*       /* INVOKED FIRST IN ORDER TO SET UP NECESSARY        @Y30LB02*/ 01185000
*       /* DECLARES. IF THE COMPLETE ARGUMENT IS             @Y30LB02*/ 01186000
*       /* SPECIFIED THE REQ BLOCK WILL BE ZEROED.           @Y30LB02*/ 01187000
*       /* ********************************************************  */ 01188000
*       /*                                                   @Y30LB02*/ 01189000
*       /*                                                           */ 01190000
*       /*************************************************************/ 01191000
*                                                                  0400 01192000
*       RFY                                                        0400 01193000
*         MDREG1 RSTD;              /* RESTRICT REG 1        @Y30LB02*/ 01194000
*       MDREG1=ADDR(MONBLK);        /* R1 PTR TO REQ BLOCK   @Y30LB02*/ 01195000
         LA    MDREG1,MONBLK                                       0401 01196000
*       MDLEN='1C'X;                /* LENGTH OF MOUNT REQ BLOCK   0402 01197000
*                                                            @Y30LB02*/ 01198000
         LA    @12,28                                              0402 01199000
         ST    @12,MDLEN                                           0402 01200000
*       MDOPCD='08'X;               /* MOUNT OPCODE          @Y30LB02*/ 01201000
         MVI   MDOPCD,X'08'                                        0403 01202000
*       MDFLG=(MTFLAG);             /* VALUE OF FLAGS        @Y30LB02*/ 01203000
         LH    @12,MTFLAG                                          0404 01204000
         N     @12,@CF02341                                        0404 01205000
         STH   @12,MDFLG                                           0404 01206000
*       MDVOL=(MSSSER);             /* VALUE OF VOLID        @Y30LB02*/ 01207000
         MVC   MDVOL(6),MSSSER(COMMPTR)                            0405 01208000
*       MDVUA=(MSSVUA);             /* VALUE OF VUA          @Y30LB02*/ 01209000
         LH    @12,MSSVUA(,COMMPTR)                                0406 01210000
         N     @12,@CF02341                                        0406 01211000
         STH   @12,MDVUA                                           0406 01212000
*       MDHOST=(CPUID);             /* FILLIN HOSTID         @Y30LB02*/ 01213000
         MVC   MDHOST(5),CPUID                                     0407 01214000
*       SVC(126);                   /* INVOKE THE SSC SVC    @Y30LB02*/ 01215000
         SVC   126                                                 0408 01216000
*       RFY                                                        0409 01217000
*         MDREG1 UNRSTD;            /* UNREST REG 1          @Y30LB02*/ 01218000
*                                                                  0409 01219000
*       /*************************************************************/ 01220000
*       /*                                                           */ 01221000
*       /*                                                   @VA11342*/ 01222000
*       /*                                                           */ 01223000
*       /*************************************************************/ 01224000
*                                                                  0410 01225000
*     END;                          /*                       @VA11342*/ 01226000
*   ELSE                                                           0411 01227000
*     DO;                           /*                       @VA11342*/ 01228000
*                                                                  0411 01229000
         B     @RC00398                                            0411 01230000
@RF00398 DS    0H                                                  0412 01231000
*       /*************************************************************/ 01232000
*       /*                                                           */ 01233000
*       /* ********************************************************  */ 01234000
*       /*                                                   @Y30LB02*/ 01235000
*       /* MACMEAN MSSC MOUNT/DEMOUNT MACRO                  @Y30LB02*/ 01236000
*       /* VS1-4/VS2-3 VERSION-- 01/19/76 LEVEL 00           @ZDR2048*/ 01237000
*       /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.          @Y30LB02*/ 01238000
*       /* THE LIST FORM OF THIS MACRO SHOULD BE             @Y30LB02*/ 01239000
*       /* INVOKED FIRST IN ORDER TO SET UP NECESSARY        @Y30LB02*/ 01240000
*       /* DECLARES. IF THE COMPLETE ARGUMENT IS             @Y30LB02*/ 01241000
*       /* SPECIFIED THE REQ BLOCK WILL BE ZEROED.           @Y30LB02*/ 01242000
*       /* ********************************************************  */ 01243000
*       /*                                                   @Y30LB02*/ 01244000
*       /*                                                           */ 01245000
*       /*************************************************************/ 01246000
*                                                                  0412 01247000
*       RFY                                                        0412 01248000
*         MDREG1 RSTD;              /* RESTRICT REG 1        @Y30LB02*/ 01249000
*       MDREG1=ADDR(MONBLK);        /* R1 PTR TO REQ BLOCK   @Y30LB02*/ 01250000
         LA    MDREG1,MONBLK                                       0413 01251000
*       MDLEN='1C'X;                /* LENGTH OF MOUNT REQ BLOCK   0414 01252000
*                                                            @Y30LB02*/ 01253000
         LA    @12,28                                              0414 01254000
         ST    @12,MDLEN                                           0414 01255000
*       MDOPCD='08'X;               /* MOUNT OPCODE          @Y30LB02*/ 01256000
         MVI   MDOPCD,X'08'                                        0415 01257000
*       MDVOL=(MSSSER);             /* VALUE OF VOLID        @Y30LB02*/ 01258000
         MVC   MDVOL(6),MSSSER(COMMPTR)                            0416 01259000
*       MDVUA=(MSSVUA);             /* VALUE OF VUA          @Y30LB02*/ 01260000
         LH    @12,MSSVUA(,COMMPTR)                                0417 01261000
         N     @12,@CF02341                                        0417 01262000
         STH   @12,MDVUA                                           0417 01263000
*       MDHOST=(CPUID);             /* FILLIN HOSTID         @Y30LB02*/ 01264000
         MVC   MDHOST(5),CPUID                                     0418 01265000
*       SVC(126);                   /* INVOKE THE SSC SVC    @Y30LB02*/ 01266000
         SVC   126                                                 0419 01267000
*       RFY                                                        0420 01268000
*         MDREG1 UNRSTD;            /* UNREST REG 1          @Y30LB02*/ 01269000
*     END;                          /*                       @VA11342*/ 01270000
*   RFY                                                            0422 01271000
*    (R0,                                                          0422 01272000
*     R15) RSTD;                    /*                       @VA12420*/ 01273000
@RC00398 DS    0H                                                  0423 01274000
*   IF R15^=0 THEN                                                 0423 01275000
         LTR   R15,R15                                             0423 01276000
         BZ    @RF00423                                            0423 01277000
*     DO;                           /*                       @VA12420*/ 01278000
*       RSNCODE=R0;                 /*                       @VA12420*/ 01279000
         STCM  R0,15,RSNCODE                                       0425 01280000
*       MSSRC=RSNCODE(3:4);         /*                       @VA12420*/ 01281000
         MVC   MSSRC(2,COMMPTR),RSNCODE+2                          0426 01282000
*     END;                          /*                       @VA12420*/ 01283000
*   ELSE                                                           0428 01284000
*     ;                             /*                       @VA12420*/ 01285000
@RF00423 DS    0H                                                  0429 01286000
*   RETURN CODE(R15);               /*                       @VA12420*/ 01287000
         L     @14,12(,@13)                                        0429 01288000
         LM    @00,@12,20(@13)                                     0429 01289000
         BR    @14                                                 0429 01290000
*   RFY                                                            0430 01291000
*    (R0,                                                          0430 01292000
*     R15) UNRSTD;                  /*                       @VA12420*/ 01293000
*   END MNTPROC;                    /*                       @VA12420*/ 01294000
*                                                                  0432 01295000
*/* **************************************************************** */ 01296000
*/*  SUB-PROC TO SET UP THE INITIAL SDG TABLE OF VUA'S GEN'D FOR CP  */ 01297000
*/* **************************************************************** */ 01298000
*                                                                  0432 01299000
*QRYMSC:                                                           0432 01300000
*   PROC;                           /*                       @VA11343*/ 01301000
QRYMSC   STM   @14,@12,@SA00007                                    0432 01302000
*/*  ******************************************************* @Z40LB22*/ 01303000
*/*  MSSC QMWCS/QLAB/QTAB/QSWCS/QCEL MACRO             @Z40LB22      */ 01304000
*/*  OS/VS2 VERSION--03/21/75 LEVEL 00                  @Z40LB22     */ 01305000
*/*  THIS IS THE UNINITIALIZED LIST FORM                     @Z40LB22*/ 01306000
*/*  GENERAL AREA TO BE OVERLAID BY SPECIFIC ORDERS        @Z40LB22  */ 01307000
*/*  ******************************************************* @Z40LB22*/ 01308000
*                                                                  0433 01309000
*   DCL                                                            0433 01310000
*     1 QUERLIST,                   /* REQUEST BLOCK         @Z40LB22*/ 01311000
*      2 QULEN FIXED(31),           /* LENGTH = 44 BYTES     @Z40LB22*/ 01312000
*      2 QUORD CHAR(1),             /* ORDER - COULD BE FOR QMWCS  0433 01313000
*                                      (0B), QLAB (05), QTAB (05), 0433 01314000
*                                      QSWCS (05), OR QCEL (07)    0433 01315000
*                                                            @Z40LB22*/ 01316000
*      2 QURES CHAR(1),             /* RESERVED BITS         @Z40LB22*/ 01317000
*      2 QUCODE BIT(8),             /* CODE - COULD BE FOR QMWCS   0433 01318000
*                                      (03), QLAB (08), QTAB (06), OR   01319000
*                                      QSWCS (10)            @Z40LB22*/ 01320000
*       3 QULIB BIT(8),             /* QCEL ONLY - ID OF THE MSF TO     01321000
*                                      BE AUDITED            @Z40LB22*/ 01322000
*      2 QUSECT BIT(8),             /* QMWCS AND QSWCS ONLY - THE  0433 01323000
*                                      SECTOR OF CODE TO BE READ   0433 01324000
*                                                            @Z40LB22*/ 01325000
*       3 QUXADDR BIT(8),           /* QCEL ONLY - THE START X ADDR     01326000
*                                      OF CELLS TO BE AUDITED      0433 01327000
*                                                            @Z40LB22*/ 01328000
*        4 QUFLAG BIT(8),           /* QLAB ONLY - SET TO HEX 10, THE   01329000
*                                      LZYX OF CART IS SUPPLIED    0433 01330000
*                                                            @Z40LB22*/ 01331000
*         5 QURES1 CHAR(1),         /* QTAB ONLY - RESERVED BITS   0433 01332000
*                                                            @Z40LB22*/ 01333000
*      2 QUPARM CHAR(32),           /* PARM AREA FOR ANY SPECIFIED 0433 01334000
*                                                            @Z40LB22*/ 01335000
*      2 QUPTR FIXED(31);           /* ADDR OF A 512 BYTE DATA AREA     01336000
*                                                            @Z40LB22*/ 01337000
*   DCL                                                            0434 01338000
*     1 QWPARM DEFINED(QUPARM),     /* MSC AND SA WCS READ   @Z40LB22*/ 01339000
*      2 QWRES1 CHAR(2),            /* MSC WCS ONLY - RESERVED BITS     01340000
*                                                            @Z40LB22*/ 01341000
*       3 QWSSID CHAR(2),           /* SA WCS ONLY - SUBSYSTEM ID OF    01342000
*                                      THE SA                @Z40LB22*/ 01343000
*      2 QWFLAG BIT(8),             /* READ INDICATOR        @Z40LB22*/ 01344000
*       3 QWMEM BIT(1),             /* BIT 0=0 READ FROM MAIN STORAGE   01345000
*                                      BIT 0=1 READ FROM EXTENDED  0434 01346000
*                                      STORAGE               @Z40LB22*/ 01347000
*       3 * BIT(6),                 /* UNUSED                @ZA27590*/ 01348000
*       3 QWALTMSC BIT(1),          /* BIT 7=0 DUMP PRIMARY MSC BIT     01349000
*                                      7=1 DUMP ALTERNATE MSC      0434 01350000
*                                                            @ZA27590*/ 01351000
*      2 QWRES2 CHAR(29);           /* RESERVED BITS         @Z40LB22*/ 01352000
*   DCL                                                            0435 01353000
*     1 QTPARM DEFINED(QUPARM),     /* QTAB REQUEST BLOCK    @Z40LB22*/ 01354000
*      2 QTID BIT(8),               /*                       @Z40LB22*/ 01355000
*       3 QTTABID BIT(4),           /* TABLE ID              @Z40LB22*/ 01356000
*      2 QTFLAG BIT(8),             /* READ CHR BIT 3=1 BLOCK CHR  0435 01357000
*                                      SUPPLIED BIT 7=1 READ REQUEST    01358000
*                                                            @Z40LB22*/ 01359000
*      2 QTDATA CHAR(18),           /* TABLE DEPENDENT DATA  @Z40LB22*/ 01360000
*      2 QTDASCHR BIT(32),          /* THE CHR OF RECORD TO BE READ     01361000
*                                      ORDER                 @Z40LB22*/ 01362000
*      2 QTRES CHAR(8);             /* RESERVED              @Z40LB22*/ 01363000
*   DCL                                                            0436 01364000
*     1 QLPARM DEFINED(QUPARM),     /* QLAB REQUEST BLOCK    @Z40LB22*/ 01365000
*      2 QLZYX FIXED(15),           /* THE MSF AND CELL ADDR OF CART.   01366000
*                                      TO BE READ            @Z40LB22*/ 01367000
*      2 QLRES CHAR(30);            /* RESERVED              @Z40LB22*/ 01368000
*   DCL                                                            0437 01369000
*     1 QCPARM DEFINED(QUPARM),     /* QCEL 8 WORD BIT MAP   @Z40LB22*/ 01370000
*      2 QCMAD0Z0 BIT(32),          /* WORD 1 OF CELL ADDR TO BE   0437 01371000
*                                      TESTED                @Z40LB22*/ 01372000
*      2 QCMAD0Z1 BIT(32),          /* WORD 2 OF CELL ADDR TO BE   0437 01373000
*                                      TESTED                @Z40LB22*/ 01374000
*      2 QCMAD1Z0 BIT(32),          /* WORD 3 OF CELL ADDR TO BE   0437 01375000
*                                      TESTED                @Z40LB22*/ 01376000
*      2 QCMAD1Z1 BIT(32),          /* WORD 4 OF CELL ADDR TO BE   0437 01377000
*                                      TESTED                @Z40LB22*/ 01378000
*      2 QCMAD2Z0 BIT(32),          /* WORD 5 OF CELL ADDR TO BE   0437 01379000
*                                      TESTED                @Z40LB22*/ 01380000
*      2 QCMAD2Z1 BIT(32),          /* WORD 6 OF CELL ADDR TO BE   0437 01381000
*                                      TESTED                @Z40LB22*/ 01382000
*      2 QCMAD3Z0 BIT(32),          /* WORD 7 OF CELL ADDR TO BE   0437 01383000
*                                      TESTED                @Z40LB22*/ 01384000
*      2 QCMAD3Z1 BIT(32);          /* WORD 8 OF CELL ADDR TO BE   0437 01385000
*                                      TESTED                @Z40LB22   01386000
*                                      LIST FORM OF ICBQUERY MACRO 0437 01387000
*                                                            @VA11343*/ 01388000
*/* **************************************************************** */ 01389000
*/*  CYLINDER, HEAD, AND RECORD LOCATION STRUCTURE FOR MSC QUERY     */ 01390000
*/* **************************************************************** */ 01391000
*                                                                  0438 01392000
*   DCL                                                            0438 01393000
*     1 CHRMAP CHAR(4),             /*                       @VA11343*/ 01394000
*      2 CYL CHAR(2),               /* CYLINDER              @VA11343*/ 01395000
*      2 HD CHAR(1),                /* HEAD                  @VA11343*/ 01396000
*      2 REC CHAR(1);               /* RECORD                @VA11343*/ 01397000
*/* **************************************************************** */ 01398000
*/* STRUCTURE OF RESPONSE FROM QUERY OF MSC CONFIGURATION TABLE      */ 01399000
*/*   NOTE: THE FIELD 'BYTE1' IS USED IN TWO WAYS. EACH OF THE 16    */ 01400000
*/*   MAIN ENTRIES IN THE CONFIGURATION INDEX TABLE CONSISTS OF 4    */ 01401000
*/*   PARTS, THE FIRST OF WHICH IS SIMPLY AN INDICATION WHETHER THE  */ 01402000
*/*   INFORMATION IN THE OTHER 3 PARTS IS ABOUT VUA'S OR NOT. IF THE */ 01403000
*/*   HIGH-ORDER BIT OF THIS FIRST BYTE IS ON, THEN THEY ARE VUA'S.  */ 01404000
*/*   FOR THE OTHER 3 PARTS OF EACH MAIN ENTRY, THE FIELD 'BYTE1'    */ 01405000
*/*   CONTAINS THE CPUID INDEX VALUE ASSOCIATED WITH THIS CPUID.     */ 01406000
*/*   BECAUSE THE CONFIGURATION INDEX TABLE APPEARS TO BE A 16X4     */ 01407000
*/*   ARRAY, THE FOLLOWING STRUCTURE SEEMS TO MOST EFFICIENTLY       */ 01408000
*/*   DESCRIBE IT, IF THE ABOVE NOTE IS KEPT IN MIND.                */ 01409000
*/* **************************************************************** */ 01410000
*                                                                  0439 01411000
*   DCL                                                            0439 01412000
*     1 CONFIGTB BASED(FIRSTPTR),   /*                       @VA11343*/ 01413000
*      2 * CHAR(256),               /* TOP HALF OF QUERY BUFFER    0439 01414000
*                                                            @VA11343*/ 01415000
*      2 CONFIGA(16,4),             /* .. CONFIGURATION INDEX TABLE     01416000
*                                      ..                    @VA11343*/ 01417000
*       3 BYTE1 BIT(8),             /* EITHER INDEX OR             0439 01418000
*                                      CARTRIDGE-STORE       @VA11343*/ 01419000
*        4 BIT1 BIT(1),             /* ON - THIS IS A CARTRIDGE STORE   01420000
*                                                            @VA11343*/ 01421000
*        4 * BIT(7),                /* BITS USED IN INDEX VALUE    0439 01422000
*                                                            @VA11343*/ 01423000
*       3 BYTE2 BIT(8),             /* CHANNEL, CONTROL UNIT @VA11343*/ 01424000
*        4 CTLUNIT BIT(2),          /* CU BITS OF CUU        @VA11343*/ 01425000
*        4 * BIT(2),                /* ... UNREFERENCED ...  @VA11343*/ 01426000
*        4 CHANNEL BIT(4),          /* CH BITS OF CUU (CUD)  @VA11343*/ 01427000
*      2 MFGID(16),                 /* ... MANUFACTURER'S ID TABLE 0439 01428000
*                                      ...                   @VA11343*/ 01429000
*       3 MFGCPUID CHAR(5),         /* CPUID                 @VA11343*/ 01430000
*       3 * CHAR(3);                /* ... UNREFERENCED ...  @VA11343*/ 01431000
*/* **************************************************************** */ 01432000
*/*  STRUCTURE OF CONFIGURATION DATA BLOCK BUFFER OF QUERY RESPONSE  */ 01433000
*/* **************************************************************** */ 01434000
*                                                                  0440 01435000
*   DCL                                                            0440 01436000
*     1 CONFIGDB BASED(SECNDPTR),   /*                       @VA11343*/ 01437000
*      2 * CHAR(256),               /* FIRST HALF OF QUERY BUFFER  0440 01438000
*                                                            @VA11343*/ 01439000
*      2 CONFIGB(64),               /* CONFIGURATION DATA BLOCK ENTRY   01440000
*                                                            @VA11343*/ 01441000
*       3 STATUS BIT(8),            /* SHARED STATUS AND SDG NUMBER     01442000
*                                                            @VA11343*/ 01443000
*        4 CONFSHR BIT(1),          /* CAN'T BE SHARED W/OTHER CPU'S    01444000
*                                      IF ON@VA11343                 */ 01445000
*        4 * BIT(2),                /* ..... UNREFERENCED .....    0440 01446000
*                                                            @VA11343*/ 01447000
*        4 CONFSDG BIT(5),          /* SDG NUMBER            @VA11343*/ 01448000
*       3 * CHAR(3);                /* ..... UNREFERENCED .....    0440 01449000
*                                                            @VA11343*/ 01450000
*/* **************************************************************** */ 01451000
*/* STRUCTURE OF TABLE OF VUA'S IN CP'S CONFIGURATION TO PASS TO CP  */ 01452000
*/* **************************************************************** */ 01453000
*                                                                  0441 01454000
*   DCL                                                            0441 01455000
*     1 MSSTBL BASED(MSSPTR),       /*                       @VA11343*/ 01456000
*      2 CNTVUA FIXED(31),          /* COUNT OF VUA'S FOUND  @VA11343*/ 01457000
*      2 VUATBL(1792),              /* VUA LIST (1792 POSSIBLE)    0441 01458000
*                                                            @VA11343*/ 01459000
*       3 VUA1 BIT(8),              /* .... CHANNEL ....     @VA11343*/ 01460000
*        4 ZEROS BIT(4),            /* FILLER, SHOULD BE X'0'      0441 01461000
*                                                            @VA11343*/ 01462000
*        4 CH BIT(4),               /* BITS REPRESENTING CHANNEL   0441 01463000
*                                                            @VA11343*/ 01464000
*       3 VUA2 BIT(8),              /* .... CONTROL UNIT, DEVICE   0441 01465000
*                                                            @VA11343*/ 01466000
*        4 CU BIT(2),               /* BITS REPRESENTING CTL UNIT  0441 01467000
*                                                            @VA11343*/ 01468000
*        4 DV BIT(6),               /* BITS REPRESENTING DEVICE    0441 01469000
*                                                            @VA11343*/ 01470000
*       3 STAT BIT(8),              /* .... STATUS FLAGS ....      0441 01471000
*                                                            @VA11343*/ 01472000
*        4 SHRD BIT(1),             /* WHEN ON, VUA MAY BE SHARED  0441 01473000
*                                                            @VA11343*/ 01474000
*        4 * BIT(7),                /* ..... RESERVED .....  @VA11343*/ 01475000
*       3 NUMSDG BIT(8),            /* .... SDG FIELD ....   @VA11343*/ 01476000
*        4 * BIT(3),                /* LEADING BITS OF SDG MUST BE 0441 01477000
*                                      ZEROS                 @VA11343*/ 01478000
*        4 SDGNUM BIT(5);           /* SDG NUMBER THIS VUA IS IN   0441 01479000
*                                                            @VA11343*/ 01480000
*                                                                  0442 01481000
*/* **************************************************************** */ 01482000
*/*   OTHER DECLARES FOR THIS SUB-PROC                               */ 01483000
*/* **************************************************************** */ 01484000
*                                                                  0442 01485000
*   DCL                                                            0442 01486000
*     FIRSTPTR PTR(31),             /* PTR TO 1ST QUERY BUFFER     0442 01487000
*                                                            @VA11343*/ 01488000
*     SECNDPTR PTR(31),             /* PTR TO 2ND QUERY BUFFER     0442 01489000
*                                                            @VA11343*/ 01490000
*     MSSPTR PTR(31);               /* PTR TO TABLE OF VUA'S @VA11343*/ 01491000
*   DCL                                                            0443 01492000
*     RELINDEX FIXED(15);           /* REL INDX INTO MFG CPUID TABLE    01493000
*                                                            @VA11343*/ 01494000
*   DCL                                                            0444 01495000
*     LNDEX FIXED(8),               /* LOOP CONTROL - 1 TO 16      0444 01496000
*                                                            @VA11343*/ 01497000
*     JNDEX FIXED(8),               /* INDEX TO THIS SA PORT (B,C,D)    01498000
*                                                            @VA11343*/ 01499000
*     KNDEX FIXED BIN(8),           /* LOOP CONTROL - 64 VUA'S/SDG 0444 01500000
*                                                            @VA11343*/ 01501000
*     TEMP1 BIT(8);                 /* TEMP STORE FOR BIT          0444 01502000
*                                      MANIPULATION          @VA11343*/ 01503000
*   DCL                                                            0445 01504000
*     TEMP2 FIXED(31);                                             0445 01505000
*                                                                  0445 01506000
*/* **************************************************************** */ 01507000
*/*   END OF DECLARES FOR THIS SUB-PROC                              */ 01508000
*/* **************************************************************** */ 01509000
*                                                                  0446 01510000
*                                                                  0446 01511000
*/* **************************************************************** */ 01512000
*/* GET A BUFFER FOR CONFIGURATION TABLE, A BUFFER FOR CONFIGURATION */ 01513000
*/*  INDEX TABLE, AND A LARGE BUFFER TO PASS VUA'S TO CP IN          */ 01514000
*/* **************************************************************** */ 01515000
*                                                                  0446 01516000
*   RFY                                                            0446 01517000
*    (R0,                                                          0446 01518000
*     R1,                                                          0446 01519000
*     R2) RSTD;                     /*                       @VA11343*/ 01520000
*   R0=512;                         /* SIZE OF CONFIG TABLES @VA11343*/ 01521000
         LA    R0,512                                              0447 01522000
*   GEN(GETMAIN R,LV=(0));          /* GET BUFFER FOR CONFIG INDX  0448 01523000
*                                                            @VA11343*/ 01524000
         GETMAIN R,LV=(0)                                               01525000
*   FIRSTPTR=R1;                    /* SAVE ADDR OF CONFIG         0449 01526000
*                                      INDX/MANUF. ID TABLE  @VA11343*/ 01527000
         ST    R1,FIRSTPTR                                         0449 01528000
*   R0=512;                         /* SIZE OF CONFIG DATA BLOCK   0450 01529000
*                                      RESPONSE              @VA11343*/ 01530000
         LA    R0,512                                              0450 01531000
*   GEN(GETMAIN R,LV=(0));          /* GET BUFFER FOR CONFIG D.B.  0451 01532000
*                                                            @VA11343*/ 01533000
         GETMAIN R,LV=(0)                                               01534000
*   SECNDPTR=R1;                    /* SAVE ADDR OF CONFIG DATA BLOCK   01535000
*                                      RESPONSE              @VA11343*/ 01536000
         ST    R1,SECNDPTR                                         0452 01537000
*   R2=7172;                        /* SIZE OF VUA TABLE TO BE SENT     01538000
*                                      TO CP                 @VA11343*/ 01539000
         L     R2,@CF02324                                         0453 01540000
*   GEN(GETMAIN R,LV=(2),SP=253);   /* GET BUFFER FOR VUA TABLE    0454 01541000
*                                                            @VA11343*/ 01542000
         GETMAIN R,LV=(2),SP=253                                        01543000
*   MSSPTR=R1;                      /* SAVE ADDR OF VUA BUFFER     0455 01544000
*                                                            @VA11343*/ 01545000
         ST    R1,MSSPTR                                           0455 01546000
*   CNTVUA=ZEROFULL;                /* CLEAR COUNT FIELD IN BUFF   0456 01547000
*                                                            @VA11343*/ 01548000
         L     @12,MSSPTR                                          0456 01549000
         SLR   @15,@15                                             0456 01550000
         ST    @15,CNTVUA(,@12)                                    0456 01551000
*   RFY                                                            0457 01552000
*    (R0,                                                          0457 01553000
*     R1,                                                          0457 01554000
*     R2) UNRSTD;                   /* UNRESTRICT R0,R1,R2   @VA11343*/ 01555000
*/* **************************************************************** */ 01556000
*/*  END OF BUFFER-GRABBING ROUTINE                                  */ 01557000
*/* **************************************************************** */ 01558000
*                                                                  0458 01559000
*   QRYID='70'X;                    /* SET UP TABLE ID       @VA11343*/ 01560000
         MVI   QRYID,X'70'                                         0458 01561000
*   QRYRD='11'X;                    /* SET UP READ OF MSC TABLES   0459 01562000
*                                                            @VA11343*/ 01563000
         MVI   QRYRD,X'11'                                         0459 01564000
*   CYL='001A'X;                    /* SET UP CYLINDER ID    @VA11343*/ 01565000
         MVC   CYL(2),@CB02327                                     0460 01566000
*   HD='0A'X;                       /* SET UP HEAD ID        @VA11343*/ 01567000
         MVI   HD,X'0A'                                            0461 01568000
*   REC='01'X;                      /* SET UP READ OF RECORD 1     0462 01569000
*                                                            @VA11343*/ 01570000
         MVI   REC,X'01'                                           0462 01571000
*/* **************************************************************** */ 01572000
*/* QUERY MSC TO GET CONFIGURATION TABLE, MANUFACTURER'S ID TABLE    */ 01573000
*/* **************************************************************** */ 01574000
*/*  ******************************************************* @Z40LB22*/ 01575000
*/*  MSSC ICBQUERY QSWCS/QLAB/QTAB/QSWCS QCEL  MACRO         @Z40LB22*/ 01576000
*/*  OS/VS2 VERSION-- 03/21/75 LEVEL 00                      @Z40LB22*/ 01577000
*/*  THIS IS THE OUTPUT FOR THE EXECUTE FORM.                @Z40LB22*/ 01578000
*/*  THE LIST FORM OF THIS MACRO SHOULD BE                   @Z40LB22*/ 01579000
*/*  INVOKED FIRST IN ORDER TO SET UP NECESSARY              @Z40LB22*/ 01580000
*/*  DECLARES.  IF THE COMPLETE ARGUMENT IS                  @Z40LB22*/ 01581000
*/*  SPECIFIED THE REQ BLOCK WILL BE ZEROED.                 @Z40LB22*/ 01582000
*/*  ******************************************************* @Z40LB22*/ 01583000
*                                                                  0463 01584000
*   RFY                                                            0463 01585000
*    (QUERR1) RSTD;                 /* RESTRICT R1           @Z40LB22*/ 01586000
*   QUERR1=ADDR(QUERLIST);          /* SET QUERR1 TO REQ BLOCK     0464 01587000
*                                                            @Z40LB22*/ 01588000
         LA    QUERR1,QUERLIST                                     0464 01589000
*   QUERLIST=QUERLIST&&QUERLIST;    /* ZERO REQUEST BLOCK    @Z40LB22*/ 01590000
         XC    QUERLIST(44),QUERLIST                               0465 01591000
*   QULEN='2C'X;                    /* SET LENGTH FIELD      @Z40LB22*/ 01592000
         LA    @12,44                                              0466 01593000
         ST    @12,QULEN                                           0466 01594000
*   QUORD='05'X;                    /* SET OPCODE FIELD      @Z40LB22*/ 01595000
         MVI   QUORD,X'05'                                         0467 01596000
*   QUCODE='06'X;                   /* SET CODE TYPE         @Z40LB22*/ 01597000
         MVI   QUCODE,X'06'                                        0468 01598000
*   QUPARM=(QRYPARM);               /* FILL IN PARAMETERS    @Z40LB22*/ 01599000
         MVI   QUPARM+20,C' '                                      0469 01600000
         MVC   QUPARM+21(11),QUPARM+20                             0469 01601000
         MVC   QUPARM(20),QRYPARM                                  0469 01602000
*   QTDASCHR=(CHRMAP);              /* FILL IN CHR           @Z40LB22*/ 01603000
         MVC   QTDASCHR(4),CHRMAP                                  0470 01604000
*   QUPTR=ADDR(CONFIGTB);           /* ADDR OF DATAPTR FIELD @Z40LB22*/ 01605000
         L     @12,FIRSTPTR                                        0471 01606000
         ST    @12,QUPTR                                           0471 01607000
*   SVC(126);                       /* ISSUE SVC INST.       @Z40LB22*/ 01608000
         SVC   126                                                 0472 01609000
*   RFY                                                            0473 01610000
*    (QUERR1) UNRSTD;               /* UNRESTRICT R1         @Z40LB22*/ 01611000
*/*      @VA11343                                                    */ 01612000
*                                                                  0474 01613000
*   RFY                                                            0474 01614000
*     R15 RSTD;                     /*                       @VA11343*/ 01615000
*/* **************************************************************** */ 01616000
*/* IF THE QUERY OF THE CONFIGURATION TABLE DID NOT GO OKAY, SET A   */ 01617000
*/* RETURN CODE OF 4 IN R15 AND RETURN; THE CENTRAL SERVER WILL BE   */ 01618000
*/* TERMINATED.                                                      */ 01619000
*/* **************************************************************** */ 01620000
*                                                                  0475 01621000
*   IF R15^=0 THEN                                                 0475 01622000
         LTR   R15,R15                                             0475 01623000
         BZ    @RF00475                                            0475 01624000
*     R15=4;                        /*                       @VA11343*/ 01625000
         LA    R15,4                                               0476 01626000
*   ELSE                                                           0477 01627000
*     DO;                           /*                       @VA11343*/ 01628000
         B     @RC00475                                            0477 01629000
@RF00475 DS    0H                                                  0478 01630000
*/* **************************************************************** */ 01631000
*/* IF QUERY OF CONFIGURATION TABLE WENT OKAY, LOOK IN THE           */ 01632000
*/* MANUFACTURER'S ID TABLE FOR A MATCH TO THIS CPUID. IF NOT FOUND, */ 01633000
*/* SET R15 = 8 AND RETURN (CENTRAL SERVER WILL BE TERMINATED). IF   */ 01634000
*/* A MATCH IS FOUND, COMPUTE THE RELATIVE CPUID INDEX INTO THE      */ 01635000
*/* CONFIGURATION INDEX TABLE BY SUBTRACTING 1 FROM THE INDEX INTO   */ 01636000
*/* MANUFACTURER'S ID TABLE (CPUID INDICES START AT 0 WHILE MFG ID   */ 01637000
*/* INDICES START AT 1).                                             */ 01638000
*/* **************************************************************** */ 01639000
*                                                                  0478 01640000
*       RFY                                                        0478 01641000
*         R15 UNRSTD;               /*                       @VA11343*/ 01642000
*       DO LNDEX=1 TO 16 WHILE(CPUID^=MFGCPUID(LNDEX));/*    @VA11343*/ 01643000
         LA    @12,1                                               0479 01644000
         STC   @12,LNDEX                                           0479 01645000
@DL00479 LR    @01,@12                                             0479 01646000
         SLA   @01,3                                               0479 01647000
         L     @15,FIRSTPTR                                        0479 01648000
         ALR   @15,@01                                             0479 01649000
         CLC   CPUID(5),MFGCPUID-8(@15)                            0479 01650000
         BE    @DC00479                                            0479 01651000
*       END;                        /*                       @VA11343*/ 01652000
         AL    @12,@CF00074                                        0480 01653000
         STC   @12,LNDEX                                           0480 01654000
         C     @12,@CF00060                                        0480 01655000
         BNH   @DL00479                                            0480 01656000
@DC00479 DS    0H                                                  0481 01657000
*       RFY                                                        0481 01658000
*         R15 RSTD;                 /*                       @VA11343*/ 01659000
*/* **************************************************************** */ 01660000
*/* AT THIS POINT WE HAVE LOOKED AT ALL THE CPUID'S IN THE MANUFAC-  */ 01661000
*/* TURER'S ID TABLE. IF THE LAST ONE DOESN'T MATCH, THEN NONE DO.   */ 01662000
*/* **************************************************************** */ 01663000
*                                                                  0482 01664000
*       IF CPUID^=MFGCPUID(LNDEX) THEN                             0482 01665000
         SLR   @14,@14                                             0482 01666000
         IC    @14,LNDEX                                           0482 01667000
         SLA   @14,3                                               0482 01668000
         L     @12,FIRSTPTR                                        0482 01669000
         ALR   @12,@14                                             0482 01670000
         CLC   CPUID(5),MFGCPUID-8(@12)                            0482 01671000
         BE    @RF00482                                            0482 01672000
*         R15=8;                    /*                       @VA11343*/ 01673000
         LA    R15,8                                               0483 01674000
*       ELSE                                                       0484 01675000
*         DO;                       /*                       @VA11343*/ 01676000
         B     @RC00482                                            0484 01677000
@RF00482 DS    0H                                                  0485 01678000
*           RFY                                                    0485 01679000
*             R15 UNRSTD;           /*                       @VA11343*/ 01680000
*           RELINDEX=LNDEX-1;       /* RELATIVE INDEX TO CPUID     0486 01681000
*                                                            @VA11343*/ 01682000
         SLR   @12,@12                                             0486 01683000
         IC    @12,LNDEX                                           0486 01684000
         BCTR  @12,0                                               0486 01685000
         STH   @12,RELINDEX                                        0486 01686000
*/* **************************************************************** */ 01687000
*/* NOW THAT WE HAVE SET THE RELATIVE CPUID INDEX, WE NEED TO LOOK   */ 01688000
*/* AT EACH OF THE 16 ENTRIES IN THE CONFIGURATION INDEX TABLE. IF   */ 01689000
*/* THE FIRST BIT OF EACH ENTRY IS ON, THEN THAT ENTRY REPRESENTS A  */ 01690000
*/* CARTRIDGE STORE AND WE WANT TO IGNORE IT. IF THE FIRST BIT IS    */ 01691000
*/* OFF, THAT ENTRY REPRESENTS UP TO 3 SETS OF UP TO 64 VUA'S EACH.  */ 01692000
*/* **************************************************************** */ 01693000
*                                                                  0487 01694000
*           DO LNDEX=1 TO 16;       /* NOW READ CONFIG TABLE @VA11343*/ 01695000
         LA    @12,1                                               0487 01696000
         STC   @12,LNDEX                                           0487 01697000
@DL00487 DS    0H                                                  0488 01698000
*             IF BIT1(LNDEX,1)=ON THEN                             0488 01699000
         SLA   @12,3                                               0488 01700000
         L     @01,FIRSTPTR                                        0488 01701000
         ALR   @01,@12                                             0488 01702000
         TM    BIT1-8(@01),B'10000000'                             0488 01703000
         BO    @RT00488                                            0488 01704000
*               ;                   /* IF ON - IGNORE THE          0489 01705000
*                                      ENTRY@VA11343                 */ 01706000
*/* **************************************************************** */ 01707000
*/* IF THE ENTRY IS OF VUA'S, WE WANT TO CHECK THE 1ST BYTE OF EACH  */ 01708000
*/* OF THE REMAINING 3 TWO-BYTE PARTS OF THAT ENTRY FOR A MATCH WITH */ 01709000
*/* THE RELATIVE CPUID INDEX WE HAVE COMPUTED ABOVE. IF IT DOESN'T   */ 01710000
*/* MATCH, WE IGNORE IT. IF IT MATCHES, WE NEED TO COMPUTE THE PARMS */ 01711000
*/* AND RECORD NUMBER OF THE CORRECT CONFIGURATION DATA BLOCK TO BE  */ 01712000
*/* READ, AND ISSUE THE READ REQUEST.                                */ 01713000
*/* **************************************************************** */ 01714000
*                                                                  0490 01715000
*             ELSE                                                 0490 01716000
*               DO JNDEX=2 TO 4 BY 1;/* ELSE CHECK EACH PORT @VA11343*/ 01717000
         LA    @12,2                                               0490 01718000
         STC   @12,JNDEX                                           0490 01719000
@DL00490 DS    0H                                                  0491 01720000
*/* **************************************************************** */ 01721000
*/* IGNORE IF NOT THE PROPER CPUID                                   */ 01722000
*/* **************************************************************** */ 01723000
*                                                                  0491 01724000
*                 IF BYTE1(LNDEX,JNDEX)^=RELINDEX THEN             0491 01725000
         SLR   @01,@01                                             0491 01726000
         IC    @01,LNDEX                                           0491 01727000
         SLA   @01,2                                               0491 01728000
         ALR   @01,@12                                             0491 01729000
         ALR   @01,@01                                             0491 01730000
         L     @12,FIRSTPTR                                        0491 01731000
         SLR   @15,@15                                             0491 01732000
         IC    @15,BYTE1-10(@01,@12)                               0491 01733000
         CH    @15,RELINDEX                                        0491 01734000
         BNE   @RT00491                                            0491 01735000
*                   ;               /*                       @VA11343*/ 01736000
*                 ELSE                                             0493 01737000
*                   DO;             /*                       @VA11343*/ 01738000
*                     REC=((LNDEX-1)*4)+JNDEX;/* REC NUM OF C. D.  0494 01739000
*                                      BLOK                  @VA11343*/ 01740000
         SLR   @12,@12                                             0494 01741000
         IC    @12,LNDEX                                           0494 01742000
         BCTR  @12,0                                               0494 01743000
         SLA   @12,2                                               0494 01744000
         SLR   @01,@01                                             0494 01745000
         IC    @01,JNDEX                                           0494 01746000
         ALR   @12,@01                                             0494 01747000
         STC   @12,REC                                             0494 01748000
*                     IF REC<=32 THEN                              0495 01749000
         CLI   REC,32                                              0495 01750000
         BNH   @RT00495                                            0495 01751000
*                       ;           /* WE NEED TO MOVE TO NEXT HEAD?    01752000
*                                                            @VA11343*/ 01753000
*                     ELSE                                         0497 01754000
*                       DO;         /* YES!!!!               @VA11343*/ 01755000
*                         HD='0B'X; /* SET NEXT HEAD ID      @VA11343*/ 01756000
         MVI   HD,X'0B'                                            0498 01757000
*                         REC=REC-32;/* COMPUTE REC NUM FOR NEW HEAD    01758000
*                                                            @VA11343*/ 01759000
         SLR   @12,@12                                             0499 01760000
         IC    @12,REC                                             0499 01761000
         SL    @12,@CF01704                                        0499 01762000
         STC   @12,REC                                             0499 01763000
*                       END;        /*                       @VA11343*/ 01764000
*                                                                  0500 01765000
*                     /***********************************************/ 01766000
*                     /*                                             */ 01767000
*                     /* *********************************************/ 01768000
*                     /* ***********                         @Z40LB22*/ 01769000
*                     /* MSSC ICBQUERY QSWCS/QLAB/QTAB/QSWCS QCEL    */ 01770000
*                     /* MACRO                               @Z40LB22*/ 01771000
*                     /* OS/VS2 VERSION-- 03/21/75 LEVEL 00  @Z40LB22*/ 01772000
*                     /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.    */ 01773000
*                     /*                                     @Z40LB22*/ 01774000
*                     /* THE LIST FORM OF THIS MACRO SHOULD BE       */ 01775000
*                     /*                                     @Z40LB22*/ 01776000
*                     /* INVOKED FIRST IN ORDER TO SET UP NECESSARY  */ 01777000
*                     /*                                     @Z40LB22*/ 01778000
*                     /* DECLARES. IF THE COMPLETE ARGUMENT IS       */ 01779000
*                     /*                                     @Z40LB22*/ 01780000
*                     /* SPECIFIED THE REQ BLOCK WILL BE ZEROED.     */ 01781000
*                     /*                                     @Z40LB22*/ 01782000
*                     /* *********************************************/ 01783000
*                     /* ***********                         @Z40LB22*/ 01784000
*                     /*                                             */ 01785000
*                     /***********************************************/ 01786000
*                                                                  0501 01787000
*                     RFY                                          0501 01788000
*                      (QUERR1) RSTD;/* RESTRICT R1          @Z40LB22*/ 01789000
@RT00495 DS    0H                                                  0502 01790000
*                     QUERR1=ADDR(QUERLIST);/* SET QUERR1 TO REQ   0502 01791000
*                                      BLOCK                 @Z40LB22*/ 01792000
         LA    QUERR1,QUERLIST                                     0502 01793000
*                     QUERLIST=QUERLIST&&QUERLIST;/* ZERO REQUEST  0503 01794000
*                                      BLOCK                 @Z40LB22*/ 01795000
         XC    QUERLIST(44),QUERLIST                               0503 01796000
*                     QULEN='2C'X;  /* SET LENGTH FIELD      @Z40LB22*/ 01797000
         LA    @12,44                                              0504 01798000
         ST    @12,QULEN                                           0504 01799000
*                     QUORD='05'X;  /* SET OPCODE FIELD      @Z40LB22*/ 01800000
         MVI   QUORD,X'05'                                         0505 01801000
*                     QUCODE='06'X; /* SET CODE TYPE         @Z40LB22*/ 01802000
         MVI   QUCODE,X'06'                                        0506 01803000
*                     QUPARM=(QRYPARM);/* FILL IN PARAMETERS @Z40LB22*/ 01804000
         MVI   QUPARM+20,C' '                                      0507 01805000
         MVC   QUPARM+21(11),QUPARM+20                             0507 01806000
         MVC   QUPARM(20),QRYPARM                                  0507 01807000
*                     QTDASCHR=(CHRMAP);/* FILL IN CHR       @Z40LB22*/ 01808000
         MVC   QTDASCHR(4),CHRMAP                                  0508 01809000
*                     QUPTR=ADDR(CONFIGDB);/* ADDR OF DATAPTR FIELD     01810000
*                                                            @Z40LB22*/ 01811000
         L     @12,SECNDPTR                                        0509 01812000
         ST    @12,QUPTR                                           0509 01813000
*                     SVC(126);     /* ISSUE SVC INST.       @Z40LB22*/ 01814000
         SVC   126                                                 0510 01815000
*                     RFY                                          0511 01816000
*                      (QUERR1) UNRSTD;/* UNRESTRICT R1      @Z40LB22*/ 01817000
*                                                                  0511 01818000
*                     /***********************************************/ 01819000
*                     /*                                             */ 01820000
*                     /*                                     @VA11343*/ 01821000
*                     /*                                             */ 01822000
*                     /***********************************************/ 01823000
*                                                                  0512 01824000
*                     RFY                                          0512 01825000
*                      (R0,                                        0512 01826000
*                       R1,                                        0512 01827000
*                       R15) RSTD;  /*                       @VA11343*/ 01828000
*/* **************************************************************** */ 01829000
*/* IF R15^=0 THEN ERROR ON QUERY. SET A RETURN CODE OF 4 AND RETURN */ 01830000
*/* TO CALLER, WHERE THE CENTRAL SERVER WILL BE TERMINATED.          */ 01831000
*/* **************************************************************** */ 01832000
*                                                                  0513 01833000
*                     IF R15^=0 THEN                               0513 01834000
         LTR   R15,R15                                             0513 01835000
         BZ    @RF00513                                            0513 01836000
*                       DO;         /*                       @VA11343*/ 01837000
*                         R15=4;    /*                       @VA11343*/ 01838000
         LA    R15,4                                               0515 01839000
*                         GO TO ENDALL;/*                    @VA11343*/ 01840000
         B     ENDALL                                              0516 01841000
*                       END;        /*                       @VA11343*/ 01842000
*/* **************************************************************** */ 01843000
*/* IF QUERY WAS GOOD CHECK EACH OF THE 64 ENTRIES IN THE RESPONSE   */ 01844000
*/* BUFFER. IF THE STATUS OF ANY ENTRY IS SET TO X'FF' THEN IGNORE   */ 01845000
*/* ENTRY. OTHERWISE, IT'S A GOOD ENTRY SO GET THE SDG AND VUA NBRS. */ 01846000
*/* **************************************************************** */ 01847000
*                                                                  0518 01848000
*                     ELSE                                         0518 01849000
*                       DO KNDEX=1 TO 64;/*                  @VA11343*/ 01850000
@RF00513 LA    @14,1                                               0518 01851000
         STC   @14,KNDEX                                           0518 01852000
@DL00518 DS    0H                                                  0519 01853000
*                         IF STATUS(KNDEX)='FF'X THEN              0519 01854000
         SLA   @14,2                                               0519 01855000
         L     @12,SECNDPTR                                        0519 01856000
         ALR   @12,@14                                             0519 01857000
         CLI   STATUS-4(@12),X'FF'                                 0519 01858000
         BE    @RT00519                                            0519 01859000
*                           ;       /*                       @VA11343*/ 01860000
*                         ELSE                                     0521 01861000
*                           DO;     /*                       @VA11343*/ 01862000
*                             CNTVUA=CNTVUA+1;/* INCREMENT COUNT OF     01863000
*                                      VUA'S                 @VA11343*/ 01864000
         L     @14,MSSPTR                                          0522 01865000
         LA    @12,1                                               0522 01866000
         AL    @12,CNTVUA(,@14)                                    0522 01867000
         ST    @12,CNTVUA(,@14)                                    0522 01868000
*/* **************************************************************** */ 01869000
*/* PICK UP THE CHANNEL IN THE LOW-ORDER BITS OF THE FIRST BYTE OF   */ 01870000
*/* THIS VUA-TABLE ENTRY.                                            */ 01871000
*/* **************************************************************** */ 01872000
*                                                                  0523 01873000
*                             VUA1(CNTVUA)=(VUA1(CNTVUA)&'00'X)|/* 0523 01874000
*                                                            @VA11343*/ 01875000
*                                 (BYTE2(LNDEX,JNDEX)&'0F'X);/*    0523 01876000
*                                                            @VA11343*/ 01877000
         SLA   @12,2                                               0523 01878000
         ST    @12,@TF00001                                        0523 01879000
         ALR   @12,@14                                             0523 01880000
         ST    @12,@TF00002                                        0523 01881000
         LR    @12,@14                                             0523 01882000
         AL    @12,@TF00001                                        0523 01883000
         MVC   @TS00001(1),VUA1-4(@12)                             0523 01884000
         NI    @TS00001,X'00'                                      0523 01885000
         L     @12,FIRSTPTR                                        0523 01886000
         SLR   @14,@14                                             0523 01887000
         IC    @14,LNDEX                                           0523 01888000
         SLA   @14,2                                               0523 01889000
         ST    @12,@TF00003                                        0523 01890000
         SLR   @12,@12                                             0523 01891000
         IC    @12,JNDEX                                           0523 01892000
         ALR   @14,@12                                             0523 01893000
         ALR   @14,@14                                             0523 01894000
         L     @12,@TF00003                                        0523 01895000
         ALR   @12,@14                                             0523 01896000
         MVC   @TS00001+1(1),BYTE2-10(@12)                         0523 01897000
         NI    @TS00001+1,X'0F'                                    0523 01898000
         OC    @TS00001(1),@TS00001+1                              0523 01899000
         L     @12,@TF00002                                        0523 01900000
         MVC   VUA1-4(1,@12),@TS00001                              0523 01901000
*/* **************************************************************** */ 01902000
*/* PICK UP THE CONTROL UNIT IN THE HIGH-ORDER 2 BITS OF THE SECOND  */ 01903000
*/* BYTE OF THIS VUA-TABLE ENTRY.                                    */ 01904000
*/* **************************************************************** */ 01905000
*                                                                  0524 01906000
*                             VUA2(CNTVUA)=(VUA2(CNTVUA)&'3F'X)|/* 0524 01907000
*                                                            @VA11343*/ 01908000
*                                 (BYTE2(LNDEX,JNDEX)&'C0'X);/*    0524 01909000
*                                                            @VA11343*/ 01910000
         L     @12,MSSPTR                                          0524 01911000
         ST    @14,@TF00002                                        0524 01912000
         LR    @14,@12                                             0524 01913000
         AL    @14,@TF00001                                        0524 01914000
         ST    @14,@TF00004                                        0524 01915000
         LR    @14,@12                                             0524 01916000
         AL    @14,@TF00001                                        0524 01917000
         MVC   @TS00001(1),VUA2-4(@14)                             0524 01918000
         NI    @TS00001,X'3F'                                      0524 01919000
         L     @14,@TF00003                                        0524 01920000
         AL    @14,@TF00002                                        0524 01921000
         MVC   @TS00001+1(1),BYTE2-10(@14)                         0524 01922000
         NI    @TS00001+1,X'C0'                                    0524 01923000
         OC    @TS00001(1),@TS00001+1                              0524 01924000
         L     @14,@TF00004                                        0524 01925000
         MVC   VUA2-4(1,@14),@TS00001                              0524 01926000
*                             TEMP1=KNDEX-1;/* SET UP FOR BIT MOVE 0525 01927000
*                                                            @VA11343*/ 01928000
         SLR   @14,@14                                             0525 01929000
         IC    @14,KNDEX                                           0525 01930000
         LR    @12,@14                                             0525 01931000
         BCTR  @12,0                                               0525 01932000
         STC   @12,TEMP1                                           0525 01933000
*/* **************************************************************** */ 01934000
*/* THE REMAINING BITS IN THE THIRD BYTE OF THIS VUA-TABLE ENTRY     */ 01935000
*/* SHOULD CONTAIN THE INDEX INTO THE CONFIG DATA BLOK (1-64) MINUS  */ 01936000
*/* 1. THIS IS THE DEVICE NUMBER.                                    */ 01937000
*/* **************************************************************** */ 01938000
*                                                                  0526 01939000
*                             VUA2(CNTVUA)=(VUA2(CNTVUA)&'C0'X)|/* 0526 01940000
*                                                            @VA11343*/ 01941000
*                                 (TEMP1&'3F'X);                   0526 01942000
*                                                                  0526 01943000
         L     @12,MSSPTR                                          0526 01944000
         LR    @14,@12                                             0526 01945000
         AL    @14,@TF00001                                        0526 01946000
         ST    @14,@TF00002                                        0526 01947000
         LR    @14,@12                                             0526 01948000
         AL    @14,@TF00001                                        0526 01949000
         MVC   @TS00001(1),VUA2-4(@14)                             0526 01950000
         NI    @TS00001,X'C0'                                      0526 01951000
         MVC   @TS00001+1(1),TEMP1                                 0526 01952000
         NI    @TS00001+1,X'3F'                                    0526 01953000
         OC    @TS00001(1),@TS00001+1                              0526 01954000
         L     @14,@TF00002                                        0526 01955000
         MVC   VUA2-4(1,@14),@TS00001                              0526 01956000
*/* **************************************************************** */ 01957000
*/* CP EXPECTS SHARED STATUS TO BE REFLECTED EXACTLY OPPOSITE FROM   */ 01958000
*/*        HOW IT'S REPRESENTED IN THE MSC TABLES                    */ 01959000
*/* **************************************************************** */ 01960000
*                                                                  0527 01961000
*                             IF CONFSHR(KNDEX)=ON THEN            0527 01962000
         SLR   @14,@14                                             0527 01963000
         IC    @14,KNDEX                                           0527 01964000
         SLA   @14,2                                               0527 01965000
         L     @12,SECNDPTR                                        0527 01966000
         ALR   @12,@14                                             0527 01967000
         TM    CONFSHR-4(@12),B'10000000'                          0527 01968000
         BNO   @RF00527                                            0527 01969000
*                               SHRD(CNTVUA)=OFF;/*          @VA11343*/ 01970000
         L     @14,MSSPTR                                          0528 01971000
         AL    @14,@TF00001                                        0528 01972000
         NI    SHRD-4(@14),B'01111111'                             0528 01973000
*                             ELSE                                 0529 01974000
*                               SHRD(CNTVUA)=ON;/*           @VA11343*/ 01975000
         B     @RC00527                                            0529 01976000
@RF00527 L     @14,MSSPTR                                          0529 01977000
         L     @12,CNTVUA(,@14)                                    0529 01978000
         SLA   @12,2                                               0529 01979000
         ALR   @14,@12                                             0529 01980000
         OI    SHRD-4(@14),B'10000000'                             0529 01981000
*/* **************************************************************** */ 01982000
*/* GET THE SDG NUMBER                                               */ 01983000
*/* **************************************************************** */ 01984000
*                                                                  0530 01985000
*                             NUMSDG(CNTVUA)='00'X;/*        @VA11343*/ 01986000
@RC00527 L     @14,MSSPTR                                          0530 01987000
         L     @12,CNTVUA(,@14)                                    0530 01988000
         SLA   @12,2                                               0530 01989000
         ST    @12,@TF00001                                        0530 01990000
         ALR   @12,@14                                             0530 01991000
         MVI   NUMSDG-4(@12),X'00'                                 0530 01992000
*                             NUMSDG(CNTVUA)=(STATUS(KNDEX)&'1F'X);/*   01993000
*                                                            @VA11343*/ 01994000
         AL    @14,@TF00001                                        0531 01995000
         SLR   @12,@12                                             0531 01996000
         IC    @12,KNDEX                                           0531 01997000
         SLA   @12,2                                               0531 01998000
         ST    @12,@TF00001                                        0531 01999000
         L     @12,SECNDPTR                                        0531 02000000
         AL    @12,@TF00001                                        0531 02001000
         MVC   NUMSDG-4(1,@14),STATUS-4(@12)                       0531 02002000
         NI    NUMSDG-4(@14),X'1F'                                 0531 02003000
*                           END;    /*                       @VA11343*/ 02004000
*                       END;        /*                       @VA11343*/ 02005000
@RT00519 LA    @14,1                                               0533 02006000
         SLR   @12,@12                                             0533 02007000
         IC    @12,KNDEX                                           0533 02008000
         ALR   @14,@12                                             0533 02009000
         STC   @14,KNDEX                                           0533 02010000
         C     @14,@CF01792                                        0533 02011000
         BNH   @DL00518                                            0533 02012000
*                   END;            /*                       @VA11343*/ 02013000
*               END;                /*                       @VA11343*/ 02014000
@RT00491 LA    @12,1                                               0535 02015000
         SLR   @01,@01                                             0535 02016000
         IC    @01,JNDEX                                           0535 02017000
         ALR   @12,@01                                             0535 02018000
         STC   @12,JNDEX                                           0535 02019000
         C     @12,@CF00109                                        0535 02020000
         BNH   @DL00490                                            0535 02021000
*           END;                    /*                       @VA11343*/ 02022000
@RT00488 LA    @12,1                                               0536 02023000
         SLR   @01,@01                                             0536 02024000
         IC    @01,LNDEX                                           0536 02025000
         ALR   @12,@01                                             0536 02026000
         STC   @12,LNDEX                                           0536 02027000
         C     @12,@CF00060                                        0536 02028000
         BNH   @DL00487                                            0536 02029000
*         END;                      /*                       @VA11343*/ 02030000
*     END;                          /*                       @VA11343*/ 02031000
@RC00482 DS    0H                                                  0539 02032000
*/* **************************************************************** */ 02033000
*/*  WE'RE JUST ABOUT DONE WITH INITIALIZATION. GET RID OF BUFFERS.  */ 02034000
*/* **************************************************************** */ 02035000
*                                                                  0539 02036000
*ENDALL:                            /*                       @VA11343*/ 02037000
*   RFY                                                            0539 02038000
*    (R0,                                                          0539 02039000
*     R1,                                                          0539 02040000
*     R2,                                                          0539 02041000
*     R15) RSTD;                    /*                       @VA11343*/ 02042000
@RC00475 DS    0H                                                  0539 02043000
ENDALL   DS    0H                                                  0540 02044000
*   TEMP2=R15;                      /* SAVE RETURN CODE AROUND MACROS   02045000
*                                                            @VA11343*/ 02046000
         ST    R15,TEMP2                                           0540 02047000
*   R0=512;                         /* SIZE OF QUERY RESPONSE BUFFER    02048000
*                                                            @VA11343*/ 02049000
         LA    R0,512                                              0541 02050000
*   R1=FIRSTPTR;                    /* RELEASE CONFIG TABLE BUFFER 0542 02051000
*                                                            @VA11343*/ 02052000
         L     R1,FIRSTPTR                                         0542 02053000
*   GEN(FREEMAIN R,LV=(0),A=(1));   /*                       @VA11343*/ 02054000
         FREEMAIN R,LV=(0),A=(1)                                        02055000
*   R0=512;                         /* SIZE OF QUERY RESPONSE BUFFER    02056000
*                                                            @VA11343*/ 02057000
         LA    R0,512                                              0544 02058000
*   R1=SECNDPTR;                    /* RELEASE CONFIG DATA BLOK    0545 02059000
*                                      BUFFER                @VA11343*/ 02060000
         L     R1,SECNDPTR                                         0545 02061000
*   GEN(FREEMAIN R,LV=(0),A=(1));   /*                       @VA11343*/ 02062000
         FREEMAIN R,LV=(0),A=(1)                                        02063000
*   R15=TEMP2;                      /* RESTORE RETURN CODE AFTER   0547 02064000
*                                      MACROS                @VA11343*/ 02065000
         L     R15,TEMP2                                           0547 02066000
*/* **************************************************************** */ 02067000
*/* IF THE RETURN CODE WE'RE PASSING BACK AT THIS POINT IS NOT ZEROS */ 02068000
*/* WE WANT TO RELEASE THE TABLE WE'VE BUILT, NOT SEND IT TO CP, AND */ 02069000
*/* TELL THE CALLING PROC TO TERMINATE THE CENTRAL SERVER.           */ 02070000
*/* **************************************************************** */ 02071000
*                                                                  0548 02072000
*   IF R15=0 THEN                                                  0548 02073000
         LTR   R15,R15                                             0548 02074000
         BNZ   @RF00548                                            0548 02075000
*     DO;                           /* IS IT OKAY TO ISSUE DIAG    0549 02076000
*                                      SUBCODE 20?           @VA11343*/ 02077000
*       RFY                                                        0550 02078000
*        (R5,                                                      0550 02079000
*         R6) RSTD;                 /*                       @VA11343*/ 02080000
*       R5=20;                      /* SUBCODE 20 TO TELL CP TO BUILD   02081000
*                                      SDG TABLES            @VA11343*/ 02082000
         LA    R5,20                                               0551 02083000
*       R6=MSSPTR;                  /* POINT TO LIST OF VUA'S IN CP'S   02084000
*                                      CONFIG                @VA11343*/ 02085000
         L     R6,MSSPTR                                           0552 02086000
*       GEN REFS(R0,R4,R6,DIAGNOSE);                               0553 02087000
*                              /* ISSUE THE DIAGNOSE INSTR  @VA11343*/  02088000
        LRA   R4,0(R6)                                  /*  @VA11343*/  02089000
        EX    R0,DIAGNOSE                               /*  @VA11343*/  02090000
*       RFY                                                        0554 02091000
*        (R5,                                                      0554 02092000
*         R6) UNRSTD;               /*                       @VA11343*/ 02093000
*       IF R15=0 THEN                                              0555 02094000
         LTR   R15,R15                                             0555 02095000
         BZ    @RT00555                                            0555 02096000
*         ;                         /* DID CP BUILD SDG TABLES     0556 02097000
*                                      CORRECTLY?            @VA11343*/ 02098000
*       ELSE                                                       0557 02099000
*         TEMP2=12;                 /* SAVE NEW RETURN CODE IF NOT 0557 02100000
*                                                            @VA11343*/ 02101000
         MVC   TEMP2(4),@CF00901                                   0557 02102000
*     END;                          /*                       @VA11343*/ 02103000
@RT00555 DS    0H                                                  0559 02104000
*   R2=7172;                        /* SIZE OF BUFFER PASSED TO CP 0559 02105000
*                                                            @VA11343*/ 02106000
@RF00548 L     R2,@CF02324                                         0559 02107000
*   R1=MSSPTR;                      /* POINT AT VUA TABLE BUFFER   0560 02108000
*                                                            @VA11343*/ 02109000
         L     R1,MSSPTR                                           0560 02110000
*   GEN(FREEMAIN R,LV=(2),A=(1),SP=253);/*                   @VA11343*/ 02111000
         FREEMAIN R,LV=(2),A=(1),SP=253                                 02112000
*   R15=TEMP2;                      /* RESTORE CORRECT RETURN CODE 0562 02113000
*                                                            @VA11343*/ 02114000
         L     R15,TEMP2                                           0562 02115000
*   RETURN CODE(R15);               /* RETURN TO CALLING PROC      0563 02116000
*                                                            @VA11343*/ 02117000
         L     @14,@SA00007                                        0563 02118000
         LM    @00,@12,@SA00007+8                                  0563 02119000
         BR    @14                                                 0563 02120000
*   RFY                                                            0564 02121000
*    (R0,                                                          0564 02122000
*     R1,                                                          0564 02123000
*     R2,                                                          0564 02124000
*     R15) UNRSTD;                  /*                       @VA11343*/ 02125000
*   END QRYMSC;                     /*                       @VA11343*/ 02126000
*   END DMKMSS                      /*                       @VA11343*/ 02127000
*                                                                  0566 02128000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02129000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 02130000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 02131000
*/*%INCLUDE SYSLIB  (IEZDEB  )                                       */ 02132000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 02133000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02134000
*/*%INCLUDE SYSLIB  (IEZICB  )                                       */ 02135000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 02136000
*/*%INCLUDE SYSLIB  (MSSCOM  )                                       */ 02137000
*                                                                  0566 02138000
*       ;                                                          0566 02139000
@DATA    DS    0H                                                       02140000
@CH02154 DC    XL2'0193'                                                02141000
         DS    0F                                                       02142000
@AL00188 EQU   *                       LIST WITH   1 ARGUMENT(S)        02143000
@AL00328 DC    A(@CF00060)             LIST WITH   1 ARGUMENT(S)        02144000
@AL00194 DC    A(@CF00109)             LIST WITH   1 ARGUMENT(S)        02145000
@AL00218 EQU   *                       LIST WITH   1 ARGUMENT(S)        02146000
@AL00333 DC    A(@CF00072)             LIST WITH   1 ARGUMENT(S)        02147000
@AL00338 DC    A(@CF00901)             LIST WITH   1 ARGUMENT(S)        02148000
@DATD    DSECT                                                          02149000
         DS    0F                                                       02150000
@SA00001 DS    18F                                                      02151000
@SA00004 DS    15F                                                      02152000
@SA00007 DS    15F                                                      02153000
@SA00003 DS    15F                                                      02154000
@PC00003 DS    1F                                                       02155000
@SA00005 DS    15F                                                      02156000
@SA00002 DS    15F                                                      02157000
@TF00001 DS    F                                                        02158000
@TF00002 DS    F                                                        02159000
@TF00003 DS    F                                                        02160000
@TF00004 DS    F                                                        02161000
DMKMSS   CSECT                                                          02162000
         DS    0F                                                       02163000
@CF00074 DC    F'1'                                                     02164000
@CF00109 DC    F'4'                                                     02165000
@CH00109 EQU   @CF00109+2                                               02166000
@CF00072 DC    F'8'                                                     02167000
@CF00901 DC    F'12'                                                    02168000
@CF00060 DC    F'16'                                                    02169000
@CF01704 DC    F'32'                                                    02170000
@CF01792 DC    F'64'                                                    02171000
@CF02324 DC    F'7172'                                                  02172000
@CF02341 DC    XL4'0000FFFF'                                            02173000
@DATD    DSECT                                                          02174000
         DS    0D                                                       02175000
DEBDAPTR DS    A                                                        02176000
DEBEXPTR DS    A                                                        02177000
DEBSBPTR DS    A                                                        02178000
UCBDCPTR DS    A                                                        02179000
MVTPTR   DS    A                                                        02180000
TEMP3    DS    F                                                        02181000
TEMP     DS    F                                                        02182000
VOLMNTD  DS    F                                                        02183000
FIRSTPTR DS    A                                                        02184000
SECNDPTR DS    A                                                        02185000
MSSPTR   DS    A                                                        02186000
TEMP2    DS    F                                                        02187000
MVINDX   DS    F                                                        02188000
RELINDEX DS    H                                                        02189000
LNDEX    DS    FL1                                                      02190000
JNDEX    DS    FL1                                                      02191000
KNDEX    DS    FL1                                                      02192000
@TS00001 DS    CL2                                                      02193000
         DS    CL5                                                      02194000
WRKAREA  DS    CL192                                                    02195000
         ORG   WRKAREA                                                  02196000
COMMDCB  DS    CL92                                                     02197000
BUFFER   DS    CL40                                                     02198000
RCODE    DS    FL2                                                      02199000
         DS    CL3                                                      02200000
ADECB    DS    AL3                                                      02201000
INITFLAG DS    BL1                                                      02202000
         ORG   INITFLAG                                                 02203000
MSSINIT  DS    BL1                                                      02204000
VIRTFLAG EQU   INITFLAG+0                                               02205000
INITCTR  EQU   INITFLAG+0                                               02206000
@NM00001 EQU   INITFLAG+0                                               02207000
         ORG   WRKAREA+144                                              02208000
RETCODE  DS    FL4                                                      02209000
OPENLIST DS    FL4                                                      02210000
MSSECB   DS    FL4                                                      02211000
INDEX    DS    FL4                                                      02212000
WTLIST   DS    CL8                                                      02213000
         ORG   WTLIST                                                   02214000
ADMSSECB DS    AL4                                                      02215000
ENDLIST  DS    CL1                                                      02216000
WTORECBA DS    AL3                                                      02217000
         ORG   WRKAREA+168                                              02218000
SAVE1    DS    FL4                                                      02219000
SAVE2    DS    FL4                                                      02220000
SAVE3    DS    FL4                                                      02221000
         DS    CL4                                                      02222000
VIRT     DS    CL8                                                      02223000
         ORG   VIRT                                                     02224000
@NM00002 DS    CL1                                                      02225000
CPUID    DS    CL5                                                      02226000
@NM00003 DS    CL2                                                      02227000
         ORG   WRKAREA+192                                              02228000
MDSKEXTS DS    CL64                                                     02229000
         ORG   MDSKEXTS                                                 02230000
BEGCC    DS    FL2                                                      02231000
ENDCC    DS    FL2                                                      02232000
@NM00090 DS    CL60                                                     02233000
         ORG   MDSKEXTS+64                                              02234000
QRYPARM  DS    CL20                                                     02235000
         ORG   QRYPARM                                                  02236000
QRYID    DS    CL1                                                      02237000
QRYRD    DS    CL1                                                      02238000
QRYSEC   DS    CL2                                                      02239000
QRYVOL   DS    CL6                                                      02240000
QRYFILL  DS    CL10                                                     02241000
         ORG   QRYPARM+20                                               02242000
RSNCODE  DS    CL4                                                      02243000
TEMP4    DS    CL4                                                      02244000
QUERLIST DS    CL44                                                     02245000
         ORG   QUERLIST                                                 02246000
QULEN    DS    FL4                                                      02247000
QUORD    DS    CL1                                                      02248000
QURES    DS    CL1                                                      02249000
QUCODE   DS    BL1                                                      02250000
         ORG   QUCODE                                                   02251000
QULIB    DS    BL1                                                      02252000
         ORG   QUERLIST+7                                               02253000
QUSECT   DS    BL1                                                      02254000
         ORG   QUSECT                                                   02255000
QUXADDR  DS    BL1                                                      02256000
         ORG   QUXADDR                                                  02257000
QUFLAG   DS    BL1                                                      02258000
         ORG   QUFLAG                                                   02259000
QURES1   DS    CL1                                                      02260000
         ORG   QUERLIST+8                                               02261000
QUPARM   DS    CL32                                                     02262000
QUPTR    DS    FL4                                                      02263000
         ORG   QUERLIST+44                                              02264000
CHRMAP   DS    CL4                                                      02265000
         ORG   CHRMAP                                                   02266000
CYL      DS    CL2                                                      02267000
HD       DS    CL1                                                      02268000
REC      DS    CL1                                                      02269000
         ORG   CHRMAP+4                                                 02270000
TEMP1    DS    BL1                                                      02271000
DMKMSS   CSECT                                                          02272000
         DS    0F                                                       02273000
@SIZDATD DC    AL1(0)                                                   02274000
         DC    AL3(@ENDDATD-@DATD)                                      02275000
         DS    0D                                                       02276000
DIAGNOSE DC    XL4'83450078'                                            02277000
HEX80    DC    XL4'80000000'                                            02278000
MASK     DC    XL4'80000000'                                            02279000
MTFLAG   DC    XL2'0100'                                                02280000
DMFLAG   DC    XL2'2000'                                                02281000
MASK2    DC    XL1'3F'                                                  02282000
VIRTTEST DC    XL1'FF'                                                  02283000
LISTEND  DC    XL1'80'                                                  02284000
RLQSH    DC    XL1'44'                                                  02285000
NMBREXTS DC    XL1'01'                                                  02286000
@CB02003 DC    X'0000'                                                  02287000
@CB02327 DC    X'001A'                                                  02288000
         DS    CL3                                                      02289000
WTORECB  DS    CL4                                                      02290000
         ORG   WTORECB                                                  02291000
WTPOST   DS    BL1                                                      02292000
         ORG   WTPOST                                                   02293000
WAITFLG  DS    BL1                                                      02294000
POSTFLAG EQU   WTPOST+0                                                 02295000
@NM00004 EQU   WTPOST+0                                                 02296000
         ORG   WTORECB+1                                                02297000
RBADDR   DS    AL3                                                      02298000
         ORG   WTORECB+4                                                02299000
WTOREPLY DS    CL1                                                      02300000
         DS    CL3                                                      02301000
MONBLK   DS    CL28                                                     02302000
         ORG   MONBLK                                                   02303000
MDLEN    DC    XL4'1C'                                                  02304000
MDOPCD   DC    XL1'08'                                                  02305000
MNTRES1  DC    X'00'                                                    02306000
MDFLG    DC    B'0000000000000000'                                      02307000
         ORG   MDFLG                                                    02308000
@NM00082 DS    BL1                                                      02309000
MDVISMNT EQU   MDFLG+0                                                  02310000
MDVSVRQ  EQU   MDFLG+0                                                  02311000
MDSRTCH  EQU   MDFLG+0                                                  02312000
@NM00083 EQU   MDFLG+0                                                  02313000
         ORG   MONBLK+8                                                 02314000
MDVOL    DS    CL6                                                      02315000
         ORG   MDVOL                                                    02316000
@NM00084 DC    6X'00'                                                   02317000
         ORG   MONBLK+14                                                02318000
MDVUA    DC    H'0'                                                     02319000
MDHOST   DS    CL5                                                      02320000
         ORG   MDHOST                                                   02321000
@NM00085 DC    5X'00'                                                   02322000
         ORG   MONBLK+21                                                02323000
MNTRES2  DC    XL3'0'                                                   02324000
MDJFCB   DC    F'0'                                                     02325000
         ORG   MONBLK+28                                                02326000
DMOBLK   DS    CL28                                                     02327000
         ORG   DMOBLK                                                   02328000
DMLEN    DC    XL4'1C'                                                  02329000
DMOPCD   DC    XL1'06'                                                  02330000
DMNTRES1 DC    X'00'                                                    02331000
DMNTFLAG DC    B'0000000000000000'                                      02332000
         ORG   DMNTFLAG                                                 02333000
DMBITRE1 DS    BL1                                                      02334000
DMDELRSP EQU   DMNTFLAG+0                                               02335000
DMVUAVAL EQU   DMNTFLAG+0                                               02336000
DMBITRES EQU   DMNTFLAG+0                                               02337000
         ORG   DMOBLK+8                                                 02338000
DMVOL    DC    XL6'0'                                                   02339000
DMNTASID DC    XL2'0'                                                   02340000
DMNTECB  DC    F'0'                                                     02341000
DMHOST   DC    XL5'0'                                                   02342000
DMNTRES2 DC    XL1'0'                                                   02343000
DMNTVUA  DC    H'0'                                                     02344000
         ORG   DMOBLK+28                                                02345000
RLQBLK   DS    CL96                                                     02346000
         ORG   RLQBLK                                                   02347000
ARLL     DC    F'96'                                                    02348000
AROP     DC    AL1(4)                                                   02349000
@NM00086 DC    X'00'                                                    02350000
ARFLG    DC    B'00000000'                                              02351000
         ORG   ARFLG                                                    02352000
ARBDUBD  DS    BL1                                                      02353000
ARDRES   EQU   ARFLG+0                                                  02354000
ARINH    EQU   ARFLG+0                                                  02355000
ARSEC    EQU   ARFLG+0                                                  02356000
ARWANR   EQU   ARFLG+0                                                  02357000
ARVMSW   EQU   ARFLG+0                                                  02358000
@NM00087 EQU   ARFLG+0                                                  02359000
         ORG   RLQBLK+7                                                 02360000
ARNMEXT  DC    AL1(0)                                                   02361000
ARVOL    DC    X'000000000000'                                          02362000
ARASID   DC    X'0000'                                                  02363000
ARECB    DC    A(0)                                                     02364000
ARHOST   DC    X'0000000000'                                            02365000
@NM00088 DC    X'00'                                                    02366000
ARCOMPC  DC    X'0000'                                                  02367000
AREXT    DS    CL4                                                      02368000
         ORG   AREXT+0                                                  02369000
@NM00089 DC    X'00000000'                                              02370000
         ORG   RLQBLK+92                                                02371000
ARNEDB   DC    A(0)                                                     02372000
         ORG   RLQBLK+96                                                02373000
         DS    CL4                                                      02374000
WAITTIME DC    CL8'00100000'                                            02375000
BLNK     DC    X'40'                                                    02376000
PATCH    DC    CL60'PATCH AREA DMKMSS'                                  02377000
MVENT    DC    X'00'                                                    02378000
         DS    CL2                                                      02379000
I03506   DS    CL52                                                     02380000
         ORG   I03506                                                   02381000
I0350601 DC    H'48'                                                    02382000
I0350602 DC    B'1000000000000000'                                      02383000
I0350603 DC    CL44'DMKMSS ERROR READING MSS CONFIGURATION TABLE'       02384000
I0350604 DC    B'0001000000000000'                                      02385000
I0350605 DC    B'0100000000000000'                                      02386000
         ORG   I03506+52                                                02387000
I03508   DS    CL58                                                     02388000
         ORG   I03508                                                   02389000
I0350801 DC    H'54'                                                    02390000
I0350802 DC    B'1000000000000000'                                      02391000
I0350803 DC    CL50'DMKMSS CPUID NOT FOUND IN MSS CONFIGURATION TABLES' 02392000
I0350804 DC    B'0001000000000000'                                      02393000
I0350805 DC    B'0100000000000000'                                      02394000
         ORG   I03508+58                                                02395000
         DS    CL2                                                      02396000
I03510   DS    CL53                                                     02397000
         ORG   I03510                                                   02398000
I0351001 DC    H'49'                                                    02399000
I0351002 DC    B'1000000000000000'                                      02400000
I0351003 DC    CL45'DMKMSS ERROR CREATING MSS CONFIGURATION TABLE'      02401000
I0351004 DC    B'0001000000000000'                                      02402000
I0351005 DC    B'0100000000000000'                                      02403000
         ORG   I03510+53                                                02404000
         DS    CL3                                                      02405000
I03514   DS    CL42                                                     02406000
         ORG   I03514                                                   02407000
I0351401 DC    H'38'                                                    02408000
I0351402 DC    B'1000000000000000'                                      02409000
I0351403 DC    CL34'INVALID REQUEST CODE IN VM REQUEST'                 02410000
I0351404 DC    B'0001000000000000'                                      02411000
I0351405 DC    B'0100000000000000'                                      02412000
         ORG   I03514+42                                                02413000
         DS    CL2                                                      02414000
I03516   DS    CL48                                                     02415000
         ORG   I03516                                                   02416000
I0351601 DC    H'44'                                                    02417000
I0351602 DC    B'1000000000000000'                                      02418000
I0351603 DC    CL40'DMKMSS ENDING ERROR- MSS NOT INITIALIZED'           02419000
I0351604 DC    B'0001000000000000'                                      02420000
I0351605 DC    B'0100000000000000'                                      02421000
         ORG   I03516+48                                                02422000
I03518   DS    CL60                                                     02423000
         ORG   I03518                                                   02424000
I0351801 DC    H'56'                                                    02425000
I0351802 DC    B'1000000000000000'                                      02426000
I0351803 DC    CL52'DMKMSS ENDING ERROR- DCB FOR COMM. DEVICE NOT OPENEC02427000
               D'                                                       02428000
I0351804 DC    B'0001000000000000'                                      02429000
I0351805 DC    B'0100000000000000'                                      02430000
         ORG   I03518+60                                                02431000
I03520   DS    CL62                                                     02432000
         ORG   I03520                                                   02433000
I0352001 DC    H'58'                                                    02434000
I0352002 DC    B'1000000000000000'                                      02435000
I0352003 DC    CL54'DMKMSS ENDING ERROR-DMKMSS MUST RUN IN A VIRTUAL MAC02436000
               CH.'                                                     02437000
I0352004 DC    B'0001000000000000'                                      02438000
I0352005 DC    B'0100000000000000'                                      02439000
         ORG   I03520+62                                                02440000
DMKMSS   CSECT                                                          02441000
ACTDCB DCB DSORG=PS,DDNAME=COMM,LRECL=80,RECFM=F,MACRF=PL               02442000
@DATD    DSECT                                                          02443000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02444000
@ENDDATD EQU   *                                                        02445000
DMKMSS   CSECT                                                          02446000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02447000
@01      EQU   01                                                       02448000
@02      EQU   02                                                       02449000
@03      EQU   03                                                       02450000
@04      EQU   04                                                       02451000
@05      EQU   05                                                       02452000
@06      EQU   06                                                       02453000
@07      EQU   07                                                       02454000
@08      EQU   08                                                       02455000
@09      EQU   09                                                       02456000
@10      EQU   10                                                       02457000
@11      EQU   11                                                       02458000
@12      EQU   12                                                       02459000
@13      EQU   13                                                       02460000
@14      EQU   14                                                       02461000
@15      EQU   15                                                       02462000
R0       EQU   @00                                                      02463000
R1       EQU   @01                                                      02464000
R2       EQU   @02                                                      02465000
R3       EQU   @03                                                      02466000
R4       EQU   @04                                                      02467000
R5       EQU   @05                                                      02468000
R6       EQU   @06                                                      02469000
R7       EQU   @07                                                      02470000
R8       EQU   @08                                                      02471000
R9       EQU   @09                                                      02472000
R10      EQU   @10                                                      02473000
R12      EQU   @12                                                      02474000
R13      EQU   @13                                                      02475000
R14      EQU   @14                                                      02476000
R15      EQU   @15                                                      02477000
GPR00P   EQU   @00                                                      02478000
GPR01P   EQU   @01                                                      02479000
DCBPTR   EQU   @02                                                      02480000
DEBPTR   EQU   @03                                                      02481000
UCBPTR   EQU   @07                                                      02482000
ICBPTR   EQU   @08                                                      02483000
COMMPTR  EQU   @09                                                      02484000
MDREG1   EQU   @01                                                      02485000
ARR1     EQU   @01                                                      02486000
QUERR1   EQU   @01                                                      02487000
R11      EQU   @11                                                      02488000
CVTPTR   EQU   16                                                       02489000
PSA      EQU   0                                                        02490000
FLCRNPSW EQU   PSA                                                      02491000
FLCROPSW EQU   PSA+8                                                    02492000
FLCICCW2 EQU   PSA+16                                                   02493000
PSAEEPSW EQU   PSA+132                                                  02494000
PSAESPSW EQU   PSA+136                                                  02495000
FLCSVILC EQU   PSAESPSW+1                                               02496000
PSAEPPSW EQU   PSA+140                                                  02497000
FLCPIILC EQU   PSAEPPSW+1                                               02498000
FLCPICOD EQU   PSAEPPSW+2                                               02499000
PSAPICOD EQU   FLCPICOD+1                                               02500000
FLCTEA   EQU   PSAEPPSW+4                                               02501000
FLCPER   EQU   PSA+152                                                  02502000
FLCMCLA  EQU   PSA+168                                                  02503000
FLCCHNID EQU   FLCMCLA                                                  02504000
FLCCHTM  EQU   FLCCHNID                                                 02505000
FLCIOEL  EQU   FLCMCLA+4                                                02506000
FLCIOA   EQU   FLCMCLA+16                                               02507000
PSAMEDC  EQU   FLCMCLA+76                                               02508000
FLCFSA   EQU   FLCMCLA+80                                               02509000
PSASUPER EQU   PSA+552                                                  02510000
PSASUP1  EQU   PSASUPER                                                 02511000
PSASUP2  EQU   PSASUPER+1                                               02512000
PSASUP3  EQU   PSASUPER+2                                               02513000
PSASUP4  EQU   PSASUPER+3                                               02514000
PSACLHT  EQU   PSA+640                                                  02515000
PSALKSA  EQU   PSA+696                                                  02516000
PSAHLHI  EQU   PSA+760                                                  02517000
PSADSSFL EQU   PSA+836                                                  02518000
PSADSSF1 EQU   PSADSSFL                                                 02519000
PSADSSF3 EQU   PSADSSFL+2                                               02520000
PSADSSF4 EQU   PSADSSFL+3                                               02521000
PSARSVT  EQU   PSA+896                                                  02522000
IHADCB   EQU   0                                                        02523000
IHADCS00 EQU   0                                                        02524000
DCBFDAD  EQU   IHADCS00+5                                               02525000
IHADCS01 EQU   0                                                        02526000
DCBDVTBL EQU   IHADCS01                                                 02527000
IHADCS11 EQU   0                                                        02528000
DCBRELB  EQU   IHADCS11                                                 02529000
DCBREL   EQU   DCBRELB+1                                                02530000
DCBBUFCB EQU   IHADCS11+4                                               02531000
DCBDSORG EQU   IHADCS11+10                                              02532000
DCBDSRG1 EQU   DCBDSORG                                                 02533000
DCBDSRG2 EQU   DCBDSORG+1                                               02534000
DCBIOBAD EQU   IHADCS11+12                                              02535000
DCBODEB  EQU   DCBIOBAD                                                 02536000
DCBLNP   EQU   DCBODEB                                                  02537000
DCBQSLM  EQU   DCBLNP                                                   02538000
DCBIOBAA EQU   DCBODEB+1                                                02539000
IHADCS50 EQU   0                                                        02540000
DCBSVCXL EQU   IHADCS50                                                 02541000
DCBEODAD EQU   IHADCS50+4                                               02542000
DCBBFALN EQU   DCBEODAD                                                 02543000
DCBHIARC EQU   DCBBFALN                                                 02544000
DCBBFTEK EQU   DCBHIARC                                                 02545000
DCBBFT   EQU   DCBBFTEK                                                 02546000
DCBEXLST EQU   IHADCS50+8                                               02547000
DCBRECFM EQU   DCBEXLST                                                 02548000
DCBRECLA EQU   DCBRECFM                                                 02549000
IHADCS24 EQU   0                                                        02550000
DCBOFLGS EQU   IHADCS24+8                                               02551000
DCBOFLWR EQU   DCBOFLGS                                                 02552000
DCBOFOPN EQU   DCBOFLGS                                                 02553000
DCBIFLG  EQU   IHADCS24+9                                               02554000
DCBIBPCT EQU   DCBIFLG                                                  02555000
DCBMACR  EQU   IHADCS24+10                                              02556000
DCBMACR1 EQU   DCBMACR                                                  02557000
DCBMRFE  EQU   DCBMACR1                                                 02558000
DCBMRGET EQU   DCBMRFE                                                  02559000
DCBMRAPG EQU   DCBMACR1                                                 02560000
DCBMRRD  EQU   DCBMRAPG                                                 02561000
DCBMRCI  EQU   DCBMACR1                                                 02562000
DCBMRMVG EQU   DCBMRCI                                                  02563000
DCBMRLCG EQU   DCBMACR1                                                 02564000
DCBMRABC EQU   DCBMACR1                                                 02565000
DCBMRPT1 EQU   DCBMRABC                                                 02566000
DCBMRSBG EQU   DCBMRPT1                                                 02567000
DCBMRCRL EQU   DCBMACR1                                                 02568000
DCBMRCHK EQU   DCBMRCRL                                                 02569000
DCBMRRDX EQU   DCBMRCHK                                                 02570000
DCBMRDMG EQU   DCBMACR1                                                 02571000
DCBMACR2 EQU   DCBMACR+1                                                02572000
DCBMRPUT EQU   DCBMACR2                                                 02573000
DCBMRWRT EQU   DCBMACR2                                                 02574000
DCBMRMVP EQU   DCBMACR2                                                 02575000
DCBMR5WD EQU   DCBMACR2                                                 02576000
DCBMRLDM EQU   DCBMR5WD                                                 02577000
DCBMRLCP EQU   DCBMRLDM                                                 02578000
DCBMR4WD EQU   DCBMACR2                                                 02579000
DCBMRPT2 EQU   DCBMR4WD                                                 02580000
DCBMRTMD EQU   DCBMRPT2                                                 02581000
DCBMR3WD EQU   DCBMACR2                                                 02582000
DCBMRCTL EQU   DCBMR3WD                                                 02583000
DCBMRSTK EQU   DCBMRCTL                                                 02584000
DCBMR1WD EQU   DCBMACR2                                                 02585000
DCBMRSWA EQU   DCBMR1WD                                                 02586000
DCBMRDMD EQU   DCBMRSWA                                                 02587000
IHADCS25 EQU   0                                                        02588000
DCBMACRF EQU   IHADCS25+2                                               02589000
DCBMACF1 EQU   DCBMACRF                                                 02590000
DCBMFFE  EQU   DCBMACF1                                                 02591000
DCBMFGET EQU   DCBMFFE                                                  02592000
DCBMFAPG EQU   DCBMACF1                                                 02593000
DCBMFRD  EQU   DCBMFAPG                                                 02594000
DCBMFCI  EQU   DCBMACF1                                                 02595000
DCBMFMVG EQU   DCBMFCI                                                  02596000
DCBMFLCG EQU   DCBMACF1                                                 02597000
DCBMFABC EQU   DCBMACF1                                                 02598000
DCBMFPT1 EQU   DCBMFABC                                                 02599000
DCBMFSBG EQU   DCBMFPT1                                                 02600000
DCBMFCRL EQU   DCBMACF1                                                 02601000
DCBMFCHK EQU   DCBMFCRL                                                 02602000
DCBMFDMG EQU   DCBMACF1                                                 02603000
DCBMACF2 EQU   DCBMACRF+1                                               02604000
DCBMFPUT EQU   DCBMACF2                                                 02605000
DCBMFWRT EQU   DCBMACF2                                                 02606000
DCBMFMVP EQU   DCBMACF2                                                 02607000
DCBMF5WD EQU   DCBMACF2                                                 02608000
DCBMFLDM EQU   DCBMF5WD                                                 02609000
DCBMFLCP EQU   DCBMFLDM                                                 02610000
DCBMF4WD EQU   DCBMACF2                                                 02611000
DCBMFPT2 EQU   DCBMF4WD                                                 02612000
DCBMFTMD EQU   DCBMFPT2                                                 02613000
DCBMF3WD EQU   DCBMACF2                                                 02614000
DCBMFCTL EQU   DCBMF3WD                                                 02615000
DCBMFSTK EQU   DCBMFCTL                                                 02616000
DCBMF1WD EQU   DCBMACF2                                                 02617000
DCBMFSWA EQU   DCBMF1WD                                                 02618000
DCBMFDMD EQU   DCBMFSWA                                                 02619000
DCBDEBAD EQU   IHADCS25+4                                               02620000
DCBIFLGS EQU   DCBDEBAD                                                 02621000
DCBIFPCT EQU   DCBIFLGS                                                 02622000
IHADCS26 EQU   0                                                        02623000
DCBWRITE EQU   IHADCS26                                                 02624000
DCBREAD  EQU   DCBWRITE                                                 02625000
DCBWRITA EQU   DCBREAD+1                                                02626000
IHADCS27 EQU   0                                                        02627000
DCBGET   EQU   IHADCS27                                                 02628000
DCBPUT   EQU   DCBGET                                                   02629000
DCBGETA  EQU   DCBPUT+1                                                 02630000
IHADCS36 EQU   0                                                        02631000
DCBGERR  EQU   IHADCS36                                                 02632000
DCBPERR  EQU   DCBGERR                                                  02633000
DCBCHECK EQU   DCBPERR                                                  02634000
DCBOPTCD EQU   DCBCHECK                                                 02635000
DCBOPTH  EQU   DCBOPTCD                                                 02636000
DCBOPTO  EQU   DCBOPTH                                                  02637000
DCBOPTZ  EQU   DCBOPTCD                                                 02638000
DCBGERRA EQU   DCBCHECK+1                                               02639000
DCBPERRA EQU   DCBGERRA                                                 02640000
DCBSYNAD EQU   IHADCS36+4                                               02641000
DCBCIND1 EQU   IHADCS36+8                                               02642000
DCBCIND2 EQU   IHADCS36+9                                               02643000
DCBIOBA  EQU   IHADCS36+16                                              02644000
DCBCICB  EQU   DCBIOBA                                                  02645000
IHADCS52 EQU   0                                                        02646000
DCBDIRCT EQU   IHADCS52                                                 02647000
DCBQSWS  EQU   DCBDIRCT                                                 02648000
DCBUSASI EQU   DCBQSWS                                                  02649000
DCBQADFS EQU   DCBUSASI                                                 02650000
DCBBUFOF EQU   DCBDIRCT+1                                               02651000
IHADCS37 EQU   0                                                        02652000
DCBFLAG1 EQU   IHADCS37                                                 02653000
IHADCS38 EQU   0                                                        02654000
DCBEOBR  EQU   IHADCS38                                                 02655000
DCBPOINT EQU   IHADCS38+12                                              02656000
DCBCNTRL EQU   DCBPOINT                                                 02657000
IHADCS40 EQU   0                                                        02658000
DCBEOBAD EQU   IHADCS40                                                 02659000
DCBCCCW  EQU   IHADCS40+4                                               02660000
DCBRECAD EQU   DCBCCCW                                                  02661000
DCBRECBT EQU   DCBRECAD                                                 02662000
DCBRCREL EQU   DCBRECBT                                                 02663000
@NM00030 EQU   IHADCS40+12                                              02664000
DCBEROPT EQU   @NM00030                                                 02665000
DEBBASIC EQU   0                                                        02666000
DEBTCBAD EQU   DEBBASIC                                                 02667000
DEBDEBAD EQU   DEBBASIC+4                                               02668000
DEBIRBAD EQU   DEBBASIC+8                                               02669000
DEBOFLGS EQU   DEBIRBAD                                                 02670000
DEBOPATB EQU   DEBBASIC+12                                              02671000
DEBFLGS1 EQU   DEBBASIC+14                                              02672000
DEBFLGS2 EQU   DEBBASIC+15                                              02673000
DEBUSRPG EQU   DEBBASIC+16                                              02674000
DEBRRQ   EQU   DEBBASIC+20                                              02675000
DEBECBAD EQU   DEBRRQ                                                   02676000
DEBDCBAD EQU   DEBBASIC+24                                              02677000
DEBPROTG EQU   DEBDCBAD                                                 02678000
DEBAPPAD EQU   DEBBASIC+28                                              02679000
DEBBASND EQU   DEBBASIC+32                                              02680000
DEBDASD  EQU   0                                                        02681000
DEBUCBAD EQU   DEBDASD                                                  02682000
DEBACSMD EQU   0                                                        02683000
DEBVOLSQ EQU   DEBACSMD                                                 02684000
DEBVOLBT EQU   DEBVOLSQ                                                 02685000
DEBDSNM  EQU   DEBACSMD+4                                               02686000
DEBUTSAA EQU   DEBDSNM                                                  02687000
DEBACS01 EQU   0                                                        02688000
DEBDSNAM EQU   DEBACS01                                                 02689000
DEBACS02 EQU   0                                                        02690000
DEBDBLK  EQU   DEBACS02                                                 02691000
DEBACS03 EQU   0                                                        02692000
DEBACS04 EQU   0                                                        02693000
DEBTBFRA EQU   DEBACS04                                                 02694000
DEBTCCWA EQU   DEBACS04+4                                               02695000
DEBACS05 EQU   0                                                        02696000
DEBFUCBA EQU   DEBACS05                                                 02697000
DEBLUCBA EQU   DEBACS05+4                                               02698000
DEBACS06 EQU   0                                                        02699000
DEBACS07 EQU   0                                                        02700000
DEBACS08 EQU   0                                                        02701000
DEBSUBNM EQU   0                                                        02702000
DEB      EQU   0                                                        02703000
DEBAVT   EQU   DEB                                                      02704000
DEBEOEA  EQU   DEBAVT                                                   02705000
DEBEOEAB EQU   DEBEOEA                                                  02706000
DEBSIOA  EQU   DEBAVT+4                                                 02707000
DEBSIOAB EQU   DEBSIOA                                                  02708000
DEBPCIA  EQU   DEBAVT+8                                                 02709000
DEBPCIAB EQU   DEBPCIA                                                  02710000
DEBCEA   EQU   DEBAVT+12                                                02711000
DEBCEAB  EQU   DEBCEA                                                   02712000
DEBXCEA  EQU   DEBAVT+16                                                02713000
DEBXCEAB EQU   DEBXCEA                                                  02714000
DEBPREFX EQU   DEB+20                                                   02715000
DEBXTNP  EQU   DEBPREFX+8                                               02716000
DEBXTN   EQU   0                                                        02717000
DEBXFLG1 EQU   DEBXTN+2                                                 02718000
UCBOB    EQU   0                                                        02719000
UCBJBNR  EQU   UCBOB                                                    02720000
UCBFL5   EQU   UCBOB+1                                                  02721000
UCBAF    EQU   UCBFL5                                                   02722000
UCBSTAT  EQU   UCBOB+3                                                  02723000
UCBCHA   EQU   UCBOB+4                                                  02724000
UCBUA    EQU   UCBOB+5                                                  02725000
UCBFL1   EQU   UCBOB+6                                                  02726000
UCBATI   EQU   UCBOB+11                                                 02727000
@NM00036 EQU   UCBATI                                                   02728000
UCBWGT   EQU   UCBOB+12                                                 02729000
UCBPATH  EQU   UCBWGT                                                   02730000
UCBTYP   EQU   UCBOB+16                                                 02731000
UCBTBYT1 EQU   UCBTYP                                                   02732000
UCB1FEA5 EQU   UCBTBYT1                                                 02733000
UCB1FEA6 EQU   UCBTBYT1                                                 02734000
UCBTBYT2 EQU   UCBTYP+1                                                 02735000
UCB2OPT2 EQU   UCBTBYT2                                                 02736000
UCB2OPT3 EQU   UCBTBYT2                                                 02737000
UCBDUDN2 EQU   UCB2OPT3                                                 02738000
UCB2OPT4 EQU   UCBTBYT2                                                 02739000
UCB2OPT6 EQU   UCBTBYT2                                                 02740000
UCB2OPT7 EQU   UCBTBYT2                                                 02741000
UCBTBYT3 EQU   UCBTYP+2                                                 02742000
UCBDVCLS EQU   UCBTBYT3                                                 02743000
UCBTBYT4 EQU   UCBTYP+3                                                 02744000
UCBSNS   EQU   UCBOB+22                                                 02745000
UCBFL7   EQU   UCBSNS                                                   02746000
UCBDEV   EQU   UCBOB+24                                                 02747000
UCBDCLL  EQU   0                                                        02748000
UCBDCELL EQU   UCBDCLL                                                  02749000
UCBDSTAB EQU   UCBDCELL+2                                               02750000
UCBDSTAT EQU   UCBDCELL+3                                               02751000
UCBDDMCT EQU   UCBDCELL+11                                              02752000
UCBDA    EQU   0                                                        02753000
UCBDA2   EQU   0                                                        02754000
UCBDEXP  EQU   UCBDA2                                                   02755000
UCBRSV55 EQU   UCBDA2+7                                                 02756000
UCBMTPRF EQU   0                                                        02757000
UCBTEXP  EQU   UCBMTPRF                                                 02758000
UCBMT    EQU   0                                                        02759000
UCBTCR   EQU   0                                                        02760000
UCBTCERP EQU   UCBTCR                                                   02761000
UCBOR    EQU   0                                                        02762000
UCBOCR   EQU   0                                                        02763000
UCB3540X EQU   0                                                        02764000
UCB3800X EQU   0                                                        02765000
UCBOPTNS EQU   UCB3800X                                                 02766000
UCBFRMDF EQU   UCB3800X+3                                               02767000
UCBCRIT  EQU   UCB3800X+4                                               02768000
UCBNONCR EQU   UCB3800X+5                                               02769000
UCBACTIV EQU   UCB3800X+6                                               02770000
UCBMDRBF EQU   UCB3800X+36                                              02771000
UCBUCS   EQU   0                                                        02772000
UCBUCSOP EQU   UCBUCS+4                                                 02773000
UCBFCBOP EQU   UCBUCS+5                                                 02774000
UCBERADR EQU   UCBUCS+12                                                02775000
UCBSNINF EQU   0                                                        02776000
UCBSENEX EQU   0                                                        02777000
UCBGSIEX EQU   0                                                        02778000
UCBGSIS  EQU   UCBGSIEX+12                                              02779000
UCBGSISB EQU   UCBGSIS                                                  02780000
UCBM65MP EQU   0                                                        02781000
UCBFL3   EQU   UCBM65MP                                                 02782000
UCBMPFLG EQU   UCBM65MP+3                                               02783000
CVTMAP   EQU   0                                                        02784000
CVTDAR   EQU   CVTMAP+72                                                02785000
CVTFLGS1 EQU   CVTDAR                                                   02786000
CVTDCB   EQU   CVTMAP+116                                               02787000
CVTIERLC EQU   CVTMAP+144                                               02788000
CVTOPTA  EQU   CVTMAP+182                                               02789000
CVTOPTB  EQU   CVTMAP+183                                               02790000
CVTGTF   EQU   CVTMAP+236                                               02791000
CVTGTFST EQU   CVTGTF                                                   02792000
CVTGTFS  EQU   CVTGTFST                                                 02793000
CVTSTATE EQU   CVTGTFST                                                 02794000
CVTTMODE EQU   CVTGTFST                                                 02795000
CVTFORM  EQU   CVTGTFST                                                 02796000
CVTAQAVT EQU   CVTMAP+240                                               02797000
CVTTCMFG EQU   CVTAQAVT                                                 02798000
CVTVOLM2 EQU   CVTMAP+244                                               02799000
CVTTATA  EQU   CVTVOLM2                                                 02800000
CVTTSKS  EQU   CVTTATA                                                  02801000
CVTVOLF2 EQU   CVTTSKS                                                  02802000
CVTTAT   EQU   CVTTATA+1                                                02803000
CVTATER  EQU   CVTMAP+248                                               02804000
CVTEXT1  EQU   CVTMAP+252                                               02805000
CVTPURG  EQU   CVTMAP+260                                               02806000
CVTQMSG  EQU   CVTMAP+268                                               02807000
CVTDMSR  EQU   CVTMAP+272                                               02808000
CVTRSV37 EQU   CVTDMSR                                                  02809000
CVTDMSRF EQU   CVTRSV37                                                 02810000
CVTERPV  EQU   CVTMAP+316                                               02811000
CVTINTLA EQU   CVTMAP+320                                               02812000
CVTAPF   EQU   CVTMAP+324                                               02813000
CVTEXT2  EQU   CVTMAP+328                                               02814000
CVTHJES  EQU   CVTMAP+332                                               02815000
CVTA1F1  EQU   CVTMAP+356                                               02816000
CVTSYSK  EQU   CVTMAP+357                                               02817000
CVTVOLM1 EQU   CVTMAP+380                                               02818000
CVTVOLF1 EQU   CVTVOLM1                                                 02819000
CVTXTNT1 EQU   0                                                        02820000
CVTXTNT2 EQU   0                                                        02821000
CVTDSSV  EQU   CVTXTNT2                                                 02822000
CVTFLGBT EQU   CVTXTNT2+5                                               02823000
CVTQID   EQU   CVTXTNT2+24                                              02824000
CVTICB   EQU   CVTXTNT2+48                                              02825000
CVTRV400 EQU   CVTXTNT2+52                                              02826000
CVTRV409 EQU   CVTXTNT2+53                                              02827000
CVTATCVT EQU   CVTXTNT2+64                                              02828000
CVTRV429 EQU   CVTXTNT2+84                                              02829000
CVTRV438 EQU   CVTXTNT2+85                                              02830000
CVTRV457 EQU   CVTXTNT2+112                                             02831000
CVTRV466 EQU   CVTXTNT2+113                                             02832000
CVTFIX   EQU   0                                                        02833000
CVTRELNO EQU   CVTFIX+252                                               02834000
ICBSS1CB EQU   0                                                        02835000
ICBPUCB  EQU   ICBSS1CB+32                                              02836000
ICBFLG   EQU   ICBSS1CB+56                                              02837000
ICBFG1   EQU   ICBFLG                                                   02838000
ICBI     EQU   ICBFG1                                                   02839000
ICBMSG   EQU   ICBSS1CB+88                                              02840000
ICBVVRB  EQU   ICBSS1CB+120                                             02841000
ICBTRACE EQU   ICBSS1CB+312                                             02842000
OSMSCOMM EQU   0                                                        02843000
MSSSER   EQU   OSMSCOMM                                                 02844000
MSSVUA   EQU   OSMSCOMM+6                                               02845000
MSSFLAG1 EQU   OSMSCOMM+36                                              02846000
MOUNT    EQU   MSSFLAG1                                                 02847000
DEMOUNT  EQU   MSSFLAG1                                                 02848000
RELINQSH EQU   MSSFLAG1                                                 02849000
MSSERR   EQU   MSSFLAG1                                                 02850000
MSSFLAG2 EQU   OSMSCOMM+37                                              02851000
MSSRETRY EQU   MSSFLAG2                                                 02852000
SHRDVUA  EQU   MSSFLAG2                                                 02853000
MSSRC    EQU   OSMSCOMM+38                                              02854000
MSSSDG   EQU   OSMSCOMM+40                                              02855000
MSSFLAG3 EQU   OSMSCOMM+41                                              02856000
MVTBL    EQU   0                                                        02857000
MVOLNDX  EQU   MVTBL+44                                                 02858000
MNTFLG   EQU   MVTBL+268                                                02859000
VOLMTD   EQU   MNTFLG                                                   02860000
VOLMTDXC EQU   MNTFLG                                                   02861000
SDGNDX   EQU   MVTBL+271                                                02862000
CONFIGTB EQU   0                                                        02863000
CONFIGA  EQU   CONFIGTB+256                                             02864000
BYTE1    EQU   CONFIGA                                                  02865000
BIT1     EQU   BYTE1                                                    02866000
BYTE2    EQU   CONFIGA+1                                                02867000
MFGID    EQU   CONFIGTB+384                                             02868000
MFGCPUID EQU   MFGID                                                    02869000
CONFIGDB EQU   0                                                        02870000
CONFIGB  EQU   CONFIGDB+256                                             02871000
STATUS   EQU   CONFIGB                                                  02872000
CONFSHR  EQU   STATUS                                                   02873000
MSSTBL   EQU   0                                                        02874000
CNTVUA   EQU   MSSTBL                                                   02875000
VUATBL   EQU   MSSTBL+4                                                 02876000
VUA1     EQU   VUATBL                                                   02877000
VUA2     EQU   VUATBL+1                                                 02878000
STAT     EQU   VUATBL+2                                                 02879000
SHRD     EQU   STAT                                                     02880000
NUMSDG   EQU   VUATBL+3                                                 02881000
OPCODE   EQU   0                                                        02882000
DEBBAS02 EQU   DEBBASND                                                 02883000
DEBDDS1  EQU   DEBBAS02                                                 02884000
DEBSUCBA EQU   DEBDDS1                                                  02885000
DEBDEVED EQU   DEBDDS1+4                                                02886000
DEBRDCB  EQU   DEBDDS1+4                                                02887000
DEBPDCB  EQU   DEBDDS1+8                                                02888000
DEBWDCB  EQU   DEBDDS1+12                                               02889000
DEBACS09 EQU   DEBDEVED                                                 02890000
DEBASC09 EQU   DEBACS09                                                 02891000
DEBEAMFG EQU   DEBASC09+3                                               02892000
DEBDSID  EQU   DEBASC09+4                                               02893000
DEBEOD   EQU   DEBASC09+12                                              02894000
DEBBOE   EQU   DEBEOD                                                   02895000
DEBEODRV EQU   DEBBOE                                                   02896000
DEBEODTT EQU   DEBBOE+1                                                 02897000
DEBEOD0  EQU   DEBBOE+2                                                 02898000
DEBEODSS EQU   DEBBOE+3                                                 02899000
DEBBAS01 EQU   DEBBASND                                                 02900000
DEBISAM  EQU   DEBBAS01                                                 02901000
DEBFIEAD EQU   DEBISAM                                                  02902000
DEBFPEAD EQU   DEBISAM+4                                                02903000
DEBFOEAD EQU   DEBISAM+8                                                02904000
DEBEXPT  EQU   DEBISAM+12                                               02905000
DEBRPSID EQU   DEBEXPT                                                  02906000
UCBOBS01 EQU   UCBDEV                                                   02907000
UCBSENSE EQU   UCBOBS01                                                 02908000
UCBSENSB EQU   UCBSENSE                                                 02909000
UCBSTAB  EQU   UCBOBS01+10                                              02910000
UCBBSVL  EQU   UCBSTAB                                                  02911000
UCBPRSRS EQU   UCBSTAB                                                  02912000
UCBDMCT  EQU   UCBOBS01+11                                              02913000
UCBVTOC  EQU   UCBOBS01+12                                              02914000
UCBFSER  EQU   UCBOBS01+16                                              02915000
UCBORSVA EQU   UCBFSER+4                                                02916000
UCBFL4   EQU   UCBORSVA                                                 02917000
UCBDAV   EQU   UCBFL4                                                   02918000
UCBORSVB EQU   UCBORSVA+1                                               02919000
UCBTFL1  EQU   UCBORSVB+1                                               02920000
UCBSKA   EQU   UCBOBS01+24                                              02921000
UCBXTN   EQU   UCBSKA                                                   02922000
UCBVOPT  EQU   UCBXTN                                                   02923000
UCBEXTN  EQU   UCBOBS01+32                                              02924000
UCBEXT   EQU   UCBOBS01+36                                              02925000
UCBFL6   EQU   UCBEXT                                                   02926000
UCBOBS02 EQU   UCBDEV                                                   02927000
UCBCELLS EQU   UCBOBS02+32                                              02928000
UCBOBS03 EQU   UCBDEV                                                   02929000
UCBSNADR EQU   UCBOBS03+1                                               02930000
UCBXTADR EQU   UCBOBS03+4                                               02931000
UCBOBS04 EQU   UCBDEV                                                   02932000
UCBBTA   EQU   UCBOBS04+12                                              02933000
UCBOBS06 EQU   UCBDEV                                                   02934000
UCBAOF   EQU   UCBOBS06                                                 02935000
UCBAOF1  EQU   UCBAOF                                                   02936000
UCBAOF2  EQU   UCBAOF+1                                                 02937000
@NM00037 EQU   UCBOBS06+3                                               02938000
UCBIRB   EQU   UCBOBS06+4                                               02939000
UCBGRAF  EQU   UCBIRB                                                   02940000
UCBLDNCA EQU   UCBOBS06+8                                               02941000
UCBRDYQ  EQU   UCBLDNCA                                                 02942000
UCBIRLN  EQU   UCBRDYQ                                                  02943000
UCBLDNCB EQU   UCBRDYQ+1                                                02944000
UCBCTLNK EQU   UCBOBS06+12                                              02945000
UCBOBS05 EQU   UCBDEV                                                   02946000
UCBCRWKA EQU   UCBOBS05                                                 02947000
UCBOBS07 EQU   UCBDEV                                                   02948000
UCBRV040 EQU   UCBOBS07                                                 02949000
UCBOBS08 EQU   UCBDEV                                                   02950000
UCBCCPM  EQU   UCBOBS08                                                 02951000
UCBCCFLG EQU   UCBCCPM                                                  02952000
UCBOBS09 EQU   UCBDEV                                                   02953000
UCBGSIXT EQU   UCBOBS09                                                 02954000
PSARSVTE EQU   PSARSVT                                                  02955000
MSSECBAD EQU   UCBRV040                                                 02956000
QWPARM   EQU   QUPARM                                                   02957000
QWRES1   EQU   QWPARM                                                   02958000
QWFLAG   EQU   QWPARM+2                                                 02959000
QTPARM   EQU   QUPARM                                                   02960000
QTID     EQU   QTPARM                                                   02961000
QTDASCHR EQU   QTPARM+20                                                02962000
QLPARM   EQU   QUPARM                                                   02963000
QCPARM   EQU   QUPARM                                                   02964000
ARFLAG   EQU   ARFLG                                                    02965000
ARLEN    EQU   ARLL                                                     02966000
ARNMEXTS EQU   ARNMEXT                                                  02967000
FLC      EQU   PSA                                                      02968000
*                                      START UNREFERENCED COMPONENTS    02969000
QCMAD3Z1 EQU   QCPARM+28                                                02970000
QCMAD3Z0 EQU   QCPARM+24                                                02971000
QCMAD2Z1 EQU   QCPARM+20                                                02972000
QCMAD2Z0 EQU   QCPARM+16                                                02973000
QCMAD1Z1 EQU   QCPARM+12                                                02974000
QCMAD1Z0 EQU   QCPARM+8                                                 02975000
QCMAD0Z1 EQU   QCPARM+4                                                 02976000
QCMAD0Z0 EQU   QCPARM                                                   02977000
QLRES    EQU   QLPARM+2                                                 02978000
QLZYX    EQU   QLPARM                                                   02979000
QTRES    EQU   QTPARM+24                                                02980000
QTDATA   EQU   QTPARM+2                                                 02981000
QTFLAG   EQU   QTPARM+1                                                 02982000
QTTABID  EQU   QTID                                                     02983000
QWRES2   EQU   QWPARM+3                                                 02984000
QWALTMSC EQU   QWFLAG                                                   02985000
@NM00096 EQU   QWFLAG                                                   02986000
QWMEM    EQU   QWFLAG                                                   02987000
QWSSID   EQU   QWRES1                                                   02988000
PSARSAV  EQU   PSARSVTE+60                                              02989000
PSARSTK  EQU   PSARSVTE+56                                              02990000
PSAESAV3 EQU   PSARSVTE+52                                              02991000
PSAESTK3 EQU   PSARSVTE+48                                              02992000
PSAESAV2 EQU   PSARSVTE+44                                              02993000
PSAESTK2 EQU   PSARSVTE+40                                              02994000
PSAESAV1 EQU   PSARSVTE+36                                              02995000
PSAESTK1 EQU   PSARSVTE+32                                              02996000
PSAPSAV  EQU   PSARSVTE+28                                              02997000
PSAPSTK  EQU   PSARSVTE+24                                              02998000
PSAMSAV  EQU   PSARSVTE+20                                              02999000
PSAMSTK  EQU   PSARSVTE+16                                              03000000
PSASSAV  EQU   PSARSVTE+12                                              03001000
PSASSTK  EQU   PSARSVTE+8                                               03002000
PSANSTK  EQU   PSARSVTE+4                                               03003000
PSACSTK  EQU   PSARSVTE                                                 03004000
UCBCCCSW EQU   UCBOBS08+4                                               03005000
UCBCCPMA EQU   UCBCCPM+1                                                03006000
UCBRV087 EQU   UCBCCFLG                                                 03007000
UCBRV086 EQU   UCBCCFLG                                                 03008000
UCBRV085 EQU   UCBCCFLG                                                 03009000
UCBRV084 EQU   UCBCCFLG                                                 03010000
UCBRV083 EQU   UCBCCFLG                                                 03011000
UCBRV082 EQU   UCBCCFLG                                                 03012000
UCBCCERR EQU   UCBCCFLG                                                 03013000
UCBCCATN EQU   UCBCCFLG                                                 03014000
UCBICNCB EQU   UCBOBS07+4                                               03015000
UCBCTLNA EQU   UCBCTLNK+1                                               03016000
UCBRLN   EQU   UCBCTLNK                                                 03017000
UCBRDYQA EQU   UCBLDNCB                                                 03018000
UCBINRLN EQU   UCBIRLN                                                  03019000
UCBIRBA  EQU   UCBIRB+1                                                 03020000
UCBRV039 EQU   UCBGRAF                                                  03021000
UCBDWNR  EQU   UCBGRAF                                                  03022000
UCBRPND  EQU   UCBGRAF                                                  03023000
UCBUPM   EQU   UCBGRAF                                                  03024000
UCBBTAM  EQU   UCBGRAF                                                  03025000
UCBDRNO  EQU   UCBGRAF                                                  03026000
UCBDRO   EQU   UCBGRAF                                                  03027000
UCBOIP   EQU   UCBGRAF                                                  03028000
UCBATRCD EQU   @NM00037                                                 03029000
UCBSKPFG EQU   @NM00037                                                 03030000
UCBRIPND EQU   @NM00037                                                 03031000
UCBRTIAC EQU   @NM00037                                                 03032000
UCBRSV79 EQU   @NM00037                                                 03033000
UCBRSV78 EQU   @NM00037                                                 03034000
UCBRSV77 EQU   @NM00037                                                 03035000
UCBOLTEP EQU   @NM00037                                                 03036000
UCBATNCT EQU   UCBOBS06+2                                               03037000
UCBRSV76 EQU   UCBAOF2                                                  03038000
UCBRSV75 EQU   UCBAOF2                                                  03039000
UCBRSV74 EQU   UCBAOF2                                                  03040000
UCBRSV73 EQU   UCBAOF2                                                  03041000
UCBRSV72 EQU   UCBAOF2                                                  03042000
UCBRSV71 EQU   UCBAOF2                                                  03043000
UCBRSV70 EQU   UCBAOF2                                                  03044000
UCBRSV69 EQU   UCBAOF2                                                  03045000
UCBRSV68 EQU   UCBAOF1                                                  03046000
UCBRSV67 EQU   UCBAOF1                                                  03047000
UCBRSV66 EQU   UCBAOF1                                                  03048000
UCBRSV65 EQU   UCBAOF1                                                  03049000
UCBOFPTR EQU   UCBAOF1                                                  03050000
UCBOFNL  EQU   UCBAOF1                                                  03051000
UCBOFSP  EQU   UCBAOF1                                                  03052000
UCBOFMCR EQU   UCBAOF1                                                  03053000
UCBBTB   EQU   UCBBTA+1                                                 03054000
UCBDI    EQU   UCBBTA                                                   03055000
UCBSTART EQU   UCBOBS04+8                                               03056000
UCBTEB   EQU   UCBOBS04+4                                               03057000
UCBGCB   EQU   UCBOBS04+3                                               03058000
UCBOPEN  EQU   UCBOBS04+2                                               03059000
UCBSENS  EQU   UCBOBS04                                                 03060000
UCBNBRSN EQU   UCBOBS03                                                 03061000
UCBDC    EQU   UCBOBS02+192                                             03062000
UCBCELL9 EQU   UCBCELLS+144                                             03063000
UCBCELL8 EQU   UCBCELLS+128                                             03064000
UCBCELL7 EQU   UCBCELLS+112                                             03065000
UCBCELL6 EQU   UCBCELLS+96                                              03066000
UCBCELL5 EQU   UCBCELLS+80                                              03067000
UCBCELL4 EQU   UCBCELLS+64                                              03068000
UCBCELL3 EQU   UCBCELLS+48                                              03069000
UCBCELL2 EQU   UCBCELLS+32                                              03070000
UCBCELL1 EQU   UCBCELLS+16                                              03071000
UCBCELL0 EQU   UCBCELLS                                                 03072000
UCBDASD  EQU   UCBOBS02+16                                              03073000
UCBERPA  EQU   UCBOBS02+4                                               03074000
UCBSEN   EQU   UCBOBS02                                                 03075000
UCBEXTA  EQU   UCBEXT+1                                                 03076000
UCBRSV28 EQU   UCBFL6                                                   03077000
UCBRSV27 EQU   UCBFL6                                                   03078000
UCBRSV26 EQU   UCBFL6                                                   03079000
UCBRSV25 EQU   UCBFL6                                                   03080000
UCBRSV24 EQU   UCBFL6                                                   03081000
UCBRSV23 EQU   UCBFL6                                                   03082000
UCBRSV22 EQU   UCBFL6                                                   03083000
UCBDSS   EQU   UCBFL6                                                   03084000
UCBEXTNA EQU   UCBEXTN+1                                                03085000
UCBUSER  EQU   UCBEXTN                                                  03086000
UCBXTNB  EQU   UCBXTN+1                                                 03087000
UCBASNDE EQU   UCBVOPT                                                  03088000
UCBRSV21 EQU   UCBVOPT                                                  03089000
UCBRSV20 EQU   UCBVOPT                                                  03090000
UCBESVE  EQU   UCBVOPT                                                  03091000
UCBERPC  EQU   UCBVOPT                                                  03092000
UCBESVC  EQU   UCBVOPT                                                  03093000
UCBEVA   EQU   UCBVOPT                                                  03094000
UCBESV   EQU   UCBVOPT                                                  03095000
UCBRV010 EQU   UCBORSVB+2                                               03096000
UCBRV009 EQU   UCBTFL1                                                  03097000
UCBRV008 EQU   UCBTFL1                                                  03098000
UCBRV007 EQU   UCBTFL1                                                  03099000
UCBRV006 EQU   UCBTFL1                                                  03100000
UCBRV005 EQU   UCBTFL1                                                  03101000
UCBNSRCH EQU   UCBTFL1                                                  03102000
UCBNSLTP EQU   UCBTFL1                                                  03103000
UCBNLTP  EQU   UCBTFL1                                                  03104000
UCBRV004 EQU   UCBORSVB                                                 03105000
UCBORCNT EQU   UCBFL4                                                   03106000
UCBVER   EQU   UCBDAV                                                   03107000
UCBTCC   EQU   UCBDAV                                                   03108000
UCBFT    EQU   UCBDAV                                                   03109000
UCBVVRTN EQU   UCBDAV                                                   03110000
UCBMNT   EQU   UCBDAV                                                   03111000
UCBRQESV EQU   UCBFSER+2                                                03112000
UCBDVRES EQU   UCBFSER+1                                                03113000
UCBSQC   EQU   UCBFSER                                                  03114000
UCBFSEQ  EQU   UCBVTOC+2                                                03115000
UCBFSCT  EQU   UCBVTOC                                                  03116000
UCBDMC   EQU   UCBDMCT                                                  03117000
UCBMOUNT EQU   UCBDMCT                                                  03118000
UCBBNUL  EQU   UCBSTAB                                                  03119000
UCBBJLB  EQU   UCBSTAB                                                  03120000
UCBBSTR  EQU   UCBSTAB                                                  03121000
UCBBPUB  EQU   UCBSTAB                                                  03122000
UCBBPRV  EQU   UCBSTAB                                                  03123000
UCBBALB  EQU   UCBPRSRS                                                 03124000
UCBPGFL  EQU   UCBSTAB                                                  03125000
UCBDVSHR EQU   UCBBSVL                                                  03126000
UCBVOLI  EQU   UCBOBS01+4                                               03127000
UCBSENSA EQU   UCBSENSB+1                                               03128000
UCBSENSN EQU   UCBSENSB                                                 03129000
DEBEXPTA EQU   DEBEXPT+1                                                03130000
DEBRSV12 EQU   DEBRPSID                                                 03131000
DEBRSV11 EQU   DEBRPSID                                                 03132000
DEBRSV10 EQU   DEBRPSID                                                 03133000
DEBRSV09 EQU   DEBRPSID                                                 03134000
DEBRPSAP EQU   DEBRPSID                                                 03135000
DEBRPSO  EQU   DEBRPSID                                                 03136000
DEBRPSI  EQU   DEBRPSID                                                 03137000
DEBRPSP  EQU   DEBRPSID                                                 03138000
DEBFOEB  EQU   DEBFOEAD+1                                               03139000
DEBNOEE  EQU   DEBFOEAD                                                 03140000
DEBFPEB  EQU   DEBFPEAD+1                                               03141000
DEBNPEE  EQU   DEBFPEAD                                                 03142000
DEBFIEB  EQU   DEBFIEAD+1                                               03143000
DEBNIEE  EQU   DEBFIEAD                                                 03144000
DEBBOESS EQU   DEBEODSS                                                 03145000
DEBBOE0  EQU   DEBEOD0                                                  03146000
DEBBOETT EQU   DEBEODTT                                                 03147000
DEBBOERV EQU   DEBEODRV                                                 03148000
DEBRV008 EQU   DEBDSID+7                                                03149000
DEBWTPTI EQU   DEBDSID+6                                                03150000
DEBEXDTE EQU   DEBDSID                                                  03151000
DEBRV007 EQU   DEBEAMFG                                                 03152000
DEBRV006 EQU   DEBEAMFG                                                 03153000
DEBRV005 EQU   DEBEAMFG                                                 03154000
DEBRV004 EQU   DEBEAMFG                                                 03155000
DEBSECVL EQU   DEBEAMFG                                                 03156000
DEBVAMSG EQU   DEBEAMFG                                                 03157000
DEBDSOPN EQU   DEBEAMFG                                                 03158000
DEBMULTI EQU   DEBEAMFG                                                 03159000
DEBVSEQU EQU   DEBASC09+2                                               03160000
DEBDSSQL EQU   DEBASC09+1                                               03161000
DEBVOLAC EQU   DEBASC09                                                 03162000
DEBWDCBA EQU   DEBWDCB+1                                                03163000
DEBRSV08 EQU   DEBWDCB                                                  03164000
DEBPDCBA EQU   DEBPDCB+1                                                03165000
DEBRSV07 EQU   DEBPDCB                                                  03166000
DEBRDCBA EQU   DEBRDCB+1                                                03167000
DEBRSV06 EQU   DEBRDCB                                                  03168000
DEBSUCBB EQU   DEBSUCBA+1                                               03169000
DEBSDVM  EQU   DEBSUCBA                                                 03170000
SDGNUM   EQU   NUMSDG                                                   03171000
@NM00105 EQU   NUMSDG                                                   03172000
@NM00104 EQU   STAT                                                     03173000
DV       EQU   VUA2                                                     03174000
CU       EQU   VUA2                                                     03175000
CH       EQU   VUA1                                                     03176000
ZEROS    EQU   VUA1                                                     03177000
@NM00103 EQU   CONFIGB+1                                                03178000
CONFSDG  EQU   STATUS                                                   03179000
@NM00102 EQU   STATUS                                                   03180000
@NM00101 EQU   CONFIGDB                                                 03181000
@NM00100 EQU   MFGID+5                                                  03182000
CHANNEL  EQU   BYTE2                                                    03183000
@NM00099 EQU   BYTE2                                                    03184000
CTLUNIT  EQU   BYTE2                                                    03185000
@NM00098 EQU   BYTE1                                                    03186000
@NM00097 EQU   CONFIGTB                                                 03187000
@NM00095 EQU   MVTBL+272                                                03188000
@NM00094 EQU   MVTBL+269                                                03189000
@NM00093 EQU   MNTFLG                                                   03190000
@NM00092 EQU   MVTBL+45                                                 03191000
@NM00091 EQU   MVTBL                                                    03192000
MSSMSER  EQU   OSMSCOMM+42                                              03193000
@NM00081 EQU   MSSFLAG3                                                 03194000
MSSRC10  EQU   MSSFLAG3                                                 03195000
@NM00080 EQU   MSSFLAG2                                                 03196000
MSSIGNOR EQU   MSSFLAG2                                                 03197000
MSGPROC  EQU   MSSFLAG2                                                 03198000
INPROC   EQU   MSSFLAG2                                                 03199000
MQENT    EQU   MSSFLAG2                                                 03200000
RQENT    EQU   MSSFLAG2                                                 03201000
@NM00079 EQU   MSSFLAG1                                                 03202000
INUSE    EQU   MSSFLAG1                                                 03203000
@NM00078 EQU   MSSFLAG1                                                 03204000
MSSUSER  EQU   OSMSCOMM+28                                              03205000
MSSNEXT  EQU   OSMSCOMM+24                                              03206000
MSSTASK3 EQU   OSMSCOMM+20                                              03207000
MSSTASK2 EQU   OSMSCOMM+16                                              03208000
MSSTASK1 EQU   OSMSCOMM+12                                              03209000
MSSTASKD EQU   OSMSCOMM+8                                               03210000
ICBLORD  EQU   ICBTRACE+256                                             03211000
ICBOTRC  EQU   ICBTRACE                                                 03212000
ICBEWA   EQU   ICBSS1CB+152                                             03213000
ICBVTCB  EQU   ICBVVRB+28                                               03214000
ICBVL    EQU   ICBVVRB+24                                               03215000
ICBVIC   EQU   ICBVVRB+20                                               03216000
ICBVPSW  EQU   ICBVVRB+16                                               03217000
ICBVEP   EQU   ICBVVRB+12                                               03218000
ICBVFG   EQU   ICBVVRB+10                                               03219000
ICBVSZ   EQU   ICBVVRB+8                                                03220000
ICBVNME  EQU   ICBVVRB                                                  03221000
ICBRBTCB EQU   ICBMSG+28                                                03222000
ICBRBL   EQU   ICBMSG+24                                                03223000
ICBRBIC  EQU   ICBMSG+20                                                03224000
ICBRBPSW EQU   ICBMSG+16                                                03225000
ICBRBEP  EQU   ICBMSG+12                                                03226000
ICBRBFG  EQU   ICBMSG+10                                                03227000
ICBRBSZ  EQU   ICBMSG+8                                                 03228000
ICBRBNME EQU   ICBMSG                                                   03229000
ICBMSECB EQU   ICBSS1CB+84                                              03230000
ICBVECB  EQU   ICBSS1CB+80                                              03231000
ICBMSSC  EQU   ICBSS1CB+76                                              03232000
ICBMEP   EQU   ICBSS1CB+72                                              03233000
ICBVVICB EQU   ICBSS1CB+68                                              03234000
ICBVVIC  EQU   ICBSS1CB+64                                              03235000
ICBACTPT EQU   ICBSS1CB+60                                              03236000
ICBSAMP  EQU   ICBFLG+2                                                 03237000
ICBFG2   EQU   ICBFLG+1                                                 03238000
ICBENT   EQU   ICBFG1                                                   03239000
ICBS     EQU   ICBFG1                                                   03240000
ICBB     EQU   ICBFG1                                                   03241000
ICBVHI   EQU   ICBFG1                                                   03242000
ICBMSI   EQU   ICBFG1                                                   03243000
ICBV     EQU   ICBFG1                                                   03244000
ICBR     EQU   ICBFG1                                                   03245000
ICBOPT   EQU   ICBSS1CB+52                                              03246000
ICBABEND EQU   ICBSS1CB+48                                              03247000
ICBTCB   EQU   ICBSS1CB+44                                              03248000
ICBQHEAD EQU   ICBSS1CB+40                                              03249000
ICBAUCB  EQU   ICBSS1CB+36                                              03250000
ICBDUMAA EQU   ICBSS1CB+28                                              03251000
ICBAEAA  EQU   ICBSS1CB+24                                              03252000
ICBSIOA  EQU   ICBSS1CB+20                                              03253000
ICBCOMQ  EQU   ICBSS1CB+16                                              03254000
ICBCOM   EQU   ICBSS1CB+12                                              03255000
ICBACTV  EQU   ICBSS1CB+8                                               03256000
ICBERP   EQU   ICBSS1CB+4                                               03257000
ICBECB   EQU   ICBSS1CB                                                 03258000
CVTLEVL  EQU   CVTRELNO+2                                               03259000
CVTNUMB  EQU   CVTRELNO                                                 03260000
CVTMDL   EQU   CVTFIX+250                                               03261000
@NM00051 EQU   CVTFIX+248                                               03262000
@NM00050 EQU   CVTFIX                                                   03263000
CVTRV482 EQU   CVTXTNT2+128                                             03264000
CVTRV481 EQU   CVTXTNT2+124                                             03265000
CVTRV480 EQU   CVTXTNT2+120                                             03266000
CVTRV479 EQU   CVTXTNT2+118                                             03267000
CVTRV478 EQU   CVTXTNT2+117                                             03268000
CVTRV477 EQU   CVTXTNT2+116                                             03269000
CVTRV476 EQU   CVTXTNT2+115                                             03270000
CVTRV475 EQU   CVTXTNT2+114                                             03271000
CVTRV474 EQU   CVTRV466                                                 03272000
CVTRV473 EQU   CVTRV466                                                 03273000
CVTRV472 EQU   CVTRV466                                                 03274000
CVTRV471 EQU   CVTRV466                                                 03275000
CVTRV470 EQU   CVTRV466                                                 03276000
CVTRV469 EQU   CVTRV466                                                 03277000
CVTRV468 EQU   CVTRV466                                                 03278000
CVTRV467 EQU   CVTRV466                                                 03279000
CVTRV465 EQU   CVTRV457                                                 03280000
CVTRV464 EQU   CVTRV457                                                 03281000
CVTRV463 EQU   CVTRV457                                                 03282000
CVTRV462 EQU   CVTRV457                                                 03283000
CVTRV461 EQU   CVTRV457                                                 03284000
CVTRV460 EQU   CVTRV457                                                 03285000
CVTRV459 EQU   CVTRV457                                                 03286000
CVTRV458 EQU   CVTRV457                                                 03287000
CVTRV456 EQU   CVTXTNT2+108                                             03288000
CVTRV455 EQU   CVTXTNT2+104                                             03289000
CVTRV454 EQU   CVTXTNT2+100                                             03290000
CVTRV453 EQU   CVTXTNT2+96                                              03291000
CVTRV452 EQU   CVTXTNT2+94                                              03292000
CVTRV451 EQU   CVTXTNT2+92                                              03293000
CVTRV450 EQU   CVTXTNT2+90                                              03294000
CVTRV449 EQU   CVTXTNT2+88                                              03295000
CVTRV448 EQU   CVTXTNT2+87                                              03296000
CVTRV447 EQU   CVTXTNT2+86                                              03297000
CVTRV446 EQU   CVTRV438                                                 03298000
CVTRV445 EQU   CVTRV438                                                 03299000
CVTRV444 EQU   CVTRV438                                                 03300000
CVTRV443 EQU   CVTRV438                                                 03301000
CVTRV442 EQU   CVTRV438                                                 03302000
CVTRV441 EQU   CVTRV438                                                 03303000
CVTRV440 EQU   CVTRV438                                                 03304000
CVTRV439 EQU   CVTRV438                                                 03305000
CVTRV437 EQU   CVTRV429                                                 03306000
CVTRV436 EQU   CVTRV429                                                 03307000
CVTRV435 EQU   CVTRV429                                                 03308000
CVTRV434 EQU   CVTRV429                                                 03309000
CVTRV433 EQU   CVTRV429                                                 03310000
CVTRV432 EQU   CVTRV429                                                 03311000
CVTRV431 EQU   CVTRV429                                                 03312000
CVTRV430 EQU   CVTRV429                                                 03313000
CVTRV428 EQU   CVTXTNT2+80                                              03314000
CVTRV427 EQU   CVTXTNT2+76                                              03315000
CVTRV426 EQU   CVTXTNT2+72                                              03316000
CVTRV425 EQU   CVTXTNT2+68                                              03317000
CVTATACT EQU   CVTATCVT                                                 03318000
CVTRV423 EQU   CVTXTNT2+62                                              03319000
CVTRV422 EQU   CVTXTNT2+60                                              03320000
CVTRV421 EQU   CVTXTNT2+58                                              03321000
CVTRV420 EQU   CVTXTNT2+56                                              03322000
CVTRV419 EQU   CVTXTNT2+55                                              03323000
CVTRV418 EQU   CVTXTNT2+54                                              03324000
CVTRV417 EQU   CVTRV409                                                 03325000
CVTRV416 EQU   CVTRV409                                                 03326000
CVTRV415 EQU   CVTRV409                                                 03327000
CVTRV414 EQU   CVTRV409                                                 03328000
CVTRV413 EQU   CVTRV409                                                 03329000
CVTRV412 EQU   CVTRV409                                                 03330000
CVTRV411 EQU   CVTRV409                                                 03331000
CVTRV410 EQU   CVTRV409                                                 03332000
CVTRV408 EQU   CVTRV400                                                 03333000
CVTRV407 EQU   CVTRV400                                                 03334000
CVTRV406 EQU   CVTRV400                                                 03335000
CVTRV405 EQU   CVTRV400                                                 03336000
CVTRV404 EQU   CVTRV400                                                 03337000
CVTRV403 EQU   CVTRV400                                                 03338000
CVTRV402 EQU   CVTRV400                                                 03339000
CVTRV401 EQU   CVTRV400                                                 03340000
CVTSKTA  EQU   CVTXTNT2+44                                              03341000
CVTCCVT  EQU   CVTXTNT2+40                                              03342000
CVTRSV98 EQU   CVTXTNT2+36                                              03343000
CVTRSV97 EQU   CVTXTNT2+34                                              03344000
CVTRSV96 EQU   CVTXTNT2+32                                              03345000
CVTOLTEP EQU   CVTXTNT2+28                                              03346000
CVTQIDA  EQU   CVTQID+1                                                 03347000
CVTRSV95 EQU   CVTQID                                                   03348000
CVTRSV94 EQU   CVTXTNT2+20                                              03349000
CVTRSV93 EQU   CVTXTNT2+16                                              03350000
CVTRSV92 EQU   CVTXTNT2+12                                              03351000
CVTDEBVR EQU   CVTXTNT2+8                                               03352000
CVTRSV91 EQU   CVTXTNT2+6                                               03353000
CVTRSV9H EQU   CVTFLGBT                                                 03354000
CVTRSV9G EQU   CVTFLGBT                                                 03355000
CVTRSV9F EQU   CVTFLGBT                                                 03356000
CVTRSV9E EQU   CVTFLGBT                                                 03357000
CVTRSV9D EQU   CVTFLGBT                                                 03358000
CVTBAH   EQU   CVTFLGBT                                                 03359000
CVTVME   EQU   CVTFLGBT                                                 03360000
CVTNPE   EQU   CVTFLGBT                                                 03361000
CVTNUCLS EQU   CVTXTNT2+4                                               03362000
CVTDSSVA EQU   CVTDSSV+1                                                03363000
CVTRSV89 EQU   CVTDSSV                                                  03364000
CVTRSV88 EQU   CVTXTNT1+8                                               03365000
CVTRSV87 EQU   CVTXTNT1+4                                               03366000
CVTFACHN EQU   CVTXTNT1                                                 03367000
CVTRV488 EQU   CVTMAP+412                                               03368000
CVTRV487 EQU   CVTMAP+408                                               03369000
CVTRV486 EQU   CVTMAP+404                                               03370000
CVTRV485 EQU   CVTMAP+400                                               03371000
CVTACTAP EQU   CVTMAP+396                                               03372000
CVTAUTH  EQU   CVTMAP+392                                               03373000
CVTRV490 EQU   CVTMAP+388                                               03374000
CVTSU    EQU   CVTMAP+384                                               03375000
CVTVOLT1 EQU   CVTVOLM1+1                                               03376000
CVTVOLI1 EQU   CVTVOLF1                                                 03377000
CVTSTOA  EQU   CVTMAP+376                                               03378000
CVTRSV58 EQU   CVTMAP+374                                               03379000
CVTRSV57 EQU   CVTMAP+372                                               03380000
CVTDDCE  EQU   CVTMAP+368                                               03381000
CVTPNWFR EQU   CVTMAP+364                                               03382000
CVTSMF   EQU   CVTMAP+360                                               03383000
CVTSULK  EQU   CVTMAP+358                                               03384000
CVTSLKO  EQU   CVTSYSK                                                  03385000
CVTSLKP  EQU   CVTSYSK                                                  03386000
CVTSLKQ  EQU   CVTSYSK                                                  03387000
CVTSLKR  EQU   CVTSYSK                                                  03388000
CVTRSV56 EQU   CVTSYSK                                                  03389000
CVTRSV55 EQU   CVTSYSK                                                  03390000
CVTRSV54 EQU   CVTSYSK                                                  03391000
CVTRSV53 EQU   CVTSYSK                                                  03392000
CVTRSV52 EQU   CVTA1F1                                                  03393000
CVTRSV51 EQU   CVTA1F1                                                  03394000
CVTRSV50 EQU   CVTA1F1                                                  03395000
CVTRSV49 EQU   CVTA1F1                                                  03396000
CVTRSV48 EQU   CVTA1F1                                                  03397000
CVTRSV47 EQU   CVTA1F1                                                  03398000
CVTSRSW  EQU   CVTA1F1                                                  03399000
CVTPFSW  EQU   CVTA1F1                                                  03400000
CVTPCVT  EQU   CVTMAP+352                                               03401000
CVTPGSIA EQU   CVTMAP+348                                               03402000
CVTRSV46 EQU   CVTMAP+344                                               03403000
CVTRSV45 EQU   CVTMAP+340                                               03404000
CVTRSV44 EQU   CVTMAP+338                                               03405000
CVTRSV43 EQU   CVTMAP+336                                               03406000
CVTHJESA EQU   CVTHJES+1                                                03407000
CVTRSV42 EQU   CVTHJES                                                  03408000
CVTEXT2A EQU   CVTEXT2+1                                                03409000
CVTRSV41 EQU   CVTEXT2                                                  03410000
CVTAPFA  EQU   CVTAPF+1                                                 03411000
CVTRSV40 EQU   CVTAPF                                                   03412000
CVTRV518 EQU   CVTINTLA                                                 03413000
CVTRV517 EQU   CVTERPV                                                  03414000
CVTEORM  EQU   CVTMAP+312                                               03415000
CVTMCHPR EQU   CVTMAP+308                                               03416000
CVTTZ    EQU   CVTMAP+304                                               03417000
CVTJEPS  EQU   CVTMAP+300                                               03418000
CVTJESCT EQU   CVTMAP+296                                               03419000
CVTMODE  EQU   CVTMAP+292                                               03420000
CVTPTRV  EQU   CVTMAP+288                                               03421000
CVTREAL  EQU   CVTMAP+284                                               03422000
CVTRSV39 EQU   CVTMAP+280                                               03423000
CVTRSV38 EQU   CVTMAP+276                                               03424000
CVTDMSRA EQU   CVTDMSR+1                                                03425000
CVTRV634 EQU   CVTDMSRF                                                 03426000
CVTRV633 EQU   CVTDMSRF                                                 03427000
CVTRV632 EQU   CVTDMSRF                                                 03428000
CVTRV631 EQU   CVTDMSRF                                                 03429000
CVTRV630 EQU   CVTDMSRF                                                 03430000
CVTRV629 EQU   CVTDMSRF                                                 03431000
CVTUDUMP EQU   CVTDMSRF                                                 03432000
CVTSDUMP EQU   CVTDMSRF                                                 03433000
CVTQMSGA EQU   CVTQMSG+1                                                03434000
CVTRSV36 EQU   CVTQMSG                                                  03435000
CVTAMFF  EQU   CVTMAP+264                                               03436000
CVTPURGA EQU   CVTPURG+1                                                03437000
CVTRSV35 EQU   CVTPURG                                                  03438000
CVTCBSP  EQU   CVTMAP+256                                               03439000
CVTATERA EQU   CVTATER+1                                                03440000
CVTSYST  EQU   CVTATER                                                  03441000
CVTVOLT2 EQU   CVTTAT                                                   03442000
CVTVOLI2 EQU   CVTVOLF2                                                 03443000
CVTAQAVB EQU   CVTAQAVT+1                                               03444000
CVTRSV34 EQU   CVTTCMFG                                                 03445000
CVTRSV33 EQU   CVTTCMFG                                                 03446000
CVTRSV32 EQU   CVTTCMFG                                                 03447000
CVTRSV31 EQU   CVTTCMFG                                                 03448000
CVTRSV30 EQU   CVTTCMFG                                                 03449000
CVTRSV29 EQU   CVTTCMFG                                                 03450000
CVTLDEV  EQU   CVTTCMFG                                                 03451000
CVTTCRDY EQU   CVTTCMFG                                                 03452000
CVTGTFA  EQU   CVTGTF+1                                                 03453000
CVTRSV27 EQU   CVTGTFST                                                 03454000
CVTRNIO  EQU   CVTGTFST                                                 03455000
CVTUSR   EQU   CVTGTFST                                                 03456000
CVTRV318 EQU   CVTFORM                                                  03457000
CVTRV317 EQU   CVTTMODE                                                 03458000
CVTRV316 EQU   CVTSTATE                                                 03459000
CVTRV315 EQU   CVTGTFS                                                  03460000
CVTGTFAV EQU   CVTGTFS                                                  03461000
CVT0SCR1 EQU   CVTMAP+232                                               03462000
CVTRV515 EQU   CVTMAP+228                                               03463000
CVTRMS   EQU   CVTMAP+224                                               03464000
CVTPATCH EQU   CVTMAP+220                                               03465000
CVTTSCE  EQU   CVTMAP+216                                               03466000
CVTLNKSC EQU   CVTMAP+214                                               03467000
CVTQABST EQU   CVTMAP+212                                               03468000
CVTMDLDS EQU   CVTMAP+208                                               03469000
CVTUSER  EQU   CVTMAP+204                                               03470000
CVTABEND EQU   CVTMAP+200                                               03471000
CVTSMCA  EQU   CVTMAP+196                                               03472000
CVTRSV18 EQU   CVTMAP+192                                               03473000
CVTQLPAQ EQU   CVTMAP+188                                               03474000
CVTQCDSR EQU   CVTMAP+184                                               03475000
CVTVS1B  EQU   CVTOPTB                                                  03476000
CVTVS1A  EQU   CVTOPTB                                                  03477000
CVTFP    EQU   CVTOPTB                                                  03478000
CVTAPTHR EQU   CVTOPTB                                                  03479000
CVTNLOG  EQU   CVTOPTB                                                  03480000
CVTTOD   EQU   CVTOPTB                                                  03481000
CVTCTIMS EQU   CVTOPTB                                                  03482000
CVTPROT  EQU   CVTOPTB                                                  03483000
CVTXPFP  EQU   CVTOPTA                                                  03484000
CVTASCII EQU   CVTOPTA                                                  03485000
CVTRSV13 EQU   CVTOPTA                                                  03486000
CVTRSV12 EQU   CVTOPTA                                                  03487000
CVTNIP   EQU   CVTOPTA                                                  03488000
CVTDDR   EQU   CVTOPTA                                                  03489000
CVTAPR   EQU   CVTOPTA                                                  03490000
CVTCCH   EQU   CVTOPTA                                                  03491000
CVTSNCTR EQU   CVTMAP+180                                               03492000
CVTQMWR  EQU   CVTMAP+176                                               03493000
CVTQOCR  EQU   CVTMAP+172                                               03494000
CVT1EF00 EQU   CVTMAP+168                                               03495000
CVTMZ00  EQU   CVTMAP+164                                               03496000
CVTHEAD  EQU   CVTMAP+160                                               03497000
CVTRSV11 EQU   CVTMAP+156                                               03498000
CVT0PT01 EQU   CVTMAP+152                                               03499000
CVTMSER  EQU   CVTMAP+148                                               03500000
CVTRV516 EQU   CVTIERLC                                                 03501000
CVTILCH  EQU   CVTMAP+140                                               03502000
CVT0DS   EQU   CVTMAP+136                                               03503000
CVTFBOSV EQU   CVTMAP+132                                               03504000
CVTNUCB  EQU   CVTMAP+128                                               03505000
CVTIXAVL EQU   CVTMAP+124                                               03506000
CVTIOQET EQU   CVTMAP+120                                               03507000
CVTDCBA  EQU   CVTMAP+117                                               03508000
CVTMVS2  EQU   CVTDCB                                                   03509000
CVT6DAT  EQU   CVTDCB                                                   03510000
CVT4MPS  EQU   CVTDCB                                                   03511000
CVTRSV09 EQU   CVTDCB                                                   03512000
CVT4MS1  EQU   CVTDCB                                                   03513000
CVT2SPS  EQU   CVTDCB                                                   03514000
CVT1SSS  EQU   CVTDCB                                                   03515000
CVTRSV08 EQU   CVTDCB                                                   03516000
CVTSTB   EQU   CVTMAP+112                                               03517000
CVTQTD00 EQU   CVTMAP+108                                               03518000
CVTQTE00 EQU   CVTMAP+104                                               03519000
CVTCUCB  EQU   CVTMAP+100                                               03520000
CVTSJQ   EQU   CVTMAP+96                                                03521000
CVTPBLDL EQU   CVTMAP+92                                                03522000
CVTTPC   EQU   CVTMAP+88                                                03523000
CVTSVDCB EQU   CVTMAP+84                                                03524000
CVTBRET  EQU   CVTMAP+82                                                03525000
CVTEXIT  EQU   CVTMAP+80                                                03526000
CVT0FN00 EQU   CVTMAP+76                                                03527000
CVTDARA  EQU   CVTDAR+1                                                 03528000
CVTRSV07 EQU   CVTFLGS1                                                 03529000
CVTRSV06 EQU   CVTFLGS1                                                 03530000
CVTRSV05 EQU   CVTFLGS1                                                 03531000
CVTRSV04 EQU   CVTFLGS1                                                 03532000
CVTRSV03 EQU   CVTFLGS1                                                 03533000
CVTRSV02 EQU   CVTFLGS1                                                 03534000
CVTRSV01 EQU   CVTFLGS1                                                 03535000
CVTDMPLK EQU   CVTFLGS1                                                 03536000
CVTXITP  EQU   CVTMAP+68                                                03537000
CVTZDTAB EQU   CVTMAP+64                                                03538000
CVTMSLT  EQU   CVTMAP+60                                                03539000
CVTDATE  EQU   CVTMAP+56                                                03540000
CVTBTERM EQU   CVTMAP+52                                                03541000
CVTSYSAD EQU   CVTMAP+48                                                03542000
CVTXTLER EQU   CVTMAP+44                                                03543000
CVTILK2  EQU   CVTMAP+40                                                03544000
CVTILK1  EQU   CVTMAP+36                                                03545000
CVTPRLTV EQU   CVTMAP+32                                                03546000
CVTPCNVT EQU   CVTMAP+28                                                03547000
CVT0VL00 EQU   CVTMAP+24                                                03548000
CVTXAPG  EQU   CVTMAP+20                                                03549000
CVTBUF   EQU   CVTMAP+16                                                03550000
CVTJOB   EQU   CVTMAP+12                                                03551000
CVTLINK  EQU   CVTMAP+8                                                 03552000
CVT0EF00 EQU   CVTMAP+4                                                 03553000
CVTTCBP  EQU   CVTMAP                                                   03554000
CVT      EQU   CVTMAP                                                   03555000
UCBIPL   EQU   UCBMPFLG                                                 03556000
UCBPROC  EQU   UCBMPFLG                                                 03557000
@NM00049 EQU   UCBMPFLG                                                 03558000
@NM00048 EQU   UCBMPFLG                                                 03559000
@NM00047 EQU   UCBMPFLG                                                 03560000
@NM00046 EQU   UCBMPFLG                                                 03561000
@NM00045 EQU   UCBMPFLG                                                 03562000
@NM00044 EQU   UCBMPFLG                                                 03563000
@NM00043 EQU   UCBM65MP+1                                               03564000
UCBNOA   EQU   UCBFL3                                                   03565000
UCBNOB   EQU   UCBFL3                                                   03566000
@NM00042 EQU   UCBFL3                                                   03567000
UCBSIOB  EQU   UCBFL3                                                   03568000
UCBHIOA  EQU   UCBFL3                                                   03569000
UCBHIOB  EQU   UCBFL3                                                   03570000
@NM00041 EQU   UCBFL3                                                   03571000
UCBACU   EQU   UCBFL3                                                   03572000
UCBGSISA EQU   UCBGSISB+1                                               03573000
UCBGSISN EQU   UCBGSISB                                                 03574000
UCBGSIPL EQU   UCBGSIEX+8                                               03575000
UCBGSIUM EQU   UCBGSIEX                                                 03576000
UCBSENSX EQU   UCBSENEX                                                 03577000
UCBRSV52 EQU   UCBSNINF+6                                               03578000
UCBSNSXT EQU   UCBSNINF                                                 03579000
UCBERADD EQU   UCBERADR+1                                               03580000
UCBDCBNR EQU   UCBERADR                                                 03581000
UCBFCBID EQU   UCBUCS+8                                                 03582000
UCBERCNT EQU   UCBUCS+7                                                 03583000
UCBRSV51 EQU   UCBUCS+6                                                 03584000
UCBRSV50 EQU   UCBFCBOP                                                 03585000
UCBRSV49 EQU   UCBFCBOP                                                 03586000
UCBRSV48 EQU   UCBFCBOP                                                 03587000
UCBRSV47 EQU   UCBFCBOP                                                 03588000
UCBRSV46 EQU   UCBFCBOP                                                 03589000
UCBRSV45 EQU   UCBFCBOP                                                 03590000
UCBRSV44 EQU   UCBFCBOP                                                 03591000
UCBFCBO1 EQU   UCBFCBOP                                                 03592000
UCBUCSPE EQU   UCBUCSOP                                                 03593000
UCBRSV43 EQU   UCBUCSOP                                                 03594000
UCBRSV42 EQU   UCBUCSOP                                                 03595000
UCBRSV41 EQU   UCBUCSOP                                                 03596000
UCBRSV40 EQU   UCBUCSOP                                                 03597000
UCBRSV39 EQU   UCBUCSOP                                                 03598000
UCBUCSO2 EQU   UCBUCSOP                                                 03599000
UCBUCSO1 EQU   UCBUCSOP                                                 03600000
UCBUCSID EQU   UCBUCS                                                   03601000
UCBMDRBA EQU   UCBMDRBF+1                                               03602000
UCBRV079 EQU   UCBMDRBF                                                 03603000
UCBIMAGE EQU   UCB3800X+32                                              03604000
UCBFCBNM EQU   UCB3800X+28                                              03605000
UCBCHAR4 EQU   UCB3800X+24                                              03606000
UCBCHAR3 EQU   UCB3800X+20                                              03607000
UCBCHAR2 EQU   UCB3800X+16                                              03608000
UCBCHAR1 EQU   UCB3800X+12                                              03609000
UCBCGMID EQU   UCB3800X+8                                               03610000
UCBCGMNO EQU   UCB3800X+7                                               03611000
UCBBRSTA EQU   UCBACTIV                                                 03612000
UCBRV077 EQU   UCBACTIV                                                 03613000
UCBRV076 EQU   UCBACTIV                                                 03614000
UCBRV075 EQU   UCBACTIV                                                 03615000
UCBRV078 EQU   UCBACTIV                                                 03616000
UCBRV074 EQU   UCBACTIV                                                 03617000
UCBRV073 EQU   UCBACTIV                                                 03618000
UCBRV072 EQU   UCBACTIV                                                 03619000
UCBRV071 EQU   UCBNONCR                                                 03620000
UCBRV070 EQU   UCBNONCR                                                 03621000
UCBRV069 EQU   UCBNONCR                                                 03622000
UCBRV068 EQU   UCBNONCR                                                 03623000
UCBRV067 EQU   UCBNONCR                                                 03624000
UCBNCBYP EQU   UCBNONCR                                                 03625000
UCBNCCAN EQU   UCBNONCR                                                 03626000
UCBNCHLD EQU   UCBNONCR                                                 03627000
UCBRV066 EQU   UCBCRIT                                                  03628000
UCBRV065 EQU   UCBCRIT                                                  03629000
UCBRV064 EQU   UCBCRIT                                                  03630000
UCBRV063 EQU   UCBCRIT                                                  03631000
UCBRV062 EQU   UCBCRIT                                                  03632000
UCBCRBYP EQU   UCBCRIT                                                  03633000
UCBCRCAN EQU   UCBCRIT                                                  03634000
UCBCRHLD EQU   UCBCRIT                                                  03635000
UCBRV061 EQU   UCBFRMDF                                                 03636000
UCBRV060 EQU   UCBFRMDF                                                 03637000
UCBRV059 EQU   UCBFRMDF                                                 03638000
UCBRV058 EQU   UCBFRMDF                                                 03639000
UCBRV057 EQU   UCBFRMDF                                                 03640000
UCBFMBYP EQU   UCBFRMDF                                                 03641000
UCBFMPRC EQU   UCBFRMDF                                                 03642000
UCBFMHLD EQU   UCBFRMDF                                                 03643000
UCBRV050 EQU   UCB3800X+1                                               03644000
UCBRV080 EQU   UCBOPTNS                                                 03645000
UCBBRSTR EQU   UCBOPTNS                                                 03646000
UCBRV056 EQU   UCBOPTNS                                                 03647000
UCBRV055 EQU   UCBOPTNS                                                 03648000
UCBRV054 EQU   UCBOPTNS                                                 03649000
UCBRV053 EQU   UCBOPTNS                                                 03650000
UCBRV052 EQU   UCBOPTNS                                                 03651000
UCBRV051 EQU   UCBOPTNS                                                 03652000
UCBRV041 EQU   UCB3540X+6                                               03653000
UCBVLSER EQU   UCB3540X                                                 03654000
UCBRDATA EQU   UCBOCR+4                                                 03655000
UCBFRID  EQU   UCBOCR                                                   03656000
@NM00040 EQU   UCBOR+3                                                  03657000
UCBCRECC EQU   UCBOR+2                                                  03658000
UCBCRILC EQU   UCBOR+1                                                  03659000
UCBCRDDC EQU   UCBOR                                                    03660000
UCBCSWSA EQU   UCBTCR+24                                                03661000
UCBRCCW3 EQU   UCBTCERP+16                                              03662000
UCBRCCW2 EQU   UCBTCERP+8                                               03663000
UCBRCCW1 EQU   UCBTCERP                                                 03664000
UCBCLN   EQU   UCBMT+22                                                 03665000
UCBERG   EQU   UCBMT+20                                                 03666000
UCBMS    EQU   UCBMT+19                                                 03667000
UCBNB    EQU   UCBMT+18                                                 03668000
UCBPW    EQU   UCBMT+17                                                 03669000
UCBPR    EQU   UCBMT+16                                                 03670000
UCBSIO   EQU   UCBMT+14                                                 03671000
UCBTW    EQU   UCBMT+13                                                 03672000
UCBTR    EQU   UCBMT+12                                                 03673000
UCBTWT   EQU   UCBMT+11                                                 03674000
UCBTRT   EQU   UCBMT+10                                                 03675000
UCBCTD   EQU   UCBMT+8                                                  03676000
UCBROR   EQU   UCBMT                                                    03677000
UCBMTPND EQU   UCBMTPRF+4                                               03678000
UCBTEXPA EQU   UCBTEXP+1                                                03679000
UCBRSV33 EQU   UCBTEXP                                                  03680000
UCBRSV63 EQU   UCBRSV55                                                 03681000
UCBRSV62 EQU   UCBRSV55                                                 03682000
UCBRSV61 EQU   UCBRSV55                                                 03683000
UCBRSV60 EQU   UCBRSV55                                                 03684000
UCBRSV59 EQU   UCBRSV55                                                 03685000
UCBRSV58 EQU   UCBRSV55                                                 03686000
UCBRSV57 EQU   UCBRSV55                                                 03687000
UCBRSV56 EQU   UCBRSV55                                                 03688000
UCBRSV54 EQU   UCBDA2+6                                                 03689000
UCBRSV53 EQU   UCBDA2+5                                                 03690000
UCBLTTDS EQU   UCBDA2+4                                                 03691000
UCBDEXPA EQU   UCBDEXP+1                                                03692000
UCBRSV32 EQU   UCBDEXP                                                  03693000
UCBOVFLW EQU   UCBDA+144                                                03694000
UCBERP   EQU   UCBDA+104                                                03695000
@NM00039 EQU   UCBDA                                                    03696000
UCBDUSER EQU   UCBDCELL+15                                              03697000
UCBDVTOC EQU   UCBDCELL+12                                              03698000
@NM00038 EQU   UCBDDMCT                                                 03699000
UCBDDMNT EQU   UCBDDMCT                                                 03700000
UCBDJBNR EQU   UCBDCELL+10                                              03701000
UCBDVOLI EQU   UCBDCELL+4                                               03702000
UCBRSV31 EQU   UCBDSTAT                                                 03703000
UCBRSV30 EQU   UCBDSTAT                                                 03704000
UCBDPRES EQU   UCBDSTAT                                                 03705000
UCBDALOC EQU   UCBDSTAT                                                 03706000
UCBDUNLD EQU   UCBDSTAT                                                 03707000
UCBDRESV EQU   UCBDSTAT                                                 03708000
UCBRSV29 EQU   UCBDSTAT                                                 03709000
UCBDNORM EQU   UCBDSTAT                                                 03710000
UCBDBNUL EQU   UCBDSTAB                                                 03711000
UCBDBJLB EQU   UCBDSTAB                                                 03712000
UCBDBSTR EQU   UCBDSTAB                                                 03713000
UCBDBPUB EQU   UCBDSTAB                                                 03714000
UCBDBPRV EQU   UCBDSTAB                                                 03715000
UCBDBPRS EQU   UCBDSTAB                                                 03716000
UCBRSV35 EQU   UCBDSTAB                                                 03717000
UCBDBSVL EQU   UCBDSTAB                                                 03718000
UCBDBBNR EQU   UCBDCELL                                                 03719000
UCBRSV19 EQU   UCBSNS+1                                                 03720000
UCBRSV18 EQU   UCBFL7                                                   03721000
UCBRSV17 EQU   UCBFL7                                                   03722000
UCBRSV16 EQU   UCBFL7                                                   03723000
UCBRSV15 EQU   UCBFL7                                                   03724000
UCBRSV14 EQU   UCBFL7                                                   03725000
UCBRSV13 EQU   UCBFL7                                                   03726000
UCBRSV12 EQU   UCBFL7                                                   03727000
UCBASDEP EQU   UCBFL7                                                   03728000
UCBLTS   EQU   UCBOB+20                                                 03729000
UCBUNTYP EQU   UCBTBYT4                                                 03730000
UCBRSV11 EQU   UCBDVCLS                                                 03731000
UCBRSV10 EQU   UCBDVCLS                                                 03732000
UCB3CHAR EQU   UCBDVCLS                                                 03733000
UCB3UREC EQU   UCBDVCLS                                                 03734000
UCB3DISP EQU   UCBDVCLS                                                 03735000
UCB3DACC EQU   UCBDVCLS                                                 03736000
UCB3COMM EQU   UCBDVCLS                                                 03737000
UCB3TAPE EQU   UCBDVCLS                                                 03738000
UCBDVPWR EQU   UCB2OPT7                                                 03739000
UCBVLPWR EQU   UCB2OPT6                                                 03740000
UCB2OPT5 EQU   UCBTBYT2                                                 03741000
UCBRVDEV EQU   UCB2OPT4                                                 03742000
UCBRPS   EQU   UCBDUDN2                                                 03743000
UCBDUDN1 EQU   UCB2OPT2                                                 03744000
UCB2OPT1 EQU   UCBTBYT2                                                 03745000
UCB2OPT0 EQU   UCBTBYT2                                                 03746000
UCB1FEA7 EQU   UCBTBYT1                                                 03747000
UCBD6250 EQU   UCB1FEA6                                                 03748000
UCBD1600 EQU   UCB1FEA5                                                 03749000
UCB1FEA4 EQU   UCBTBYT1                                                 03750000
UCB1FEA3 EQU   UCBTBYT1                                                 03751000
UCB1FEA2 EQU   UCBTBYT1                                                 03752000
UCB1FEA1 EQU   UCBTBYT1                                                 03753000
UCB1FEA0 EQU   UCBTBYT1                                                 03754000
UCBNAME  EQU   UCBOB+13                                                 03755000
UCBPATH3 EQU   UCBPATH                                                  03756000
UCBPATH2 EQU   UCBPATH                                                  03757000
UCBPATH1 EQU   UCBPATH                                                  03758000
UCBPATH0 EQU   UCBPATH                                                  03759000
UCBREW   EQU   UCBWGT                                                   03760000
UCBPUB   EQU   UCBWGT                                                   03761000
UCBOUT   EQU   UCBWGT                                                   03762000
UCBIN    EQU   UCBWGT                                                   03763000
UCBHPDV  EQU   @NM00036                                                 03764000
UCBHALI  EQU   @NM00036                                                 03765000
UCBRSV09 EQU   @NM00036                                                 03766000
UCBRSV08 EQU   @NM00036                                                 03767000
UCBRSV07 EQU   @NM00036                                                 03768000
UCBRSV06 EQU   @NM00036                                                 03769000
UCBRSV05 EQU   @NM00036                                                 03770000
UCBRSV04 EQU   @NM00036                                                 03771000
UCBLCI   EQU   UCBOB+10                                                 03772000
UCBSTI   EQU   UCBOB+9                                                  03773000
UCBETI   EQU   UCBOB+8                                                  03774000
UCBDTI   EQU   UCBOB+7                                                  03775000
UCBERR   EQU   UCBFL1                                                   03776000
UCBSTS   EQU   UCBFL1                                                   03777000
UCBNOTRC EQU   UCBFL1                                                   03778000
UCBINTER EQU   UCBFL1                                                   03779000
UCBUSING EQU   UCBFL1                                                   03780000
UCBNOTRD EQU   UCBFL1                                                   03781000
UCBBUSYD EQU   UCBFL1                                                   03782000
UCBCHANA EQU   UCBCHA                                                   03783000
UCBMOD   EQU   UCBCHA                                                   03784000
UCBHIO   EQU   UCBCHA                                                   03785000
UCBDADI  EQU   UCBSTAT                                                  03786000
UCBSYSR  EQU   UCBSTAT                                                  03787000
UCBPRES  EQU   UCBSTAT                                                  03788000
UCBALOC  EQU   UCBSTAT                                                  03789000
UCBUNLD  EQU   UCBSTAT                                                  03790000
UCBRESV  EQU   UCBSTAT                                                  03791000
UCBCHGS  EQU   UCBSTAT                                                  03792000
UCBONLI  EQU   UCBSTAT                                                  03793000
UCBID    EQU   UCBOB+2                                                  03794000
UCBALTPH EQU   UCBFL5                                                   03795000
UCBALTCU EQU   UCBFL5                                                   03796000
UCBNALOC EQU   UCBFL5                                                   03797000
UCBEXTSN EQU   UCBFL5                                                   03798000
UCBVSDR  EQU   UCBFL5                                                   03799000
UCBTICBT EQU   UCBFL5                                                   03800000
UCBAMV   EQU   UCBAF                                                    03801000
UCBUESNS EQU   UCBFL5                                                   03802000
UCBMONT  EQU   UCBJBNR                                                  03803000
UCBDEM   EQU   UCBJBNR                                                  03804000
UCBRSV02 EQU   UCBJBNR                                                  03805000
UCBRSV01 EQU   UCBJBNR                                                  03806000
UCBKEY   EQU   UCBJBNR                                                  03807000
UCBCMSEG EQU   UCBOB                                                    03808000
DEBXRV40 EQU   DEBXTN+28                                                03809000
DEBXRV39 EQU   DEBXTN+24                                                03810000
DEBXXARG EQU   DEBXTN+20                                                03811000
DEBXMCF2 EQU   DEBXTN+19                                                03812000
DEBXMCF1 EQU   DEBXTN+18                                                03813000
DEBXDSO2 EQU   DEBXTN+17                                                03814000
DEBXDSO1 EQU   DEBXTN+16                                                03815000
DEBXDBPR EQU   DEBXTN+12                                                03816000
DEBXDCBM EQU   DEBXTN+8                                                 03817000
DEBXDSAB EQU   DEBXTN+4                                                 03818000
DEBXRV48 EQU   DEBXTN+3                                                 03819000
DEBXRV47 EQU   DEBXFLG1                                                 03820000
DEBXRV46 EQU   DEBXFLG1                                                 03821000
DEBXRV45 EQU   DEBXFLG1                                                 03822000
DEBXRV44 EQU   DEBXFLG1                                                 03823000
DEBXRV43 EQU   DEBXFLG1                                                 03824000
DEBXRV42 EQU   DEBXFLG1                                                 03825000
DEBXTSKC EQU   DEBXFLG1                                                 03826000
DEBXCDCB EQU   DEBXFLG1                                                 03827000
DEBXLNGH EQU   DEBXTN                                                   03828000
DEBTBLOF EQU   DEBPREFX+14                                              03829000
DEBAMTYP EQU   DEBPREFX+13                                              03830000
DEBLNGTH EQU   DEBPREFX+12                                              03831000
DEBDCBMK EQU   DEBXTNP                                                  03832000
DEBDSCBA EQU   DEBPREFX+1                                               03833000
DEBWKARA EQU   DEBPREFX                                                 03834000
DEBXCEAD EQU   DEBXCEA+1                                                03835000
DEBXCENP EQU   DEBXCEAB                                                 03836000
DEBRSV35 EQU   DEBXCEAB                                                 03837000
DEBRSV34 EQU   DEBXCEAB                                                 03838000
DEBRSV33 EQU   DEBXCEAB                                                 03839000
DEBRSV32 EQU   DEBXCEAB                                                 03840000
DEBCEAD  EQU   DEBCEA+1                                                 03841000
DEBCENP  EQU   DEBCEAB                                                  03842000
DEBRSV31 EQU   DEBCEAB                                                  03843000
DEBRSV30 EQU   DEBCEAB                                                  03844000
DEBRSV29 EQU   DEBCEAB                                                  03845000
DEBRSV28 EQU   DEBCEAB                                                  03846000
DEBPCIAD EQU   DEBPCIA+1                                                03847000
DEBPCINP EQU   DEBPCIAB                                                 03848000
DEBRSV27 EQU   DEBPCIAB                                                 03849000
DEBRSV26 EQU   DEBPCIAB                                                 03850000
DEBRSV25 EQU   DEBPCIAB                                                 03851000
DEBRSV24 EQU   DEBPCIAB                                                 03852000
DEBSIOAD EQU   DEBSIOA+1                                                03853000
DEBSIONP EQU   DEBSIOAB                                                 03854000
DEBFIX   EQU   DEBSIOAB                                                 03855000
DEBIOVR  EQU   DEBSIOAB                                                 03856000
DEBSIOX  EQU   DEBSIOAB                                                 03857000
DEBPGFX  EQU   DEBSIOAB                                                 03858000
DEBEOEAD EQU   DEBEOEA+1                                                03859000
DEBEOENP EQU   DEBEOEAB                                                 03860000
DEBRSV22 EQU   DEBEOEAB                                                 03861000
DEBRSV21 EQU   DEBEOEAB                                                 03862000
DEBRSV20 EQU   DEBEOEAB                                                 03863000
DEBRSV19 EQU   DEBEOEAB                                                 03864000
DEBSUBID EQU   DEBSUBNM                                                 03865000
DEBSIOA2 EQU   DEBACS08+20                                              03866000
DEBRPSIO EQU   DEBACS08+16                                              03867000
DEBFREED EQU   DEBACS08+12                                              03868000
@NM00035 EQU   DEBACS08+8                                               03869000
@NM00034 EQU   DEBACS08+4                                               03870000
DEBDISAD EQU   DEBACS08                                                 03871000
DEBRPSST EQU   DEBACS07+60                                              03872000
DEBARECK EQU   DEBACS07+56                                              03873000
DEBAREWT EQU   DEBACS07+52                                              03874000
DEBACHK  EQU   DEBACS07+48                                              03875000
DEBAWRIT EQU   DEBACS07+44                                              03876000
DEBASETL EQU   DEBACS07+40                                              03877000
DEBAREAD EQU   DEBACS07+36                                              03878000
DEBCRECK EQU   DEBACS07+32                                              03879000
DEBCREWT EQU   DEBACS07+28                                              03880000
DEBCCHK  EQU   DEBACS07+24                                              03881000
DEBCWRIT EQU   DEBACS07+20                                              03882000
DEBCSETL EQU   DEBACS07+16                                              03883000
DEBCREAD EQU   DEBACS07+12                                              03884000
DEBWKPT5 EQU   DEBACS07+8                                               03885000
DEBWKPT4 EQU   DEBACS07+4                                               03886000
DEBGET   EQU   DEBACS07                                                 03887000
DEBPUT   EQU   DEBACS06                                                 03888000
DEBLUCBB EQU   DEBLUCBA+1                                               03889000
DEBRSV18 EQU   DEBLUCBA                                                 03890000
DEBFUCBB EQU   DEBFUCBA+1                                               03891000
DEBRSV17 EQU   DEBFUCBA                                                 03892000
DEBTCCWB EQU   DEBTCCWA+1                                               03893000
DEBRSV16 EQU   DEBTCCWA                                                 03894000
DEBTBFRB EQU   DEBTBFRA+1                                               03895000
DEBRSV15 EQU   DEBTBFRA                                                 03896000
DEBDBPEF EQU   DEBACS03+8                                               03897000
DEBDBPP  EQU   DEBACS03+4                                               03898000
DEBDTPP  EQU   DEBACS03                                                 03899000
DEBDBPE  EQU   DEBDBLK+1                                                03900000
DEBDBPT  EQU   DEBDBLK                                                  03901000
DEBEXTNM EQU   DEBDSNAM                                                 03902000
DEBLRECL EQU   DEBACSMD+14                                              03903000
DEBBLKSI EQU   DEBACSMD+12                                              03904000
DEBRSV14 EQU   DEBDSNM+4                                                03905000
DEBUTSAB EQU   DEBUTSAA+1                                               03906000
DEBRSV13 EQU   DEBUTSAA                                                 03907000
DEBVOLNM EQU   DEBACSMD+2                                               03908000
DEBVLSEQ EQU   DEBVOLSQ+1                                               03909000
DEBRSV42 EQU   DEBVOLBT                                                 03910000
DEBRSV41 EQU   DEBVOLBT                                                 03911000
DEBRSV40 EQU   DEBVOLBT                                                 03912000
DEBRSV39 EQU   DEBVOLBT                                                 03913000
DEBRSV38 EQU   DEBVOLBT                                                 03914000
DEBRSV37 EQU   DEBVOLBT                                                 03915000
DEBRSV36 EQU   DEBVOLBT                                                 03916000
DEBEXFUL EQU   DEBVOLBT                                                 03917000
DEBNMTRK EQU   DEBDASD+14                                               03918000
DEBENDHH EQU   DEBDASD+12                                               03919000
DEBENDCC EQU   DEBDASD+10                                               03920000
DEBSTRHH EQU   DEBDASD+8                                                03921000
DEBSTRCC EQU   DEBDASD+6                                                03922000
DEBBINUM EQU   DEBDASD+4                                                03923000
DEBUCBA  EQU   DEBUCBAD+1                                               03924000
DEBDVMOD EQU   DEBUCBAD                                                 03925000
DEBAPPB  EQU   DEBAPPAD+1                                               03926000
DEBEXSCL EQU   DEBAPPAD                                                 03927000
DEBDCBB  EQU   DEBDCBAD+1                                               03928000
DEBDEBID EQU   DEBPROTG                                                 03929000
DEBECBB  EQU   DEBECBAD+1                                               03930000
DEBPRIOR EQU   DEBECBAD                                                 03931000
DEBUSRPB EQU   DEBUSRPG+1                                               03932000
DEBNMEXT EQU   DEBUSRPG                                                 03933000
DEBRSV57 EQU   DEBFLGS2                                                 03934000
DEBRSV56 EQU   DEBFLGS2                                                 03935000
DEBRSV55 EQU   DEBFLGS2                                                 03936000
DEBACIS  EQU   DEBFLGS2                                                 03937000
DEBWIND  EQU   DEBFLGS2                                                 03938000
DEBRSV52 EQU   DEBFLGS2                                                 03939000
DEBRSV51 EQU   DEBFLGS2                                                 03940000
DEBRSV50 EQU   DEBFLGS2                                                 03941000
DEBXTNIN EQU   DEBFLGS1                                                 03942000
DEBAPFIN EQU   DEBFLGS1                                                 03943000
DEBF1CEV EQU   DEBFLGS1                                                 03944000
DEBCINDI EQU   DEBFLGS1                                                 03945000
DEBRSV02 EQU   DEBFLGS1                                                 03946000
DEBRSIOA EQU   DEBFLGS1                                                 03947000
DEBEOFDF EQU   DEBFLGS1                                                 03948000
DEBPWCKD EQU   DEBFLGS1                                                 03949000
DEBQSCNT EQU   DEBBASIC+13                                              03950000
DEBACCS  EQU   DEBOPATB                                                 03951000
DEBPOSIT EQU   DEBOPATB                                                 03952000
DEBZERO  EQU   DEBOPATB                                                 03953000
DEBABEND EQU   DEBOPATB                                                 03954000
DEBIRBB  EQU   DEBIRBAD+1                                               03955000
DEBRERR  EQU   DEBOFLGS                                                 03956000
DEBLABEL EQU   DEBOFLGS                                                 03957000
DEBSPLIT EQU   DEBOFLGS                                                 03958000
DEBDCB   EQU   DEBOFLGS                                                 03959000
DEBRLSE  EQU   DEBOFLGS                                                 03960000
DEBEOF   EQU   DEBOFLGS                                                 03961000
DEBDISP  EQU   DEBOFLGS                                                 03962000
DEBDEBB  EQU   DEBDEBAD+1                                               03963000
DEBAMLNG EQU   DEBDEBAD                                                 03964000
DEBTCBB  EQU   DEBTCBAD+1                                               03965000
DEBNMSUB EQU   DEBTCBAD                                                 03966000
DCBEOB   EQU   IHADCS40+20                                              03967000
DCBPRECL EQU   IHADCS40+18                                              03968000
@NM00033 EQU   IHADCS40+16                                              03969000
@NM00032 EQU   @NM00030+1                                               03970000
@NM00031 EQU   DCBEROPT                                                 03971000
DCBERABE EQU   DCBEROPT                                                 03972000
DCBERSKP EQU   DCBEROPT                                                 03973000
DCBERACC EQU   DCBEROPT                                                 03974000
@NM00029 EQU   IHADCS40+10                                              03975000
@NM00028 EQU   IHADCS40+9                                               03976000
@NM00027 EQU   IHADCS40+8                                               03977000
DCBRECA  EQU   DCBRECAD+1                                               03978000
@NM00026 EQU   DCBRECBT                                                 03979000
DCBRCFGT EQU   DCBRCREL                                                 03980000
DCBRCTRU EQU   DCBRCREL                                                 03981000
DCBLCCW  EQU   DCBEOBAD                                                 03982000
DCBNOTE  EQU   DCBCNTRL                                                 03983000
DCBLRECL EQU   IHADCS38+10                                              03984000
@NM00025 EQU   IHADCS38+8                                               03985000
DCBEOBW  EQU   IHADCS38+4                                               03986000
DCBEOBRA EQU   DCBEOBR+1                                                03987000
DCBNCP   EQU   DCBEOBR                                                  03988000
@NM00024 EQU   DCBFLAG1                                                 03989000
DCBSTFLS EQU   DCBFLAG1                                                 03990000
DCBSTQCK EQU   DCBFLAG1                                                 03991000
DCBDIRCQ EQU   DCBBUFOF                                                 03992000
DCBQSTRU EQU   DCBUSASI                                                 03993000
@NM00023 EQU   DCBUSASI                                                 03994000
DCBQADF3 EQU   DCBQADFS                                                 03995000
DCBQADF2 EQU   DCBQADFS                                                 03996000
DCBQADF1 EQU   DCBQADFS                                                 03997000
DCBBLBP  EQU   DCBUSASI                                                 03998000
@NM00022 EQU   DCBUSASI                                                 03999000
DCBCICBA EQU   DCBCICB+1                                                04000000
@NM00021 EQU   DCBCICB                                                  04001000
DCBOFFSW EQU   IHADCS36+15                                              04002000
DCBOFFSR EQU   IHADCS36+14                                              04003000
DCBWCPL  EQU   IHADCS36+13                                              04004000
DCBWCPO  EQU   IHADCS36+12                                              04005000
DCBBLKSI EQU   IHADCS36+10                                              04006000
DCBCNQSM EQU   DCBCIND2                                                 04007000
DCBCNFEO EQU   DCBCIND2                                                 04008000
DCBCNCHS EQU   DCBCIND2                                                 04009000
DCBCNBFP EQU   DCBCIND2                                                 04010000
DCBCNIOE EQU   DCBCIND2                                                 04011000
DCBCNCLO EQU   DCBCIND2                                                 04012000
DCBCNWRO EQU   DCBCIND2                                                 04013000
DCBCNSTO EQU   DCBCIND2                                                 04014000
DCBCNEXB EQU   DCBCIND1                                                 04015000
@NM00020 EQU   DCBCIND1                                                 04016000
DCBCNBRM EQU   DCBCIND1                                                 04017000
@NM00019 EQU   DCBCIND1                                                 04018000
DCBCNEVA EQU   DCBCIND1                                                 04019000
DCBCNEVB EQU   DCBCIND1                                                 04020000
DCBCNSRD EQU   DCBCIND1                                                 04021000
DCBCNTOV EQU   DCBCIND1                                                 04022000
DCBSYNA  EQU   DCBSYNAD+1                                               04023000
DCBIOBL  EQU   DCBSYNAD                                                 04024000
DCBCHCKA EQU   DCBPERRA                                                 04025000
DCBOPTJ  EQU   DCBOPTCD                                                 04026000
DCBOPTT  EQU   DCBOPTCD                                                 04027000
DCBSRCHD EQU   DCBOPTZ                                                  04028000
DCBOPTQ  EQU   DCBOPTCD                                                 04029000
DCBBCKPT EQU   DCBOPTO                                                  04030000
DCBOPTC  EQU   DCBOPTCD                                                 04031000
DCBOPTU  EQU   DCBOPTCD                                                 04032000
DCBOPTW  EQU   DCBOPTCD                                                 04033000
DCBPUTA  EQU   DCBGETA                                                  04034000
@NM00018 EQU   DCBPUT                                                   04035000
DCBREADA EQU   DCBWRITA                                                 04036000
@NM00017 EQU   DCBREAD                                                  04037000
DCBDEBA  EQU   DCBDEBAD+1                                               04038000
@NM00016 EQU   DCBIFLGS                                                 04039000
DCBIFIOE EQU   DCBIFLGS                                                 04040000
DCBCH12  EQU   DCBIFPCT                                                 04041000
DCBCH9   EQU   DCBIFPCT                                                 04042000
DCBIFEC  EQU   DCBIFLGS                                                 04043000
DCBMFSTI EQU   DCBMFDMD                                                 04044000
DCBMFAWR EQU   DCBMFSTK                                                 04045000
DCBMFUIP EQU   DCBMFTMD                                                 04046000
DCBMFIDW EQU   DCBMFLCP                                                 04047000
DCBMFWRK EQU   DCBMFMVP                                                 04048000
DCBMFRDQ EQU   DCBMFWRT                                                 04049000
DCBMFGTQ EQU   DCBMFPUT                                                 04050000
DCBMFSTL EQU   DCBMACF2                                                 04051000
DCBMFCK  EQU   DCBMFDMG                                                 04052000
DCBMFRDX EQU   DCBMFCHK                                                 04053000
DCBMFDBF EQU   DCBMFSBG                                                 04054000
DCBMFRDI EQU   DCBMFLCG                                                 04055000
DCBMFRDK EQU   DCBMFMVG                                                 04056000
DCBMFWRQ EQU   DCBMFRD                                                  04057000
DCBMFPTQ EQU   DCBMFGET                                                 04058000
DCBMFECP EQU   DCBMACF1                                                 04059000
DCBTIOT  EQU   IHADCS25                                                 04060000
DCBMRSTI EQU   DCBMRDMD                                                 04061000
DCBMRAWR EQU   DCBMRSTK                                                 04062000
DCBMRUIP EQU   DCBMRTMD                                                 04063000
DCBMRIDW EQU   DCBMRLCP                                                 04064000
DCBMRWRK EQU   DCBMRMVP                                                 04065000
DCBMRRDQ EQU   DCBMRWRT                                                 04066000
DCBMRGTQ EQU   DCBMRPUT                                                 04067000
DCBMRSTL EQU   DCBMACR2                                                 04068000
DCBMRCK  EQU   DCBMRDMG                                                 04069000
DCBPGFXA EQU   DCBMRRDX                                                 04070000
DCBMRDBF EQU   DCBMRSBG                                                 04071000
DCBMRRDI EQU   DCBMRLCG                                                 04072000
DCBMRRDK EQU   DCBMRMVG                                                 04073000
DCBMRWRQ EQU   DCBMRRD                                                  04074000
DCBMRPTQ EQU   DCBMRGET                                                 04075000
DCBMRECP EQU   DCBMACR1                                                 04076000
@NM00015 EQU   DCBIFLG                                                  04077000
DCBIBIOE EQU   DCBIFLG                                                  04078000
DCBICH12 EQU   DCBIBPCT                                                 04079000
DCBICH9  EQU   DCBIBPCT                                                 04080000
DCBIBEC  EQU   DCBIFLG                                                  04081000
DCBOFIOF EQU   DCBOFLGS                                                 04082000
DCBOFUEX EQU   DCBOFLGS                                                 04083000
DCBOFTM  EQU   DCBOFLGS                                                 04084000
DCBOFPPC EQU   DCBOFLGS                                                 04085000
DCBOFEOV EQU   DCBOFLGS                                                 04086000
DCBOFLRB EQU   DCBOFLGS                                                 04087000
DCBOFIOD EQU   DCBOFLWR                                                 04088000
DCBDDNAM EQU   IHADCS24                                                 04089000
DCBEXLSA EQU   DCBEXLST+1                                               04090000
DCBRECKL EQU   DCBRECFM                                                 04091000
DCBRECCC EQU   DCBRECFM                                                 04092000
DCBRECSB EQU   DCBRECFM                                                 04093000
DCBRECBR EQU   DCBRECFM                                                 04094000
DCBRECTO EQU   DCBRECLA                                                 04095000
DCBRECL  EQU   DCBRECLA                                                 04096000
DCBEODA  EQU   DCBEODAD+1                                               04097000
DCBBFA   EQU   DCBBFTEK                                                 04098000
DCBH0    EQU   DCBBFTEK                                                 04099000
DCBBFTKD EQU   DCBBFTEK                                                 04100000
DCBBFTE  EQU   DCBBFT                                                   04101000
DCBBFTKR EQU   DCBBFT                                                   04102000
DCBBFTS  EQU   DCBBFT                                                   04103000
DCBH1    EQU   DCBBFTEK                                                 04104000
DCBSVCXA EQU   DCBSVCXL+1                                               04105000
@NM00014 EQU   DCBSVCXL                                                 04106000
DCBODEBA EQU   DCBIOBAA                                                 04107000
@NM00013 EQU   DCBQSLM                                                  04108000
DCBUPDBT EQU   DCBQSLM                                                  04109000
DCBUPDCM EQU   DCBQSLM                                                  04110000
DCB1DVDS EQU   DCBQSLM                                                  04111000
@NM00012 EQU   DCBDSRG2                                                 04112000
DCBDSGTR EQU   DCBDSRG2                                                 04113000
DCBACBM  EQU   DCBDSRG2                                                 04114000
@NM00011 EQU   DCBDSRG2                                                 04115000
DCBDSGTQ EQU   DCBDSRG2                                                 04116000
DCBDSGTX EQU   DCBDSRG2                                                 04117000
DCBDSGGS EQU   DCBDSRG2                                                 04118000
DCBDSGU  EQU   DCBDSRG1                                                 04119000
DCBDSGPO EQU   DCBDSRG1                                                 04120000
@NM00010 EQU   DCBDSRG1                                                 04121000
@NM00009 EQU   DCBDSRG1                                                 04122000
DCBDSGCX EQU   DCBDSRG1                                                 04123000
DCBDSGDA EQU   DCBDSRG1                                                 04124000
DCBDSGPS EQU   DCBDSRG1                                                 04125000
DCBDSGIS EQU   DCBDSRG1                                                 04126000
DCBBUFL  EQU   IHADCS11+8                                               04127000
DCBBUFCA EQU   DCBBUFCB+1                                               04128000
DCBBUFNO EQU   DCBBUFCB                                                 04129000
DCBDEVT  EQU   DCBREL                                                   04130000
DCBKEYLE EQU   DCBRELB                                                  04131000
DCBTRBAL EQU   IHADCS01+6                                               04132000
@NM00008 EQU   IHADCS01+5                                               04133000
@NM00007 EQU   IHADCS01+4                                               04134000
DCBDVTBA EQU   DCBDVTBL+1                                               04135000
@NM00006 EQU   DCBDVTBL                                                 04136000
DCBKEYCN EQU   IHADCS00+4                                               04137000
DCBRELAD EQU   IHADCS00                                                 04138000
@NM00005 EQU   IHADCB                                                   04139000
@NM00077 EQU   PSA+3668                                                 04140000
PSASTAK  EQU   PSA+3072                                                 04141000
@NM00076 EQU   PSA+1048                                                 04142000
PSAUSEND EQU   PSA+1048                                                 04143000
PSARV062 EQU   PSA+1044                                                 04144000
PSACDAL  EQU   PSA+1040                                                 04145000
PSAWTCOD EQU   PSA+1036                                                 04146000
PSAATCVT EQU   PSA+1032                                                 04147000
PSAPCPSW EQU   PSA+1024                                                 04148000
PSAPIR2  EQU   PSA+1020                                                 04149000
PSARV059 EQU   PSA+1018                                                 04150000
PSASVC13 EQU   PSA+1016                                                 04151000
PSALSFCC EQU   PSA+1012                                                 04152000
PSASFACC EQU   PSA+1008                                                 04153000
PSASTOP  EQU   PSA+992                                                  04154000
PSASTART EQU   PSA+976                                                  04155000
PSARSPSW EQU   PSA+968                                                  04156000
PSASRPSW EQU   PSA+960                                                  04157000
PSARV045 EQU   PSA+892                                                  04158000
PSARV044 EQU   PSA+888                                                  04159000
PSARV043 EQU   PSA+884                                                  04160000
PSARV042 EQU   PSA+880                                                  04161000
PSARV041 EQU   PSA+876                                                  04162000
PSARV040 EQU   PSA+872                                                  04163000
PSARV025 EQU   PSA+868                                                  04164000
PSADSSED EQU   PSA+868                                                  04165000
PSADSSPR EQU   PSA+864                                                  04166000
PSADSSFW EQU   PSA+860                                                  04167000
PSADSS14 EQU   PSA+856                                                  04168000
PSADSSPP EQU   PSA+848                                                  04169000
PSADSSRP EQU   PSA+840                                                  04170000
PSADSS05 EQU   PSADSSF4                                                 04171000
PSADSS10 EQU   PSADSSF4                                                 04172000
PSADSSVE EQU   PSADSSF4                                                 04173000
PSADSSDE EQU   PSADSSF4                                                 04174000
PSADSSC0 EQU   PSADSSF4                                                 04175000
PSADSSIE EQU   PSADSSF4                                                 04176000
PSADSS12 EQU   PSADSSF4                                                 04177000
PSADSSRC EQU   PSADSSF4                                                 04178000
PSARV057 EQU   PSADSSF3                                                 04179000
PSARV056 EQU   PSADSSF3                                                 04180000
PSARV055 EQU   PSADSSF3                                                 04181000
PSADSSMC EQU   PSADSSF3                                                 04182000
PSADSSRW EQU   PSADSSF3                                                 04183000
PSADSSNM EQU   PSADSSF3                                                 04184000
PSADSSES EQU   PSADSSF3                                                 04185000
PSADSSGP EQU   PSADSSF3                                                 04186000
PSADSSF2 EQU   PSADSSFL+1                                               04187000
PSADSSPI EQU   PSADSSF1                                                 04188000
PSADSSOI EQU   PSADSSF1                                                 04189000
PSADSSSP EQU   PSADSSF1                                                 04190000
PSADSSTP EQU   PSADSSF1                                                 04191000
PSADSSDW EQU   PSADSSF1                                                 04192000
PSADSSDD EQU   PSADSSF1                                                 04193000
PSADSSDM EQU   PSADSSF1                                                 04194000
PSADSSMV EQU   PSADSSF1                                                 04195000
PSADSSTS EQU   PSA+816                                                  04196000
PSADSSWK EQU   PSA+812                                                  04197000
PSADSSR3 EQU   PSA+808                                                  04198000
PSADSSR2 EQU   PSA+804                                                  04199000
PSADSSRS EQU   PSA+800                                                  04200000
PSASTOR  EQU   PSA+796                                                  04201000
PSACPUSA EQU   PSA+794                                                  04202000
PSAVSTAP EQU   PSA+792                                                  04203000
PSAWKVAP EQU   PSA+788                                                  04204000
PSAWKRAP EQU   PSA+784                                                  04205000
PSAMCHIC EQU   PSA+783                                                  04206000
PSAACTCD EQU   PSA+782                                                  04207000
PSASYMSK EQU   PSA+781                                                  04208000
PSAMCHFL EQU   PSA+780                                                  04209000
PSACR0   EQU   PSA+776                                                  04210000
PSAPSWSV EQU   PSA+768                                                  04211000
PSALITA  EQU   PSA+764                                                  04212000
PSACLHS  EQU   PSAHLHI                                                  04213000
PSALKR15 EQU   PSALKSA+60                                               04214000
PSALKR14 EQU   PSALKSA+56                                               04215000
PSALKR13 EQU   PSALKSA+52                                               04216000
PSALKR12 EQU   PSALKSA+48                                               04217000
PSALKR11 EQU   PSALKSA+44                                               04218000
PSALKR10 EQU   PSALKSA+40                                               04219000
PSALKR9  EQU   PSALKSA+36                                               04220000
PSALKR8  EQU   PSALKSA+32                                               04221000
PSALKR7  EQU   PSALKSA+28                                               04222000
PSALKR6  EQU   PSALKSA+24                                               04223000
PSALKR5  EQU   PSALKSA+20                                               04224000
PSALKR4  EQU   PSALKSA+16                                               04225000
PSALKR3  EQU   PSALKSA+12                                               04226000
PSALKR2  EQU   PSALKSA+8                                                04227000
PSALKR1  EQU   PSALKSA+4                                                04228000
PSALKR0  EQU   PSALKSA                                                  04229000
PSARV023 EQU   PSACLHT+52                                               04230000
PSALOCAL EQU   PSACLHT+48                                               04231000
PSACMSL  EQU   PSACLHT+44                                               04232000
PSAOPTL  EQU   PSACLHT+40                                               04233000
PSATPACL EQU   PSACLHT+36                                               04234000
PSATPDNL EQU   PSACLHT+32                                               04235000
PSATPNCL EQU   PSACLHT+28                                               04236000
PSAIOSLL EQU   PSACLHT+24                                               04237000
PSAIOSUL EQU   PSACLHT+20                                               04238000
PSAIOSCL EQU   PSACLHT+16                                               04239000
PSAIOSSL EQU   PSACLHT+12                                               04240000
PSASALCL EQU   PSACLHT+8                                                04241000
PSAASML  EQU   PSACLHT+4                                                04242000
PSADISPL EQU   PSACLHT                                                  04243000
PSASRSA  EQU   PSA+636                                                  04244000
PSARV050 EQU   PSA+634                                                  04245000
PSADSSGO EQU   PSA+633                                                  04246000
PSARECUR EQU   PSA+632                                                  04247000
PSAHLHIS EQU   PSA+628                                                  04248000
PSAIPCSA EQU   PSA+624                                                  04249000
@NM00075 EQU   PSA+621                                                  04250000
PSAIPCDM EQU   PSA+620                                                  04251000
PSAIPCD  EQU   PSA+616                                                  04252000
@NM00074 EQU   PSA+613                                                  04253000
PSAIPCRM EQU   PSA+612                                                  04254000
PSAIPCR  EQU   PSA+608                                                  04255000
PSAMCHEX EQU   PSA+600                                                  04256000
PSAMPSW  EQU   PSA+592                                                  04257000
PSAEXPS2 EQU   PSA+584                                                  04258000
PSAEXPS1 EQU   PSA+576                                                  04259000
PSAPIREG EQU   PSA+572                                                  04260000
PSARSREG EQU   PSA+568                                                  04261000
PSAGPREG EQU   PSA+556                                                  04262000
PSARV022 EQU   PSASUP4                                                  04263000
PSARV021 EQU   PSASUP4                                                  04264000
PSARV020 EQU   PSASUP4                                                  04265000
PSARV019 EQU   PSASUP4                                                  04266000
PSARV018 EQU   PSASUP4                                                  04267000
PSARV017 EQU   PSASUP4                                                  04268000
PSARV016 EQU   PSASUP4                                                  04269000
PSARV015 EQU   PSASUP4                                                  04270000
PSARV014 EQU   PSASUP3                                                  04271000
PSAULCMS EQU   PSASUP3                                                  04272000
PSARV012 EQU   PSASUP3                                                  04273000
PSAESTA  EQU   PSASUP3                                                  04274000
PSASPR   EQU   PSASUP3                                                  04275000
PSAPSREG EQU   PSASUP3                                                  04276000
PSAPI2   EQU   PSASUP3                                                  04277000
PSAIOSUP EQU   PSASUP3                                                  04278000
PSALCR   EQU   PSASUP2                                                  04279000
PSARTM   EQU   PSASUP2                                                  04280000
PSAACR   EQU   PSASUP2                                                  04281000
PSAIPCE2 EQU   PSASUP2                                                  04282000
PSAIPCES EQU   PSASUP2                                                  04283000
PSAIPCEC EQU   PSASUP2                                                  04284000
PSAGTF   EQU   PSASUP2                                                  04285000
PSAIPCRI EQU   PSASUP2                                                  04286000
PSATYPE6 EQU   PSASUP1                                                  04287000
PSATCTL  EQU   PSASUP1                                                  04288000
PSADISP  EQU   PSASUP1                                                  04289000
PSALOCK  EQU   PSASUP1                                                  04290000
PSAPI    EQU   PSASUP1                                                  04291000
PSAEXT   EQU   PSASUP1                                                  04292000
PSASVC   EQU   PSASUP1                                                  04293000
PSAIO    EQU   PSASUP1                                                  04294000
PSAAOLD  EQU   PSA+548                                                  04295000
PSAANEW  EQU   PSA+544                                                  04296000
PSATOLD  EQU   PSA+540                                                  04297000
PSATNEW  EQU   PSA+536                                                  04298000
PSALCCAR EQU   PSA+532                                                  04299000
PSALCCAV EQU   PSA+528                                                  04300000
PSAPCCAR EQU   PSA+524                                                  04301000
PSAPCCAV EQU   PSA+520                                                  04302000
PSACPULA EQU   PSA+518                                                  04303000
PSACPUPA EQU   PSA+516                                                  04304000
PSAPSA   EQU   PSA+512                                                  04305000
FLCHDEND EQU   PSA+512                                                  04306000
FLCCRSAV EQU   FLCMCLA+280                                              04307000
FLCGRSAV EQU   FLCMCLA+216                                              04308000
FLCFPSAV EQU   FLCMCLA+184                                              04309000
FLCFLA   EQU   FLCMCLA+88                                               04310000
FLCRGNCD EQU   FLCMCLA+84                                               04311000
FLCFSAA  EQU   FLCFSA+1                                                 04312000
@NM00073 EQU   FLCFSA                                                   04313000
@NM00072 EQU   FLCMCLA+77                                               04314000
PSAMDISC EQU   PSAMEDC                                                  04315000
PSAMINTR EQU   PSAMEDC                                                  04316000
PSAMINST EQU   PSAMEDC                                                  04317000
PSAMCCF  EQU   PSAMEDC                                                  04318000
PSAMCNOP EQU   PSAMEDC                                                  04319000
PSAMEXSR EQU   PSAMEDC                                                  04320000
PSAMCOPR EQU   PSAMEDC                                                  04321000
@NM00071 EQU   PSAMEDC                                                  04322000
@NM00070 EQU   FLCMCLA+72                                               04323000
FLCMCIC  EQU   FLCMCLA+64                                               04324000
@NM00069 EQU   FLCMCLA+20                                               04325000
FLCIOAA  EQU   FLCIOA+1                                                 04326000
@NM00068 EQU   FLCIOA                                                   04327000
@NM00067 EQU   FLCMCLA+15                                               04328000
@NM00066 EQU   FLCMCLA+14                                               04329000
@NM00065 EQU   FLCMCLA+12                                               04330000
FLCLCL   EQU   FLCMCLA+8                                                04331000
FLCIOELA EQU   FLCIOEL+1                                                04332000
@NM00064 EQU   FLCIOEL                                                  04333000
FLCCHIL  EQU   FLCCHNID+2                                               04334000
FLCCHMOD EQU   FLCCHTM                                                  04335000
FLCCHTYP EQU   FLCCHTM                                                  04336000
@NM00063 EQU   PSA+160                                                  04337000
FLCMTRCD EQU   PSA+157                                                  04338000
@NM00062 EQU   PSA+156                                                  04339000
FLCPERA  EQU   FLCPER+1                                                 04340000
@NM00061 EQU   FLCPER                                                   04341000
@NM00060 EQU   PSA+151                                                  04342000
FLCPERCD EQU   PSA+150                                                  04343000
FLCMCNUM EQU   PSA+149                                                  04344000
@NM00059 EQU   PSA+148                                                  04345000
FLCTEAA  EQU   FLCTEA+1                                                 04346000
@NM00058 EQU   FLCTEA                                                   04347000
PSAPIPC  EQU   PSAPICOD                                                 04348000
PSAPIMC  EQU   PSAPICOD                                                 04349000
PSAPIPER EQU   PSAPICOD                                                 04350000
PSARV049 EQU   FLCPICOD                                                 04351000
FLCPILCB EQU   FLCPIILC                                                 04352000
@NM00057 EQU   FLCPIILC                                                 04353000
@NM00056 EQU   PSAEPPSW                                                 04354000
FLCSVCN  EQU   PSAESPSW+2                                               04355000
FLCSILCB EQU   FLCSVILC                                                 04356000
@NM00055 EQU   FLCSVILC                                                 04357000
@NM00054 EQU   PSAESPSW                                                 04358000
FLCEICOD EQU   PSAEEPSW+2                                               04359000
PSASPAD  EQU   PSAEEPSW                                                 04360000
@NM00053 EQU   PSA+128                                                  04361000
FLCINPSW EQU   PSA+120                                                  04362000
FLCMNPSW EQU   PSA+112                                                  04363000
FLCPNPSW EQU   PSA+104                                                  04364000
FLCSNPSW EQU   PSA+96                                                   04365000
FLCENPSW EQU   PSA+88                                                   04366000
FLCTRACE EQU   PSA+84                                                   04367000
FLCTIMER EQU   PSA+80                                                   04368000
FLCCVT2  EQU   PSA+76                                                   04369000
FLCCAW   EQU   PSA+72                                                   04370000
FLCCSW   EQU   PSA+64                                                   04371000
FLCIOPSW EQU   PSA+56                                                   04372000
FLCMOPSW EQU   PSA+48                                                   04373000
FLCPOPSW EQU   PSA+40                                                   04374000
FLCSOPSW EQU   PSA+32                                                   04375000
FLCEOPSW EQU   PSA+24                                                   04376000
@NM00052 EQU   FLCICCW2+4                                               04377000
FLCCVT   EQU   FLCICCW2                                                 04378000
FLCICCW1 EQU   FLCROPSW                                                 04379000
FLCIPPSW EQU   FLCRNPSW                                                 04380000
*                                      END UNREFERENCED COMPONENTS      04381000
@RF00112 EQU   @RC00107                                                 04382000
@RC00110 EQU   @RC00107                                                 04383000
@RC00203 EQU   @RC00199                                                 04384000
@RT00286 EQU   ABNEXIT                                                  04385000
@RC00195 EQU   MAINLOOP                                                 04386000
@RC00331 EQU   @EL00002                                                 04387000
@RC00377 EQU   @RC00376                                                 04388000
@PB00007 EQU   @EL00001                                                 04389000
@RC00250 EQU   @RC00195                                                 04390000
@RC00224 EQU   @RC00195                                                 04391000
@RC00197 EQU   @RC00195                                                 04392000
@RC00378 EQU   @RC00377                                                 04393000
@PB00006 EQU   @PB00007                                                 04394000
@RC00215 EQU   @RC00197                                                 04395000
@PB00005 EQU   @PB00006                                                 04396000
@PB00004 EQU   @PB00005                                                 04397000
@PB00003 EQU   @PB00004                                                 04398000
@PB00002 EQU   @PB00003                                                 04399000
@ENDDATA EQU   *                                                        04400000
         END   DMKMSS                                                   04401000