         TITLE 'DMKMSS                                                 *00001000
                        '                                               00002000
DMKMSS   CSECT ,                                                   0001 00003000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00004000
         BALR  @11,0                                               0001 00005000
@PSTART  DS    0H                                                  0001 00006000
         USING @PSTART,@11                                         0001 00007000
*                                                                ##C##  00008000
        MODESET MODE=SUP,KEY=ZERO    PLACE IN SUPERVISOR STATE   ##C##  00009000
        L R2,@SIZDATD                LOAD DYNAMIC AREA SIZE      ##C##  00010000
        GETMAIN R,LV=(2),SP=241      GET THE VIRT. STORAGE       ##C##  00011000
        LR R10,R1                                                ##C##  00012000
        USING @DATD,R10              ESTABLISH ADDRESSIBILITY    ##C##  00013000
        ST R13,@SA00001+4            CHAIN SAVE AREAS ....       ##C##  00014000
        LA R15,@SA00001                                          ##C##  00015000
        ST R15,8(,R13)                                           ##C##  00016000
        LR R13,R15                                               ##C##  00017000
*   COMMDCB=ACTDCB;                 /* COPY THE DCB TO WORKAREA      */ 00018000
         MVC   COMMDCB(92),ACTDCB                                  0103 00019000
*   MSSECB=ZEROFULL;                                               0104 00020000
         SLR   @12,@12                                             0104 00021000
         ST    @12,MSSECB                                          0104 00022000
*   RCODE=ZEROFULL;                                                0105 00023000
         STH   @12,RCODE                                           0105 00024000
*   CPUID=CPUID&&CPUID;             /* CLEAR THE CPU ID              */ 00025000
         XC    CPUID(5),CPUID                                      0106 00026000
*   COMMPTR=ADDR(BUFFER);           /* MSSCOM MACRO MAPPING        0107 00027000
*                                      ESTABLISHED                   */ 00028000
         LA    COMMPTR,BUFFER                                      0107 00029000
*   OPENLIST=HEX80;                                                0108 00030000
         L     @12,HEX80                                           0108 00031000
         ST    @12,OPENLIST                                        0108 00032000
*   DCBPTR=ADDR(COMMDCB);           /* ESTABLISH DCB MAPPING         */ 00033000
         LA    DCBPTR,COMMDCB                                      0109 00034000
*   GEN(OPEN (COMMDCB,OUTPUT),MF=(E,OPENLIST));                    0110 00035000
*                                                                  0110 00036000
         OPEN (COMMDCB,OUTPUT),MF=(E,OPENLIST)                          00037000
*/* **************************************************************** */ 00038000
*/*    SET THE MSSINIT BIT TO '1'B (ON) IF THE MSS WAS               */ 00039000
*/*    INITILIZED CORRECTLY, OTHERWISE SET IT TO '0'B (OFF)          */ 00040000
*/* **************************************************************** */ 00041000
*                                                                  0111 00042000
*   MSSINIT=OFF;                                                   0111 00043000
*   INITCTR=OFF;                    /* INITIALIZE COUNTER    @VA11319*/ 00044000
         NI    MSSINIT,B'01011111'                                 0112 00045000
*   IF CVTICB^=ZEROFULL THEN        /* DOES CONTROL BLOCK EXIST      */ 00046000
         L     @12,CVTPTR                                          0113 00047000
         L     @12,CVTEXT2(,@12)                                   0113 00048000
         L     @12,CVTICB(,@12)                                    0113 00049000
         LTR   @12,@12                                             0113 00050000
         BZ    @RF00113                                            0113 00051000
*     DO;                           /* YES                           */ 00052000
*       ICBPTR=CVTICB;                                             0115 00053000
         LR    ICBPTR,@12                                          0115 00054000
*RECHEK:                                                           0116 00055000
*       IF ICBI=ON THEN                                            0116 00056000
RECHEK   L     @12,CVTPTR                                          0116 00057000
         L     @12,CVTEXT2(,@12)                                   0116 00058000
         L     @12,CVTICB(,@12)                                    0116 00059000
         TM    ICBI(@12),B'10000000'                               0116 00060000
         BNO   @RF00116                                            0116 00061000
*         MSSINIT=ON;               /*                       @VA11319*/ 00062000
         OI    MSSINIT,B'10000000'                                 0117 00063000
*       ELSE                                                       0118 00064000
*         IF INITCTR=OFF THEN       /*                       @VA11319*/ 00065000
         B     @RC00116                                            0118 00066000
@RF00116 TM    INITCTR,B'00100000'                                 0118 00067000
         BNZ   @RF00118                                            0118 00068000
*           DO;                     /*                       @VA11319*/ 00069000
*             INITCTR=ON;           /* LET EVERYONE KNOW BEEN HERE 0120 00070000
*                                                            @VA11319*/ 00071000
         OI    INITCTR,B'00100000'                                 0120 00072000
*             GEN CODE;                                            0121 00073000
*                                                     /*   @VA11319 */  00074000
           WTO ' DMKMSS WAITING 10 MINUTES FOR MSS INITIALIZATION',   XX00075000
               DESC=(4),ROUTCDE=(2)                                     00076000
           STIMER WAIT,DINTVL=WAITTIME                                  00077000
*             GOTO RECHEK;          /*                       @VA11319*/ 00078000
         B     RECHEK                                              0122 00079000
*           END;                    /*                       @VA11319*/ 00080000
*     END;                                                         0124 00081000
*   ELSE                                                           0125 00082000
*     ;                             /*                       @VA11343*/ 00083000
@RF00113 DS    0H                                                  0126 00084000
*   TCBPTR=PSATOLD;                 /* ADDRESS THE TCB       @VA13697*/ 00085000
@RC00113 L     @12,PSATOLD                                         0126 00086000
         ST    @12,TCBPTR                                          0126 00087000
*   TCBAFFN=TCBAFFN&&TCBAFFN;       /* CLEAR AFFINITY FLAGS  @VA13697*/ 00088000
         XC    TCBAFFN(2,@12),TCBAFFN(@12)                         0127 00089000
*   PCCATBL=CVTPCCAT;               /* ADDRESS PCCA TABLE    @VA13697*/ 00090000
         L     @12,CVTPTR                                          0128 00091000
         L     @12,CVTPCCAT(,@12)                                  0128 00092000
         ST    @12,PCCATBL                                         0128 00093000
*   DO I=1 TO 16;                   /* LOOP ON 16 AFFINITIES @VA13697*/ 00094000
         LA    @12,1                                               0129 00095000
         STC   @12,I                                               0129 00096000
@DL00129 DS    0H                                                  0130 00097000
*     PCCAPTR=PCCAT00P(I);          /*                       @VA13697*/ 00098000
         SLA   @12,2                                               0130 00099000
         L     @15,CVTPTR                                          0130 00100000
         L     @15,CVTPCCAT(,@15)                                  0130 00101000
         AL    @15,@CF03221                                        0130 00102000
         L     @12,PCCAT00P(@12,@15)                               0130 00103000
         ST    @12,PCCAPTR                                         0130 00104000
*     IF PCCACPID(1:2)='C6C6'X THEN /* RUNNING ON VM?        @VA13697*/ 00105000
         CLC   PCCACPID(2,@12),@CB02973                            0131 00106000
         BNE   @RF00131                                            0131 00107000
*       TCBAFFN=TCBAFFN|PCCACAFM;   /* YES-SET AFFINITY      @VA13697*/ 00108000
         L     @15,TCBPTR                                          0132 00109000
         OC    TCBAFFN(2,@15),PCCACAFM(@12)                        0132 00110000
*     ELSE                                                         0133 00111000
*       ;                           /* NO-THEN SET NOTHING   @VA13697*/ 00112000
@RF00131 DS    0H                                                  0134 00113000
*   END;                            /* LOOKED AT ALL 16      @VA13697*/ 00114000
         LA    @12,1                                               0134 00115000
         SLR   @15,@15                                             0134 00116000
         IC    @15,I                                               0134 00117000
         ALR   @12,@15                                             0134 00118000
         STC   @12,I                                               0134 00119000
         C     @12,@CF00060                                        0134 00120000
         BNH   @DL00129                                            0134 00121000
*   GEN CODE;                                                      0135 00122000
*                                                                  0135 00123000
*                                    /*                     @VA13697*/  00124000
        STIMER WAIT,BINTVL=SPTIME    /*SWAP TO VM SIDE      @VA13697*/  00125000
*/* **************************************************************** */ 00126000
*/*         SET A FLAG TO INDICATE THAT DMKMSS IS RUNNING            */ 00127000
*/*         IN A VIRTUAL MACHINE,ELSE SET FLAG TO ZERO               */ 00128000
*/* **************************************************************** */ 00129000
*                                                                  0136 00130000
*   VIRTFLAG=OFF;                   /* CLEAR VIRTUAL MACH. FLAG      */ 00131000
         NI    VIRTFLAG,B'10111111'                                0136 00132000
*   GEN(STIDP VIRT);                /* ISSUE STORE CPU ID INST. THIS    00133000
*                                      WILL                          */ 00134000
         STIDP VIRT                                                     00135000
*/*                               SET BYTE ZERO OF VIRT TO 'FF'X IF  */ 00136000
*/*                               DMKMSS IS RUNNING IN A VIRTUAL MACH*/ 00137000
*                                                                  0138 00138000
*   IF VIRT(1)=VIRTTEST THEN        /* SET FLAG IF OK                */ 00139000
         CLC   VIRT(1),VIRTTEST                                    0138 00140000
         BNE   @RF00138                                            0138 00141000
*     VIRTFLAG=ON;                                                 0139 00142000
         OI    VIRTFLAG,B'01000000'                                0139 00143000
*   ELSE                                                           0140 00144000
*     ;                             /*                       @VA11343*/ 00145000
@RF00138 DS    0H                                                  0141 00146000
*/* **************************************************************** */ 00147000
*/*       IF DCB OPENED OK AND THE MSS IS INITILIZED AND             */ 00148000
*/*         DMKMSS IS RUNNING IN A VIRTUAL MACHINE THEN              */ 00149000
*/*         CONTINUE TO PROCESS, ELSE ERROR MESSAGE AND EXIT         */ 00150000
*/* **************************************************************** */ 00151000
*                                                                  0141 00152000
*   IF DCBOFOPN=ON&MSSINIT=ON&VIRTFLAG=ON THEN                     0141 00153000
         TM    DCBOFOPN+40(DCBPTR),B'00010000'                     0141 00154000
         BNO   @RF00141                                            0141 00155000
         TM    MSSINIT,B'11000000'                                 0141 00156000
         BNO   @RF00141                                            0141 00157000
*L1:                                                               0142 00158000
*     DO;                                                          0142 00159000
*                                                                  0142 00160000
L1       DS    0H                                                  0143 00161000
*/* **************************************************************** */ 00162000
*/*      FOLLOW POINTERS THROUGH DCB,DEB AND UCB CONTROL             */ 00163000
*/*      BLOCKS TO FIND THE CHANNEL/UNIT ADDRESS ASSIGNED            */ 00164000
*/*      BY THE VS SCHEDULER. PLACE THE VALUE IN REGISTER 4.         */ 00165000
*/* **************************************************************** */ 00166000
*                                                                  0143 00167000
*       CALL RPLYPROC;              /* ISSUE TERMINATION MSG @VA12978*/ 00168000
         BAL   @14,RPLYPROC                                        0143 00169000
*       DEBPTR=DCBDEBAD;            /* ESTABLISH DEB ADDRESSING      */ 00170000
         L     DEBPTR,DCBDEBAD+40(,DCBPTR)                         0144 00171000
*       DEBDAPTR=ADDR(DEBBASND);                                   0145 00172000
         LA    @12,DEBBASND(,DEBPTR)                               0145 00173000
         ST    @12,DEBDAPTR                                        0145 00174000
*       UCBPTR=DEBUCBAD;            /* ESTABLISH UCB ADDRESSING      */ 00175000
         L     UCBPTR,DEBUCBAD(,@12)                               0146 00176000
*       TEMP=UCBCHA&MASK2;                                         0147 00177000
         SLR   @12,@12                                             0147 00178000
         IC    @12,UCBCHA(,UCBPTR)                                 0147 00179000
         SLR   @15,@15                                             0147 00180000
         IC    @15,MASK2                                           0147 00181000
         NR    @12,@15                                             0147 00182000
         ST    @12,TEMP                                            0147 00183000
*       SLL(TEMP,8);                                               0148 00184000
         SLL   @12,8                                               0148 00185000
         ST    @12,TEMP                                            0148 00186000
*       R4=TEMP|UCBUA;              /* PUT THE CHANNEL UNIT ADDRESS     00187000
*                                      IN REG 4                      */ 00188000
         SLR   R4,R4                                               0149 00189000
         IC    R4,UCBUA(,UCBPTR)                                   0149 00190000
         O     R4,TEMP                                             0149 00191000
*/* **************************************************************** */ 00192000
*/*    SET POINTER IN THE COMMUNICATIONS UCB TO POINT TO ECB         */ 00193000
*/* **************************************************************** */ 00194000
*                                                                  0150 00195000
*       ADECB=ADDR(MSSECB);         /* PLACE THE ADDRESS OF THE ECB     00196000
*                                      TO                            */ 00197000
         LA    @12,MSSECB                                          0150 00198000
         STCM  @12,7,ADECB                                         0150 00199000
*       ADECB=ADECB|MASK;           /* TURN ON HIGH ORDER BIT TO   0151 00200000
*                                      INDICATE CROSS MEMORY POST    */ 00201000
         O     @12,MASK                                            0151 00202000
         STCM  @12,7,ADECB                                         0151 00203000
*       SAVE1=MSSECBAD;             /* SAVE FOR UCB RESTORATION    0152 00204000
*                                                            @VA11318*/ 00205000
         L     @15,MSSECBAD(,UCBPTR)                               0152 00206000
         ST    @15,SAVE1                                           0152 00207000
*       MSSECBAD=ADECB;             /* POSTED AT UNUSED LOCATION IN     00208000
*                                      UCB                           */ 00209000
         ST    @12,MSSECBAD(,UCBPTR)                               0153 00210000
*       RFY                                                        0154 00211000
*         R1 UNRSTD;                                               0154 00212000
*       SAVE2=MSSASCBA;             /* SAVE FOR UCB RESTORATION    0155 00213000
*                                                            @VA11318*/ 00214000
         L     @12,MSSASCBA(,UCBPTR)                               0155 00215000
         ST    @12,SAVE2                                           0155 00216000
*       MSSASCBA=PSAAOLD;                                          0156 00217000
*                                                                  0156 00218000
         L     @12,PSAAOLD                                         0156 00219000
         ST    @12,MSSASCBA(,UCBPTR)                               0156 00220000
*/* **************************************************************** */ 00221000
*/*      FIND MSC'S UCB AND INSERT THE INDEX TO THE ATTN TABLE,      */ 00222000
*/*      FOUND THERE,INTO THE COMMUNICATIONS UCB.                    */ 00223000
*/* **************************************************************** */ 00224000
*                                                                  0157 00225000
*       RFY                                                        0157 00226000
*         R12 RSTD;                                                0157 00227000
*       ICBPTR=CVTICB;              /* GET POINTER TO IEZICB         */ 00228000
         L     @15,CVTPTR                                          0158 00229000
         L     @15,CVTEXT2(,@15)                                   0158 00230000
         L     @15,CVTICB(,@15)                                    0158 00231000
         LR    ICBPTR,@15                                          0158 00232000
*       R12=ICBPUCB;                /* GET POINTER TO MSC'S UCB AND  */ 00233000
         L     R12,ICBPUCB(,@15)                                   0159 00234000
*       RFY                                                        0160 00235000
*         UCBOB BASED(R12);         /* ESTABLISH THE MAPPING FOR UCB */ 00236000
*       INDEX=UCBATI;               /* GET THE ATTN ROUTINE INDEX    */ 00237000
         L     @15,UCBEXTPT(,R12)                                  0161 00238000
         SLR   @14,@14                                             0161 00239000
         IC    @14,UCBATI(,@15)                                    0161 00240000
         ST    @14,INDEX                                           0161 00241000
*       RFY                                                        0162 00242000
*         UCBOB BASED(UCBPTR);      /* REESTABLISH COMM. UCB MAPPING */ 00243000
*       SAVE3=UCBATI;               /* SAVE FOR UCB RESTORATION    0163 00244000
*                                                            @VA11318*/ 00245000
         L     @15,UCBEXTPT(,UCBPTR)                               0163 00246000
         SLR   @14,@14                                             0163 00247000
         IC    @14,UCBATI(,@15)                                    0163 00248000
         ST    @14,SAVE3                                           0163 00249000
*       UCBATI=INDEX;               /* PUT INDEX IN COMM. UCB        */ 00250000
         L     @14,INDEX                                           0164 00251000
         STC   @14,UCBATI(,@15)                                    0164 00252000
*       RFY                                                        0165 00253000
*         R12 UNRSTD;                                              0165 00254000
*                                                                  0165 00255000
*/* **************************************************************** */ 00256000
*/*           BUILD AND ISSUE THE DIAGNOSE INSTRUCTION               */ 00257000
*/*           TO TELL VM THE CHANNEL/UNIT ADDRESS.                   */ 00258000
*/*           REG 4 CONTAINS THE CHANNEL UNIT ADDRESS.               */ 00259000
*/*           SET UP RETURN PATH FOR ABEND EXIT... STAE MACRO        */ 00260000
*/* **************************************************************** */ 00261000
*                                                                  0166 00262000
*       R5=ADDCODE;                                                0166 00263000
         SLR   R5,R5                                               0166 00264000
*       GEN( EX R0,DIAGNOSE );                                     0167 00265000
          EX R0,DIAGNOSE                                                00266000
*       GEN( STAE  ABNEXIT );       /* DEFINE LABEL FOR ABEND EXIT   */ 00267000
          STAE  ABNEXIT                                                 00268000
*       CALL QRYMSC;                /* GET VUA CONFIGURATION FOR CP     00269000
*                                                            @VA11343*/ 00270000
         BAL   @14,QRYMSC                                          0169 00271000
*       RFY                                                        0170 00272000
*         R15 RSTD;                 /*                       @VA11343*/ 00273000
*       TEMP3=R15;                  /* SAVE RETURN CODE OVER MACROS     00274000
*                                                            @VA11343*/ 00275000
         ST    R15,TEMP3                                           0171 00276000
*       IF R15=4 THEN                                              0172 00277000
         C     R15,@CF00109                                        0172 00278000
         BNE   @RF00172                                            0172 00279000
*         DO;                       /* RC^=0 INDICATES ERROR @VA11343*/ 00280000
*           DO;                     /* WTO('DMKMSS ERROR READING MSS    00281000
*                                      CONFIGURATION TABLE') DESC(4)    00282000
*                                      ROUTCDE(2)                    */ 00283000
*             RFY                                                  0175 00284000
*               GPR01P RSTD;        /* RESTRICT REG 1                */ 00285000
*             GPR01P=ADDR(I03506);  /* ADDRESS CONTROL PROGRAM LIST  */ 00286000
         LA    GPR01P,I03506                                       0176 00287000
*             SVC(35);              /* ISSUE WTO SVC                 */ 00288000
         SVC   35                                                  0177 00289000
*             RFY                                                  0178 00290000
*               GPR01P UNRSTD;      /* RELEASE REG 1                 */ 00291000
*           END;                    /* WTO('DMKMSS ERROR READING MSS    00292000
*                                      CONFIGURATION TABLE') DESC(4)    00293000
*                                      ROUTCDE(2)                    */ 00294000
*           DECLARE                 /* WTO PARAMETER LIST            */ 00295000
*             1 I03506 STATIC BDY(WORD),                           0180 00296000
*              2 I0350601 FIXED(15) INIT(48),/* TEXT LENGTH          */ 00297000
*              2 I0350602 BIT(16) INIT('1000000000000000'B),/* MCS 0180 00298000
*                                      FLAG                          */ 00299000
*              2 I0350603 CHAR(44) INIT(                           0180 00300000
*                    'DMKMSS ERROR READING MSS CONFIGURATION TABLE'),   00301000
*                                   /* MESSAGE TEXT                  */ 00302000
*              2 I0350604 BIT(16) INIT('0001000000000000'B),/*     0180 00303000
*                                      DESCRIPTOR CODES              */ 00304000
*              2 I0350605 BIT(16) INIT('0100000000000000'B);/*     0180 00305000
*                                      ROUTING CODES         @VA11343*/ 00306000
*         END;                      /*                       @VA11343*/ 00307000
*       ELSE                                                       0182 00308000
*         IF R15=8 THEN                                            0182 00309000
         B     @RC00172                                            0182 00310000
@RF00172 C     R15,@CF00072                                        0182 00311000
         BNE   @RF00182                                            0182 00312000
*           DO;                     /* RC^=0 INDICATES ERROR @VA11343*/ 00313000
*             DO;                   /* WTO('DMKMSS CPUID NOT FOUND IN   00314000
*                                      MSS CONFIGURATION TABLES')  0184 00315000
*                                      DESC(4) ROUTCDE(2)            */ 00316000
*               RFY                                                0185 00317000
*                 GPR01P RSTD;      /* RESTRICT REG 1                */ 00318000
*               GPR01P=ADDR(I03508);/* ADDRESS CONTROL PROGRAM LIST  */ 00319000
         LA    GPR01P,I03508                                       0186 00320000
*               SVC(35);            /* ISSUE WTO SVC                 */ 00321000
         SVC   35                                                  0187 00322000
*               RFY                                                0188 00323000
*                 GPR01P UNRSTD;    /* RELEASE REG 1                 */ 00324000
*             END;                  /* WTO('DMKMSS CPUID NOT FOUND IN   00325000
*                                      MSS CONFIGURATION TABLES')  0189 00326000
*                                      DESC(4) ROUTCDE(2)            */ 00327000
*             DECLARE               /* WTO PARAMETER LIST            */ 00328000
*               1 I03508 STATIC BDY(WORD),                         0190 00329000
*                2 I0350801 FIXED(15) INIT(54),/* TEXT LENGTH        */ 00330000
*                2 I0350802 BIT(16) INIT('1000000000000000'B),/* MCS    00331000
*                                      FLAG                          */ 00332000
*                2 I0350803 CHAR(50) INIT(                         0190 00333000
*'DMKMSS CPUID NOT FOUND IN MSS CONFIGURATION TABLES'),/* MESSAGE  0190 00334000
*                                      TEXT                          */ 00335000
*                2 I0350804 BIT(16) INIT('0001000000000000'B),/*   0190 00336000
*                                      DESCRIPTOR CODES              */ 00337000
*                2 I0350805 BIT(16) INIT('0100000000000000'B);/*   0190 00338000
*                                      ROUTING CODES         @VA11343*/ 00339000
*           END;                    /*                       @VA11343*/ 00340000
*         ELSE                                                     0192 00341000
*           IF R15=12 THEN                                         0192 00342000
         B     @RC00182                                            0192 00343000
@RF00182 C     R15,@CF02226                                        0192 00344000
         BNE   @RF00192                                            0192 00345000
*             DO;                   /* RC^=0 INDICATES ERROR @VA11343*/ 00346000
*               DO;                 /* WTO('DMKMSS ERROR CREATING MSS   00347000
*                                      CONFIGURATION TABLE') DESC(4)    00348000
*                                      ROUTCDE(2)                    */ 00349000
*                 RFY                                              0195 00350000
*                   GPR01P RSTD;    /* RESTRICT REG 1                */ 00351000
*                 GPR01P=ADDR(I03510);/* ADDRESS CONTROL PROGRAM LIST*/ 00352000
         LA    GPR01P,I03510                                       0196 00353000
*                 SVC(35);          /* ISSUE WTO SVC                 */ 00354000
         SVC   35                                                  0197 00355000
*                 RFY                                              0198 00356000
*                   GPR01P UNRSTD;  /* RELEASE REG 1                 */ 00357000
*               END;                /* WTO('DMKMSS ERROR CREATING MSS   00358000
*                                      CONFIGURATION TABLE') DESC(4)    00359000
*                                      ROUTCDE(2)                    */ 00360000
*               DECLARE             /* WTO PARAMETER LIST            */ 00361000
*                 1 I03510 STATIC BDY(WORD),                       0200 00362000
*                  2 I0351001 FIXED(15) INIT(49),/* TEXT LENGTH      */ 00363000
*                  2 I0351002 BIT(16) INIT('1000000000000000'B),/* 0200 00364000
*                                      MCS FLAG                      */ 00365000
*                  2 I0351003 CHAR(45) INIT(                       0200 00366000
*                        'DMKMSS ERROR CREATING MSS CONFIGURATION TABLE 00367000
*                        ),         /* MESSAGE TEXT                  */ 00368000
*                  2 I0351004 BIT(16) INIT('0001000000000000'B),/* 0200 00369000
*                                      DESCRIPTOR CODES              */ 00370000
*                  2 I0351005 BIT(16) INIT('0100000000000000'B);/* 0200 00371000
*                                      ROUTING CODES         @VA11343*/ 00372000
*             END;                  /*                       @VA11343*/ 00373000
*           ELSE                                                   0202 00374000
*             ;                     /*                       @VA11343*/ 00375000
@RF00192 DS    0H                                                  0203 00376000
*       R15=TEMP3;                  /* RESTORE RETURN CODE TO PROPER    00377000
*                                      REG                   @VA11343*/ 00378000
@RC00182 DS    0H                                                  0203 00379000
@RC00172 L     R15,TEMP3                                           0203 00380000
*       IF R15^=0 THEN                                             0204 00381000
         LTR   R15,R15                                             0204 00382000
         BZ    @RF00204                                            0204 00383000
*         DO;                       /* TERMINATE CEN SERVER ON ERROR    00384000
*                                                            @VA11343*/ 00385000
*           CALL DIAG(EXITABND);    /* TELL CP WE'RE               0206 00386000
*                                      TERMINATING@VA11343           */ 00387000
         LA    @01,@AL00206                                        0206 00388000
         BAL   @14,DIAG                                            0206 00389000
*           GO TO FINISH;           /* BRANCH PAST REST OF MAIN LOOP    00390000
*                                                            @VA11343*/ 00391000
         B     FINISH                                              0207 00392000
*         END;                      /*                       @VA11343*/ 00393000
*       ELSE                                                       0209 00394000
*         ;                         /*                       @VA11343*/ 00395000
@RF00204 DS    0H                                                  0210 00396000
*       RFY                                                        0210 00397000
*         R15 UNRSTD;               /*                       @VA11343*/ 00398000
*/* **************************************************************** */ 00399000
*/*     GO INTO WAIT STATE UNTIL VM ISSUES ATTN. INTERRUPT AND       */ 00400000
*/*     THE MSSECB IS POSTED.                                        */ 00401000
*/* **************************************************************** */ 00402000
*                                                                  0211 00403000
*       GOTO WAIT1;                 /*                       @VA11318*/ 00404000
         B     WAIT1                                               0211 00405000
*                                                                  0212 00406000
*/* **************************************************************** */ 00407000
*/*   THE FOLLOWING LOOP WILL RUN IN THE VS MACHINE AS LONG AS MSS   */ 00408000
*/*   SUPPORT IS IN EFFECT. THE PROGRAM WILL BE IN WAIT STATE IF     */ 00409000
*/*   THERE ARE NO REQUESTS TO BE PROCESSED.                         */ 00410000
*/* **************************************************************** */ 00411000
*                                                                  0212 00412000
*MAINLOOP:                                                         0212 00413000
*                                                                  0212 00414000
*/* **************************************************************** */ 00415000
*/*        ISSUE THE DIAGNOSE TO REQUEST WORK FROM VM                */ 00416000
*/* **************************************************************** */ 00417000
*                                                                  0212 00418000
*       CALL DIAG(REQCODE);         /* ASK CP FOR WORK TO DO         */ 00419000
MAINLOOP LA    @01,@AL00212                                        0212 00420000
         BAL   @14,DIAG                                            0212 00421000
*       IF MSSFLAG1^=ZERO THEN      /* IS THERE ANY TO DO?   @VA11343*/ 00422000
*                                                                  0213 00423000
         CLI   MSSFLAG1(COMMPTR),0                                 0213 00424000
         BE    @RF00213                                            0213 00425000
*         /***********************************************************/ 00426000
*         /*                                                         */ 00427000
*         /* *********************************************************/ 00428000
*         /* WORK IS REQUESTED BY VM                                 */ 00429000
*         /* *********************************************************/ 00430000
*         /*                                                         */ 00431000
*         /***********************************************************/ 00432000
*                                                                  0214 00433000
*L2:                                                               0214 00434000
*         DO;                       /*                       @VA11343*/ 00435000
L2       DS    0H                                                  0215 00436000
*           IF MOUNT=ON THEN                                       0215 00437000
         TM    MOUNT(COMMPTR),B'10000000'                          0215 00438000
         BNO   @RF00215                                            0215 00439000
*             DO;                   /* IS MOUNT BIT SET ?    @VA11343*/ 00440000
*                                                                  0216 00441000
*               /*****************************************************/ 00442000
*               /*                                                   */ 00443000
*               /* ***************************************************/ 00444000
*               /* MOUNT IS REQUESTED                                */ 00445000
*               /* ***************************************************/ 00446000
*               /*                                                   */ 00447000
*               /*****************************************************/ 00448000
*                                                                  0217 00449000
*/* **************************************************************** */ 00450000
*/* IN ORDER TO KEEP LOW THE AVERAGE AMOUNT OF TIME REQUIRED TO PER- */ 00451000
*/* FORM A MOUNT, AN ALGORITHM FOR DATA REUSE IS IMPLEMENTED. THIS   */ 00452000
*/* ALGORITHM IS DESIGNED TO WORK WITH EXISTING CODE IN THIS MODULE  */ 00453000
*/* (THE CENTRAL SERVER) AND IN CP, WITH MINIMAL CHANGE REQUIRED TO  */ 00454000
*/* EITHER.                                                          */ 00455000
*/*                                                                  */ 00456000
*/* CP INITIALLY PASSES THE VUA AND ITS ASSOCIATED SDG NUMBER IN THE */ 00457000
*/* MSSCOM FOR THE MOUNT REQUEST. THE 'RETRY' BIT IS TURNED ON IF    */ 00458000
*/* THE REQUEST IS FOR A NON-SPECIFIC VUA. IF THE BIT IS OFF, THEN   */ 00459000
*/* THE MOUNT MUST BE PERFORMED ON THAT PARTICULAR VUA, OR NOT AT    */ 00460000
*/* ALL. THEREFORE, WHENEVER THE 'RETRY' BIT IS OFF, THE MOUNT ORDER */ 00461000
*/* WILL BE ISSUED DIRECTLY; AND WHENEVER THE BIT IS ON, THE MOUNTED */ 00462000
*/* VOLUME TABLE WILL FIRST BE CHECKED FOR ANY SPACE IN ANY SDG      */ 00463000
*/* CURRENTLY ALLOCATED FOR THE REQUESTED VOLUME. IF NONE IS FOUND,  */ 00464000
*/* THEN THE ORIGINAL ORDER IS ISSUED. HOWEVER, IF SPACE IS FOUND    */ 00465000
*/* FOR THE VOLUME, THEN THE SDG OF THAT SPACE IS COMPARED WITH THE  */ 00466000
*/* SDG OF THE VUA INITIALLY SELECTED FOR THIS MOUNT REQUEST. IF THE */ 00467000
*/* TWO ARE EQUAL, THEN THE MOUNT REQUEST IS ISSUED JUST AS IT IS,   */ 00468000
*/* SINCE IT MAY NOT HAVE TO REPICK A CARTRIDGE. HOWEVER, WHEN THE   */ 00469000
*/* SDG'S DON'T MATCH, THE CORRECT SDG (THE ONE IN WHICH SPACE IS    */ 00470000
*/* CURRENTLY ALLOCATED) IS PLACED INTO THE MSSCOM, AND AN ERROR     */ 00471000
*/* RETURN WITH RETURN CODE 10 IS EFFECTED.                          */ 00472000
*/* **************************************************************** */ 00473000
*                                                                  0217 00474000
*               IF MSSRETRY=ON THEN                                0217 00475000
         TM    MSSRETRY(COMMPTR),B'00001000'                       0217 00476000
         BNO   @RF00217                                            0217 00477000
*                 DO;               /* IS MOUNT RETRIABLE?@VA12420   */ 00478000
*                   CALL QRYPROC;   /* YES - THEN QRY MVT    @VA12420*/ 00479000
         BAL   @14,QRYPROC                                         0219 00480000
*                   RFY                                            0220 00481000
*                     R15 RSTD;     /* RESTRICT R15          @VA12420*/ 00482000
*                   IF R15='0'X THEN                               0221 00483000
         LTR   R15,R15                                             0221 00484000
         BNZ   @RF00221                                            0221 00485000
*                     DO;           /* QUERY GO OKAY?        @VA12420*/ 00486000
*                       CALL MNTPROC;/* YES - ISSUE MOUNT    @VA12420*/ 00487000
         BAL   @14,MNTPROC                                         0223 00488000
*                     END;          /*                       @VA12420*/ 00489000
*                   ELSE                                           0225 00490000
*                     DO;           /* NO - THEN RC10        @VA12420*/ 00491000
         B     @RC00221                                            0225 00492000
@RF00221 DS    0H                                                  0226 00493000
*                       RSNCODE=R15;/* SET THAT RSN CODE     @VA12420*/ 00494000
         STCM  R15,15,RSNCODE                                      0226 00495000
*                       MSSRC=RSNCODE(3:4);/* PUT RC IN MSSCOM     0227 00496000
*                                                            @VA12420*/ 00497000
         MVC   MSSRC(2,COMMPTR),RSNCODE+2                          0227 00498000
*                     END;          /*                       @VA12420*/ 00499000
*                 END;              /*                       @VA12420*/ 00500000
*               ELSE                                               0230 00501000
*                 DO;               /* NO - NOT RETRIABLE    @VA12420*/ 00502000
         B     @RC00217                                            0230 00503000
@RF00217 DS    0H                                                  0231 00504000
*                   CALL MNTPROC;   /* ISSUE MOUNT ORDER     @VA12420*/ 00505000
         BAL   @14,MNTPROC                                         0231 00506000
*                 END;              /*                       @VA12420*/ 00507000
*               IF R15=0 THEN                                      0233 00508000
@RC00217 LTR   R15,R15                                             0233 00509000
         BNZ   @RF00233                                            0233 00510000
*                 DO;               /* GOOD RETURN CODE?     @VA12420*/ 00511000
*                   RFY                                            0235 00512000
*                     R15 UNRSTD;   /* FREE UP R15           @VA12420*/ 00513000
*                   CALL DIAG(DONEOK);/* YES - GOOD RETURN   @VA12420*/ 00514000
         LA    @01,@AL00236                                        0236 00515000
         BAL   @14,DIAG                                            0236 00516000
*                 END;              /*                       @VA12420*/ 00517000
*               ELSE                                               0238 00518000
*                 DO;               /* NO - THEN...          @VA12420*/ 00519000
         B     @RC00233                                            0238 00520000
@RF00233 DS    0H                                                  0239 00521000
*                   CALL MSSERROR;  /* ERROR RETURN          @VA12420*/ 00522000
         BAL   @14,MSSERROR                                        0239 00523000
*                 END;              /*                       @VA12420*/ 00524000
*             END;                  /*                       @VA12420*/ 00525000
*/* **************************************************************** */ 00526000
*/* IF A MOUNT WAS NOT REQUESTED, MAYBE A DEMOUNT WAS.               */ 00527000
*/* **************************************************************** */ 00528000
*                                                                  0242 00529000
*           ELSE                                                   0242 00530000
*             IF DEMOUNT=ON THEN    /* DEMOUNT BIT SET?      @VA11343*/ 00531000
*                                                                  0242 00532000
         B     @RC00215                                            0242 00533000
@RF00215 TM    DEMOUNT(COMMPTR),B'00100000'                        0242 00534000
         BNO   @RF00242                                            0242 00535000
*               /*****************************************************/ 00536000
*               /*                                                   */ 00537000
*               /* ********************************************      */ 00538000
*               /* DEMOUNT WAS REQUESTED DO A DEMOUNT BY VUA...DMFLAG*/ 00539000
*               /* IS SET                                            */ 00540000
*               /* ********************************************      */ 00541000
*               /*                                                   */ 00542000
*               /*****************************************************/ 00543000
*                                                                  0243 00544000
*               DO;                                                0243 00545000
*                                                                  0243 00546000
*                 /***************************************************/ 00547000
*                 /*                                                 */ 00548000
*                 /* MACRO INVOCATION:                       @ZA28964*/ 00549000
*                 /* ICBMNTDE MF(E,DMOBLK)TYPE(DMNT)VOLID(MSSSER)VUA(*/ 00550000
*                 /* MSSVUA)FLAGS(DMFLAG)HOSTID(CPUID)       @ZA28964*/ 00551000
*                 /* *************************************************/ 00552000
*                 /* ********                                @Y30LB02*/ 00553000
*                 /* MACMEAN MSSC MOUNT/DEMOUNT MACRO        @Y30LB02*/ 00554000
*                 /* VERSION - VS/2 REL 3 77/12/15 LEVEL 04  @ZA28964*/ 00555000
*                 /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.        */ 00556000
*                 /*                                         @Y30LB02*/ 00557000
*                 /* THE LIST FORM OF THIS MACRO SHOULD BE   @Y30LB02*/ 00558000
*                 /* INVOKED FIRST IN ORDER TO SET UP NECESSARY      */ 00559000
*                 /*                                         @Y30LB02*/ 00560000
*                 /* DECLARES. IF THE COMPLETE ARGUMENT IS   @Y30LB02*/ 00561000
*                 /* SPECIFIED THE REQ BLOCK WILL BE ZEROED. @Y30LB02*/ 00562000
*                 /* *************************************************/ 00563000
*                 /* ********                                @Y30LB02*/ 00564000
*                 /*                                                 */ 00565000
*                 /***************************************************/ 00566000
*                                                                  0244 00567000
*                 RFY                                              0244 00568000
*                   MDREG1 RSTD;    /* RESTRICT REG 1        @Y30LB02*/ 00569000
*                 MDREG1=ADDR(DMOBLK);/* R1 PTR TO REQ BLOCK @Y30LB02*/ 00570000
         LA    MDREG1,DMOBLK                                       0245 00571000
*                 DMLEN='1C'X;      /* LENGTH OF DEMOUNT REQUEST   0246 00572000
*                                      BLOCK                 @Y30LB02*/ 00573000
         LA    @12,28                                              0246 00574000
         ST    @12,DMLEN                                           0246 00575000
*                 DMOPCD='06'X;     /* DEMOUNT OPCODE        @Y30LB02*/ 00576000
         MVI   DMOPCD,X'06'                                        0247 00577000
*                 DMNTFLAG=(DMFLAG);/* FLAGS                 @Y30LB02*/ 00578000
         LH    @12,DMFLAG                                          0248 00579000
         N     @12,@CF03224                                        0248 00580000
         STH   @12,DMNTFLAG                                        0248 00581000
*                 DMVOL=(MSSSER);   /* VALUE OF VOLID        @Y30LB02*/ 00582000
         MVC   DMVOL(6),MSSSER(COMMPTR)                            0249 00583000
*                 DMNTVUA=(MSSVUA); /* FILL VUA              @ZDR2048*/ 00584000
         LH    @12,MSSVUA(,COMMPTR)                                0250 00585000
         N     @12,@CF03224                                        0250 00586000
         STH   @12,DMNTVUA                                         0250 00587000
*                 DMVUAVAL='1'B;    /* OR ON THE VUA VALID ATTRIBUTE    00588000
*                                      FLAG                  @ZDR2048*/ 00589000
         OI    DMVUAVAL,B'00100000'                                0251 00590000
*                 DMHOST=(CPUID);   /* FILL IN HOSTID        @Y30LB02*/ 00591000
         MVC   DMHOST(5),CPUID                                     0252 00592000
*                 SVC(126);         /* INVOKE THE MSSC SVC   @Y30LB02*/ 00593000
         SVC   126                                                 0253 00594000
*                 RFY                                              0254 00595000
*                   MDREG1 UNRSTD;  /* UNREST REG 1          @Y30LB02*/ 00596000
*                 RFY                                              0255 00597000
*                   R15 RSTD;                                      0255 00598000
*                 RETCODE=R15;      /* GET THE RETURN CODE           */ 00599000
         ST    R15,RETCODE                                         0256 00600000
*                 IF RETCODE^=ZEROFULL THEN/*                @VA11320*/ 00601000
         L     @14,RETCODE                                         0257 00602000
         LTR   @14,@14                                             0257 00603000
         BZ    @RF00257                                            0257 00604000
*                   DO;             /*                       @VA11320*/ 00605000
*                     RFY                                          0259 00606000
*                       R0 RSTD;    /*                       @VA11320*/ 00607000
*                     TEMP4=R0;     /* GET ERROR RET CODE    @VA11343*/ 00608000
         STCM  R0,15,TEMP4                                         0260 00609000
*                     MSSRC=TEMP4(3:4);/* LAST 2 BYTES!      @VA11343*/ 00610000
         MVC   MSSRC(2,COMMPTR),TEMP4+2                            0261 00611000
*                     RFY                                          0262 00612000
*                       R0 UNRSTD;  /*                       @VA11320*/ 00613000
*                   END;            /*                       @VA11320*/ 00614000
*                 ELSE                                             0264 00615000
*                   MSSRC=ZEROFULL; /*                       @VA11320*/ 00616000
         B     @RC00257                                            0264 00617000
@RF00257 SLR   @14,@14                                             0264 00618000
         STH   @14,MSSRC(,COMMPTR)                                 0264 00619000
*                 RFY                                              0265 00620000
*                   R15 UNRSTD;                                    0265 00621000
@RC00257 DS    0H                                                  0266 00622000
*                 CALL MSSCHEK;                                    0266 00623000
         BAL   @14,MSSCHEK                                         0266 00624000
*               END;                /*                       @VA11343*/ 00625000
*/* **************************************************************** */ 00626000
*/* IF NEITHER MOUNT NOR DEMOUNT, MAYBE IT'S A RELINQUISH REQUEST.   */ 00627000
*/*                                                                  */ 00628000
*/* IF SO, THEN JUST ISSUE THE RELINQUISH ORDER AND RETURN TO CALLER */ 00629000
*/* (THE RETURN CODE MUST BE 0). NO PACK CHANGE INTERRUPT WILL BE    */ 00630000
*/* GENERATED. PROCESSING SHOULD CONTINUE NORMALLY.                  */ 00631000
*/* **************************************************************** */ 00632000
*                                                                  0268 00633000
*             ELSE                                                 0268 00634000
*               IF RELINQSH=ON THEN                                0268 00635000
         B     @RC00242                                            0268 00636000
@RF00242 TM    RELINQSH(COMMPTR),B'00010000'                       0268 00637000
         BNO   @RF00268                                            0268 00638000
*                 DO;               /*                       @VA11344*/ 00639000
*                   BEGCC='0000'X;  /* SET BEGIN EXTENTS     @VA11344*/ 00640000
         SLR   @12,@12                                             0270 00641000
         STH   @12,BEGCC                                           0270 00642000
*                   ENDCC='0193'X;  /* SET END EXTENTS       @VA11344*/ 00643000
         MVC   ENDCC(2),@CH03037                                   0271 00644000
*                   ARFLG=RLQSH;    /* SET FLAG FOR RLQSH@VA11344    */ 00645000
         IC    @12,RLQSH                                           0272 00646000
         STC   @12,ARFLG                                           0272 00647000
*                   ARVOL=MSSSER;   /* VOLID                 @VA11344*/ 00648000
         MVC   ARVOL(6),MSSSER(COMMPTR)                            0273 00649000
*                   ARNMEXT=NMBREXTS;/* NMBR OF EXTENTS      @VA11344*/ 00650000
         IC    @12,NMBREXTS                                        0274 00651000
         STC   @12,ARNMEXT                                         0274 00652000
*                   AREXT=MDSKEXTS; /* EXTENTS FOR VOLID     @VA11344*/ 00653000
*                                                                  0275 00654000
         MVC   AREXT(4),MDSKEXTS                                   0275 00655000
*                   /*************************************************/ 00656000
*                   /*                                               */ 00657000
*                   /* MACRO INVOCATION:                     @ZA28964*/ 00658000
*                   /* ICBACREL MF(E,RLQBLK)TYPE(REL)EXTS(MDSKEXTS)NM*/ 00659000
*                   /* EXTS(NMBREXTS)VOLID(MSSSER)FLAGS(RLQSH)       */ 00660000
*                   /*                                       @ZA28964*/ 00661000
*                   /* ***********************************************/ 00662000
*                   /* ********                              @Y30LB02*/ 00663000
*                   /* MACMEAN MSSC ACQUIRE/RELINQUISH MACRO (OS/VS2 */ 00664000
*                   /* MVS)                                  @G94SB08*/ 00665000
*                   /* VERSION 1.0 RELEASE 1 5/8/78          @G94SB08*/ 00666000
*                   /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.      */ 00667000
*                   /*                                       @Y30LB02*/ 00668000
*                   /* THE LIST FORM OF THIS MACRO SHOULD BE @Y30LB02*/ 00669000
*                   /* INVOKED FIRST IN ORDER TO SET UP NECESSARY    */ 00670000
*                   /*                                       @Y30LB02*/ 00671000
*                   /* DECLARES. THE EXECUTE FORM WILL ONLY  @Y30LB02*/ 00672000
*                   /* ISSUE THE SVC.                        @Y30LB02*/ 00673000
*                   /* ***********************************************/ 00674000
*                   /* ********                              @Y30LB02*/ 00675000
*                   /*                                               */ 00676000
*                   /*************************************************/ 00677000
*                                                                  0276 00678000
*                   RFY                                            0276 00679000
*                    (ARR1) RSTD;   /* RESTRICT R1           @Y30LB02*/ 00680000
*                   ARR1=ADDR(RLQBLK);/* SET ARR1 TO ADDR OF LIST  0277 00681000
*                                                            @Y30LB02*/ 00682000
         LA    ARR1,RLQBLK                                         0277 00683000
*                   SVC(126);       /* ISSUE SVC             @Y30LB02*/ 00684000
         SVC   126                                                 0278 00685000
*                   RFY                                            0279 00686000
*                    (ARR1) UNRSTD; /* UNRESTRICT REG 1      @Y30LB02*/ 00687000
*                                                                  0279 00688000
*                   /*************************************************/ 00689000
*                   /*                                               */ 00690000
*                   /*                                       @VA11344*/ 00691000
*                   /*                                               */ 00692000
*                   /*************************************************/ 00693000
*                                                                  0280 00694000
*                   RETCODE=ZEROFULL;/* SET RET CODE         @VA11344*/ 00695000
         SLR   @12,@12                                             0280 00696000
         ST    @12,RETCODE                                         0280 00697000
*                   MSSRC=ZEROFULL; /*                       @VA11344*/ 00698000
         STH   @12,MSSRC(,COMMPTR)                                 0281 00699000
*                   CALL MSSCHEK;   /*                       @VA11344*/ 00700000
         BAL   @14,MSSCHEK                                         0282 00701000
*                 END;              /*                       @VA11344*/ 00702000
*                                                                  0283 00703000
*           /*********************************************************/ 00704000
*           /*                                                       */ 00705000
*           /* ***************************************** INVALID     */ 00706000
*           /* REQUEST WAS MADE                                      */ 00707000
*           /* *****************************************             */ 00708000
*           /*                                                       */ 00709000
*           /*********************************************************/ 00710000
*                                                                  0284 00711000
*               ELSE                                               0284 00712000
*                 DO;               /*                       @VA11344*/ 00713000
         B     @RC00268                                            0284 00714000
@RF00268 DS    0H                                                  0285 00715000
*                   DO;             /* WTO('INVALID REQUEST CODE IN     00716000
*                                      VM REQUEST') DESC(4)        0285 00717000
*                                      ROUTCDE(2)                    */ 00718000
*                     RFY                                          0286 00719000
*                       GPR01P RSTD;/* RESTRICT REG 1                */ 00720000
*                     GPR01P=ADDR(I03514);/* ADDRESS CONTROL PROGRAM    00721000
*                                      LIST                          */ 00722000
         LA    GPR01P,I03514                                       0287 00723000
*                     SVC(35);      /* ISSUE WTO SVC                 */ 00724000
         SVC   35                                                  0288 00725000
*                     RFY                                          0289 00726000
*                       GPR01P UNRSTD;/* RELEASE REG 1               */ 00727000
*                   END;            /* WTO('INVALID REQUEST CODE IN     00728000
*                                      VM REQUEST') DESC(4)        0290 00729000
*                                      ROUTCDE(2)                    */ 00730000
*                   DECLARE         /* WTO PARAMETER LIST            */ 00731000
*                     1 I03514 STATIC BDY(WORD),                   0291 00732000
*                      2 I0351401 FIXED(15) INIT(38),/* TEXT LENGTH  */ 00733000
*                      2 I0351402 BIT(16) INIT('1000000000000000'B),    00734000
*                                   /* MCS FLAG                      */ 00735000
*                      2 I0351403 CHAR(34) INIT(                   0291 00736000
*                            'INVALID REQUEST CODE IN VM REQUEST'),/*   00737000
*                                      MESSAGE TEXT                  */ 00738000
*                      2 I0351404 BIT(16) INIT('0001000000000000'B),    00739000
*                                   /* DESCRIPTOR CODES              */ 00740000
*                      2 I0351405 BIT(16) INIT('0100000000000000'B);    00741000
*                                   /* ROUTING CODES                 */ 00742000
*                   CALL MSSERROR;  /* TELL VM ERROR OCCURED         */ 00743000
         BAL   @14,MSSERROR                                        0292 00744000
*                 END;              /*                       @VA11343*/ 00745000
*         END L2;                                                  0294 00746000
*       ELSE                                                       0295 00747000
*                                                                  0295 00748000
*         /***********************************************************/ 00749000
*         /*                                                         */ 00750000
*         /* ******************************************************* */ 00751000
*         /* THE FLAG1 FIELD WAS = 0 INDICATING THAT THERE WERE NO   */ 00752000
*         /* OUTSTANDING REQUESTS... GO INTO WAIT              STATE.*/ 00753000
*         /* ******************************************************* */ 00754000
*         /*                                                         */ 00755000
*         /***********************************************************/ 00756000
*                                                                  0295 00757000
*         DO;                                                      0295 00758000
         B     @RC00213                                            0295 00759000
@RF00213 DS    0H                                                  0296 00760000
*WAIT1:                                                            0296 00761000
*           MSSECB=ZEROFULL;        /* CLEAR MSSECB          @VA11318*/ 00762000
WAIT1    SLR   @12,@12                                             0296 00763000
         ST    @12,MSSECB                                          0296 00764000
*           ADMSSECB=ADDR(MSSECB);  /* ASSIGN ADDRESS        @VA11318*/ 00765000
         LA    @01,MSSECB                                          0297 00766000
         ST    @01,ADMSSECB                                        0297 00767000
*           WTORECBA=ADDR(WTORECB); /* ASSIGN ADDRESS        @VA11318*/ 00768000
         LA    @01,WTORECB                                         0298 00769000
         STCM  @01,7,WTORECBA                                      0298 00770000
*           ENDLIST=LISTEND;        /* DENOTE END OF LIST    @VA11318*/ 00771000
         IC    @01,LISTEND                                         0299 00772000
         STC   @01,ENDLIST                                         0299 00773000
*           WTORECB=ZEROFULL;       /* CLEAR WTORECB         @VA11318*/ 00774000
         ST    @12,WTORECB                                         0300 00775000
*           GEN REFS(MSSECB)(WAIT ECBLIST=WTLIST);/*         @VA11318*/ 00776000
         WAIT ECBLIST=WTLIST                                            00777000
*           IF POSTFLAG=ON THEN                                    0302 00778000
         TM    POSTFLAG,B'01000000'                                0302 00779000
         BNO   @RF00302                                            0302 00780000
*             DO;                   /* TERMINATING DMKMSS    @VA12978*/ 00781000
*               IF WTOREPLY='Q' THEN/* CORRECT RESPONSE?     @VA12978*/ 00782000
         CLI   WTOREPLY,C'Q'                                       0304 00783000
         BE    @RT00304                                            0304 00784000
*                 GOTO ABNEXIT;     /*                       @VA11318*/ 00785000
*               ELSE                                               0306 00786000
*                 DO;               /* NO - REISSUE MSG      @VA12978*/ 00787000
*                   CALL RPLYPROC;  /* REISSUE TERMINATION INSTR   0307 00788000
*                                                            @VA12978*/ 00789000
         BAL   @14,RPLYPROC                                        0307 00790000
*                 END;              /*                       @VA12978*/ 00791000
*             END;                                                 0309 00792000
*           ELSE                                                   0310 00793000
*             ;                     /*                       @VA11318*/ 00794000
@RF00302 DS    0H                                                  0311 00795000
*         END;                      /*                       @VA12978*/ 00796000
*/* **************************************************************** */ 00797000
*/*       GO BACK TO THE MAIN LOOP TO REQUEST MORE WORK FROM VM      */ 00798000
*/* **************************************************************** */ 00799000
*                                                                  0312 00800000
*       GO TO MAINLOOP;                                            0312 00801000
         B     MAINLOOP                                            0312 00802000
*     END L1;                                                      0313 00803000
*                                                                  0313 00804000
*/* **************************************************************** */ 00805000
*/*   ERROR HAS OCCURED, DCB NOT OPENED | MSS NOT INITILIZED |       */ 00806000
*/*   DMKMSS IS NOT RUNNING IN A VIRTUAL MACHINE                     */ 00807000
*/*         WRITE TO OPERATOR, RETURN TO THE SYSTEM                  */ 00808000
*/* **************************************************************** */ 00809000
*                                                                  0314 00810000
*   ELSE                                                           0314 00811000
*     DO;                                                          0314 00812000
@RF00141 DS    0H                                                  0315 00813000
*       IF MSSINIT=OFF THEN                                        0315 00814000
         TM    MSSINIT,B'10000000'                                 0315 00815000
         BNZ   @RF00315                                            0315 00816000
*         DO;                       /* WTO('DMKMSS ENDING ERROR- MSS    00817000
*                                      NOT INITIALIZED') DESC(4)   0316 00818000
*                                      ROUTCDE(2)                    */ 00819000
*           RFY                                                    0317 00820000
*             GPR01P RSTD;          /* RESTRICT REG 1                */ 00821000
*           GPR01P=ADDR(I03516);    /* ADDRESS CONTROL PROGRAM LIST  */ 00822000
         LA    GPR01P,I03516                                       0318 00823000
*           SVC(35);                /* ISSUE WTO SVC                 */ 00824000
         SVC   35                                                  0319 00825000
*           RFY                                                    0320 00826000
*             GPR01P UNRSTD;        /* RELEASE REG 1                 */ 00827000
*         END;                      /* WTO('DMKMSS ENDING ERROR- MSS    00828000
*                                      NOT INITIALIZED') DESC(4)   0321 00829000
*                                      ROUTCDE(2)                    */ 00830000
*       DECLARE                     /* WTO PARAMETER LIST            */ 00831000
*         1 I03516 STATIC BDY(WORD),                               0322 00832000
*          2 I0351601 FIXED(15) INIT(44),/* TEXT LENGTH              */ 00833000
*          2 I0351602 BIT(16) INIT('1000000000000000'B),/* MCS FLAG  */ 00834000
*          2 I0351603 CHAR(40) INIT(                               0322 00835000
*                'DMKMSS ENDING ERROR- MSS NOT INITIALIZED'),/*    0322 00836000
*                                      MESSAGE TEXT                  */ 00837000
*          2 I0351604 BIT(16) INIT('0001000000000000'B),/* DESCRIPTOR   00838000
*                                      CODES                         */ 00839000
*          2 I0351605 BIT(16) INIT('0100000000000000'B);/* ROUTING 0322 00840000
*                                      CODES                         */ 00841000
@RF00315 DS    0H                                                  0323 00842000
*       IF DCBOFOPN=OFF THEN                                       0323 00843000
         TM    DCBOFOPN+40(DCBPTR),B'00010000'                     0323 00844000
         BNZ   @RF00323                                            0323 00845000
*         DO;                       /* WTO('DMKMSS ENDING ERROR- DCB    00846000
*                                      FOR COMM. DEVICE NOT OPENED')    00847000
*                                      DESC(4) ROUTCDE(2)            */ 00848000
*           RFY                                                    0325 00849000
*             GPR01P RSTD;          /* RESTRICT REG 1                */ 00850000
*           GPR01P=ADDR(I03518);    /* ADDRESS CONTROL PROGRAM LIST  */ 00851000
         LA    GPR01P,I03518                                       0326 00852000
*           SVC(35);                /* ISSUE WTO SVC                 */ 00853000
         SVC   35                                                  0327 00854000
*           RFY                                                    0328 00855000
*             GPR01P UNRSTD;        /* RELEASE REG 1                 */ 00856000
*         END;                      /* WTO('DMKMSS ENDING ERROR- DCB    00857000
*                                      FOR COMM. DEVICE NOT OPENED')    00858000
*                                      DESC(4) ROUTCDE(2)            */ 00859000
*       DECLARE                     /* WTO PARAMETER LIST            */ 00860000
*         1 I03518 STATIC BDY(WORD),                               0330 00861000
*          2 I0351801 FIXED(15) INIT(56),/* TEXT LENGTH              */ 00862000
*          2 I0351802 BIT(16) INIT('1000000000000000'B),/* MCS FLAG  */ 00863000
*          2 I0351803 CHAR(52) INIT(                               0330 00864000
*                'DMKMSS ENDING ERROR- DCB FOR COMM. DEVICE NOT OPENED' 00865000
*                ),                 /* MESSAGE TEXT                  */ 00866000
*          2 I0351804 BIT(16) INIT('0001000000000000'B),/* DESCRIPTOR   00867000
*                                      CODES                         */ 00868000
*          2 I0351805 BIT(16) INIT('0100000000000000'B);/* ROUTING 0330 00869000
*                                      CODES                         */ 00870000
@RF00323 DS    0H                                                  0331 00871000
*       IF VIRTFLAG=OFF THEN                                       0331 00872000
         TM    VIRTFLAG,B'01000000'                                0331 00873000
         BNZ   @RF00331                                            0331 00874000
*         DO;                       /* WTO('DMKMSS ENDING          0332 00875000
*                                      ERROR-DMKMSS MUST RUN IN A  0332 00876000
*                                      VIRTUAL MACH.') DESC(4)     0332 00877000
*                                      ROUTCDE(2)                    */ 00878000
*           RFY                                                    0333 00879000
*             GPR01P RSTD;          /* RESTRICT REG 1                */ 00880000
*           GPR01P=ADDR(I03520);    /* ADDRESS CONTROL PROGRAM LIST  */ 00881000
         LA    GPR01P,I03520                                       0334 00882000
*           SVC(35);                /* ISSUE WTO SVC                 */ 00883000
         SVC   35                                                  0335 00884000
*           RFY                                                    0336 00885000
*             GPR01P UNRSTD;        /* RELEASE REG 1                 */ 00886000
*         END;                      /* WTO('DMKMSS ENDING          0337 00887000
*                                      ERROR-DMKMSS MUST RUN IN A  0337 00888000
*                                      VIRTUAL MACH.') DESC(4)     0337 00889000
*                                      ROUTCDE(2)                    */ 00890000
*       DECLARE                     /* WTO PARAMETER LIST            */ 00891000
*         1 I03520 STATIC BDY(WORD),                               0338 00892000
*          2 I0352001 FIXED(15) INIT(58),/* TEXT LENGTH              */ 00893000
*          2 I0352002 BIT(16) INIT('1000000000000000'B),/* MCS FLAG  */ 00894000
*          2 I0352003 CHAR(54) INIT(                               0338 00895000
*'DMKMSS ENDING ERROR-DMKMSS MUST RUN IN A VIRTUAL MACH.'),/* MESSAGE   00896000
*                                      TEXT                          */ 00897000
*          2 I0352004 BIT(16) INIT('0001000000000000'B),/* DESCRIPTOR   00898000
*                                      CODES                         */ 00899000
*          2 I0352005 BIT(16) INIT('0100000000000000'B);/* ROUTING 0338 00900000
*                                      CODES                         */ 00901000
@RF00331 DS    0H                                                  0339 00902000
*FINISH:                            /*                       @VA11343*/ 00903000
*       RCODE=FOUR;                 /* EXPECTING RETCODE OF 4 IF   0339 00904000
*                                      ERROR                         */ 00905000
FINISH   MVC   RCODE(2),@CH00109                                   0339 00906000
*/* **************************************************************** */ 00907000
*/*       FREE THE OBTAINED STORAGE AND RETURN TO THE CALLER   ##C## */ 00908000
*/* **************************************************************** */ 00909000
*                                                                  0340 00910000
*       GEN CODE REFS(R13,R0,R1,R10,RCODE,R14,R12,R15);            0340 00911000
*                                                            /*##C##*/  00912000
          L R13,4(,R13)                                       ##C##     00913000
          L R2,@SIZDATD                                       ##C##     00914000
          LR R1,R10                                           ##C##     00915000
          FREEMAIN R,LV=(2),A=(1),SP=241                      ##C##     00916000
          L R15,RCODE                                         ##C##     00917000
          L R14,12(,R13)                                      ##C##     00918000
          LM R0,R12,20(R13)                                   ##C##     00919000
          BR R14                                              ##C##     00920000
*     END;                                                         0341 00921000
*                                                                  0342 00922000
*/* **************************************************************** */ 00923000
*/*      THE FOLLOWING CODE IS EXECUTED ONLY IF THIS PROCEDURE       */ 00924000
*/*      TERMINATES WITH ABEND. INFORM VM VIA THE DIAGNOSE INST.     */ 00925000
*/*      THAT COMMUNICATION WITH THE MSC IS NO LONGER POSSIBLE       */ 00926000
*/*      AND NO MORE REQUESTS CAN BE HONORED.                        */ 00927000
*/* **************************************************************** */ 00928000
*                                                                  0342 00929000
*ABNEXIT:                                                          0342 00930000
*   GEN CODE;                                                      0342 00931000
ABNEXIT  DS    0H                                                  0342 00932000
*                                                    /*   @VA11317 */   00933000
         BALR @11,0                                  /*   @VA11317 */   00934000
ABNEXIT1 EQU *                                       /*   @VA11317 */   00935000
         LA @14,ABNEXIT1-@PSTART                     /*   @VA11317 */   00936000
         SR @11,@14                                  /*   @VA11317 */   00937000
*   RFY                                                            0343 00938000
*     UCBOB BASED(UCBPTR);          /* GET COMM. UCB         @VA11318*/ 00939000
*   MSSECBAD=SAVE1;                 /* RESTORE COMM. UCB     @VA11318*/ 00940000
         L     @12,SAVE1                                           0344 00941000
         ST    @12,MSSECBAD(,UCBPTR)                               0344 00942000
*   MSSASCBA=SAVE2;                 /* RESTORE COMM. UCB     @VA11318*/ 00943000
         L     @12,SAVE2                                           0345 00944000
         ST    @12,MSSASCBA(,UCBPTR)                               0345 00945000
*   UCBATI=SAVE3;                   /* RESTORE COMM. UCB     @VA11318*/ 00946000
         L     @01,UCBEXTPT(,UCBPTR)                               0346 00947000
         L     @12,SAVE3                                           0346 00948000
         STC   @12,UCBATI(,@01)                                    0346 00949000
*   CALL DIAG(EXITABND);                                           0347 00950000
*                                                                  0347 00951000
         LA    @01,@AL00347                                        0347 00952000
         BAL   @14,DIAG                                            0347 00953000
*/* **************************************************************** */ 00954000
*/*     FREE OBTAINED STORAGE AND RETURN TO CALLER          ##C##    */ 00955000
*/* **************************************************************** */ 00956000
*                                                                  0348 00957000
*   GEN CODE REFS(R13,R0,R1,R10,R12,R14);                          0348 00958000
*                                                          /*##C##*/    00959000
        L R13,4(,R13)                                      ##C##        00960000
        L R2,@SIZDATD                                      ##C##        00961000
        LR R1,R10                                          ##C##        00962000
        FREEMAIN R,LV=(2),A=(1),SP=241                     ##C##        00963000
        L R14,12(,R13)                                     ##C##        00964000
        LM R0,R12,20(R13)                                  ##C##        00965000
        BR R14                                             ##C##        00966000
*                                                                  0349 00967000
*/* **************************************************************** */ 00968000
*/* |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||*/ 00969000
*/* THE FOLLOWING INTERNAL PROCEDURE CHECKS THE RETURN CODE          */ 00970000
*/* TO DETERMINE IF AN MSC ERROR WAS DETECTED DURING THE             */ 00971000
*/* MOUNT OR DEMOUNT. AN ALTERNATE ENTRY IS PROVIDED FOR THE CASE    */ 00972000
*/* THAT THE REQUEST WAS NEITHER A MOUNT NOR A DEMOUNT- AT THIS      */ 00973000
*/* POINT IT IS KNOWN THAT AN ERROR EXISTS BUT VM MUST BE TOLD.      */ 00974000
*/* |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||*/ 00975000
*/* **************************************************************** */ 00976000
*                                                                  0349 00977000
*MSSCHEK:                                                          0349 00978000
*   PROC;                                                          0349 00979000
@EL00001 L     @13,4(,@13)                                         0349 00980000
@EF00001 DS    0H                                                  0349 00981000
@ER00001 LM    @14,@12,12(@13)                                     0349 00982000
         BR    @14                                                 0349 00983000
MSSCHEK  STM   @14,@12,@SA00002                                    0349 00984000
*   IF RETCODE=ZEROFULL THEN        /* CHECK RETURN CODE FROM      0350 00985000
*                                      ICBMNTDE                      */ 00986000
         L     @12,RETCODE                                         0350 00987000
         LTR   @12,@12                                             0350 00988000
         BNZ   @RF00350                                            0350 00989000
*/* **************************************************************** */ 00990000
*/*            TELL VM THAT ALL WENT OK                              */ 00991000
*/* **************************************************************** */ 00992000
*                                                                  0351 00993000
*     DO;                                                          0351 00994000
*       CALL DIAG(DONEOK);                                         0352 00995000
         LA    @01,@AL00352                                        0352 00996000
         BAL   @14,DIAG                                            0352 00997000
*     END;                                                         0353 00998000
*   ELSE                                                           0354 00999000
*     DO;                                                          0354 01000000
*                                                                  0354 01001000
         B     @RC00350                                            0354 01002000
@RF00350 DS    0H                                                  0355 01003000
*/* **************************************************************** */ 01004000
*/*               TELL VM THAT AN ERROR OCCURED                      */ 01005000
*/* **************************************************************** */ 01006000
*                                                                  0355 01007000
*MSSERROR:                                                         0355 01008000
*       ENTRY;                                                     0355 01009000
         B     @EC00355                                            0355 01010000
MSSERROR STM   @14,@12,@SA00002                                    0355 01011000
@EC00355 DS    0H                                                  0356 01012000
*       MSSERR=ON;                  /* SET THE FLAG IN MSSCOM        */ 01013000
         OI    MSSERR(COMMPTR),B'00000100'                         0356 01014000
*       CALL DIAG(ERRMSS);                                         0357 01015000
         LA    @01,@AL00357                                        0357 01016000
         BAL   @14,DIAG                                            0357 01017000
*     END;                                                         0358 01018000
*   END MSSCHEK;                                                   0359 01019000
@EL00002 DS    0H                                                  0359 01020000
@EF00002 DS    0H                                                  0359 01021000
@ER00002 LM    @14,@12,@SA00002                                    0359 01022000
         BR    @14                                                 0359 01023000
*                                                                  0360 01024000
*/* **************************************************************** */ 01025000
*/* |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||| */ 01026000
*/*         THIS PROCEDURE ISSUES THE DIAGNOSE INSTRUCTION           */ 01027000
*/*         WITH THE OPERATION CODE IN R5 AND THE REAL ADDRERSS      */ 01028000
*/*         OF THE ANSWER AREA IN R4.                                */ 01029000
*/* |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||| */ 01030000
*/* **************************************************************** */ 01031000
*                                                                  0360 01032000
*DIAG:                                                             0360 01033000
*   PROC(OPCODE);                                                  0360 01034000
DIAG     STM   @14,@12,@SA00003                                    0360 01035000
         MVC   @PC00003(4),0(@01)                                  0360 01036000
*   DCL                                                            0361 01037000
*     OPCODE FIXED;                                                0361 01038000
*   R5=OPCODE;                                                     0362 01039000
         L     @12,@PC00003                                        0362 01040000
         L     R5,OPCODE(,@12)                                     0362 01041000
*   R6=ADDR(BUFFER);                                               0363 01042000
         LA    R6,BUFFER                                           0363 01043000
*   GEN REFS(R0,R4,R6,DIAGNOSE);                                   0364 01044000
              LRA R4,0(R6)                                              01045000
              EX R0,DIAGNOSE                                            01046000
*   END DIAG;                                                      0365 01047000
@EL00003 DS    0H                                                  0365 01048000
@EF00003 DS    0H                                                  0365 01049000
@ER00003 LM    @14,@12,@SA00003                                    0365 01050000
         BR    @14                                                 0365 01051000
*                                                                  0366 01052000
*/* **************************************************************** */ 01053000
*/*  SUB-PROC TO ISSUE THE MESSAGE DESCRIBING HOW TO TERMINATE       */ 01054000
*/*  DMKMSS                                                          */ 01055000
*/* **************************************************************** */ 01056000
*                                                                  0366 01057000
*RPLYPROC:                                                         0366 01058000
*   PROC;                           /* TERMINATE MSG SUBPROC @VA12978*/ 01059000
RPLYPROC STM   @14,@12,@SA00004                                    0366 01060000
*   WTOREPLY=BLNK;                  /* CLEAR WTOREPLY        @VA11318*/ 01061000
         MVC   WTOREPLY(1),BLNK                                    0367 01062000
*   WTORECB=ZEROFULL;               /* ZERO WTORECB          @VA11318*/ 01063000
         SLR   @12,@12                                             0368 01064000
         ST    @12,WTORECB                                         0368 01065000
*   GEN CODE;                                                      0369 01066000
        WTOR ' REPLY ''Q'' TO TERMINATE DMKMSS ',                     XX01067000
               WTOREPLY,1,WTORECB,ROUTCDE=(2)                           01068000
*   RETURN;                         /* RETURN TO CALLER      @VA12978*/ 01069000
@EL00004 DS    0H                                                  0370 01070000
@EF00004 DS    0H                                                  0370 01071000
@ER00004 LM    @14,@12,@SA00004                                    0370 01072000
         BR    @14                                                 0370 01073000
*   END RPLYPROC;                                                  0371 01074000
*QRYPROC:                                                          0372 01075000
*   PROC;                           /*                       @VA12420*/ 01076000
QRYPROC  STM   @14,@12,@SA00005                                    0372 01077000
*   RFY                                                            0373 01078000
*    (R0,                                                          0373 01079000
*     R1) RSTD;                     /*                       @VA12420*/ 01080000
*   R0=512;                         /* SIZE OF THE MVT QUERY RESPONSE   01081000
*                                                            @VA11343*/ 01082000
         LA    R0,512                                              0374 01083000
*   GEN(GETMAIN R,LV=(0));          /* GET MVT BUFFER        @VA11343*/ 01084000
         GETMAIN R,LV=(0)                                               01085000
*   MVTPTR=R1;                      /* SAVE POINTER TO MVT BUFFER  0376 01086000
*                                                            @VA11343*/ 01087000
         ST    R1,MVTPTR                                           0376 01088000
*   RFY                                                            0377 01089000
*    (R0,                                                          0377 01090000
*     R1) UNRSTD;                   /* DONE WITH RSTD REGS   @VA11343*/ 01091000
*   QRYID='20'X;                    /* MVT TABLE ID          @VA11343*/ 01092000
         MVI   QRYID,X'20'                                         0378 01093000
*   QRYRD='01'X;                    /* DO READ-ONLY OF MVT TBL     0379 01094000
*                                                            @VA11343*/ 01095000
         MVI   QRYRD,X'01'                                         0379 01096000
*   QRYSEC='0000'X;                 /* NO CYL,HD,REC NEEDED  @VA11343*/ 01097000
         MVC   QRYSEC(2),@CB02882                                  0380 01098000
*   QRYVOL=MSSSER;                  /* LOOK FOR THIS VOLID   @VA11343*/ 01099000
         MVC   QRYVOL(6),MSSSER(COMMPTR)                           0381 01100000
*   QRYFILL=''B;                    /* BLANKS IN REST OF PARM      0382 01101000
*                                                            @VA11343*/ 01102000
         XC    QRYFILL(10),QRYFILL                                 0382 01103000
*   DCL                                                            0383 01104000
*     QUERR1 REG(1) PTR;            /* WILL CONTAIN BLK ADDRESS    0383 01105000
*                                                            @Z40LB22*/ 01106000
*                                                                  0383 01107000
*   /*****************************************************************/ 01108000
*   /*                                                               */ 01109000
*   /* *******************************************************       */ 01110000
*   /*                                                       @Z40LB22*/ 01111000
*   /* MSSC ICBQUERY QSWCS/QLAB/QTAB/QSWCS QCEL MACRO        @Z40LB22*/ 01112000
*   /* OS/VS2 VERSION-- 03/21/75 LEVEL 00                    @Z40LB22*/ 01113000
*   /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.              @Z40LB22*/ 01114000
*   /* THE LIST FORM OF THIS MACRO SHOULD BE                 @Z40LB22*/ 01115000
*   /* INVOKED FIRST IN ORDER TO SET UP NECESSARY            @Z40LB22*/ 01116000
*   /* DECLARES. IF THE COMPLETE ARGUMENT IS                 @Z40LB22*/ 01117000
*   /* SPECIFIED THE REQ BLOCK WILL BE ZEROED.               @Z40LB22*/ 01118000
*   /* *******************************************************       */ 01119000
*   /*                                                       @Z40LB22*/ 01120000
*   /*                                                               */ 01121000
*   /*****************************************************************/ 01122000
*                                                                  0384 01123000
*   RFY                                                            0384 01124000
*    (QUERR1) RSTD;                 /* RESTRICT R1           @Z40LB22*/ 01125000
*   QUERR1=ADDR(QUERLIST);          /* SET QUERR1 TO REQ BLOCK     0385 01126000
*                                                            @Z40LB22*/ 01127000
         LA    QUERR1,QUERLIST                                     0385 01128000
*   QUERLIST=QUERLIST&&QUERLIST;    /* ZERO REQUEST BLOCK    @Z40LB22*/ 01129000
         XC    QUERLIST(44),QUERLIST                               0386 01130000
*   QULEN='2C'X;                    /* SET LENGTH FIELD      @Z40LB22*/ 01131000
         LA    @12,44                                              0387 01132000
         ST    @12,QULEN                                           0387 01133000
*   QUORD='05'X;                    /* SET OPCODE FIELD      @Z40LB22*/ 01134000
         MVI   QUORD,X'05'                                         0388 01135000
*   QUCODE='06'X;                   /* SET CODE TYPE         @Z40LB22*/ 01136000
         MVI   QUCODE,X'06'                                        0389 01137000
*   QUPARM=(QRYPARM);               /* FILL IN PARAMETERS    @Z40LB22*/ 01138000
         MVI   QUPARM+20,C' '                                      0390 01139000
         MVC   QUPARM+21(11),QUPARM+20                             0390 01140000
         MVC   QUPARM(20),QRYPARM                                  0390 01141000
*   QUPTR=ADDR(MVTBL);              /* ADDR OF DATAPTR FIELD @Z40LB22*/ 01142000
         L     @12,MVTPTR                                          0391 01143000
         ST    @12,QUPTR                                           0391 01144000
*   SVC(126);                       /* ISSUE SVC INST.       @Z40LB22*/ 01145000
         SVC   126                                                 0392 01146000
*   RFY                                                            0393 01147000
*    (QUERR1) UNRSTD;               /* UNRESTRICT R1         @Z40LB22*/ 01148000
*                                                                  0393 01149000
*   /*****************************************************************/ 01150000
*   /*                                                               */ 01151000
*   /*                                                       @VA11343*/ 01152000
*   /*                                                               */ 01153000
*   /*****************************************************************/ 01154000
*                                                                  0394 01155000
*   RFY                                                            0394 01156000
*    (R0,                                                          0394 01157000
*     R1,                                                          0394 01158000
*     R15) RSTD;                    /*                       @VA11343*/ 01159000
*   IF R15=0 THEN                   /* QRY WAS OK IF R15 = 0 @VA11343*/ 01160000
         LTR   R15,R15                                             0395 01161000
         BNZ   @RF00395                                            0395 01162000
*     IF MVOLNDX=MVENT THEN         /* FIND AN ENTRY?        @VA11343*/ 01163000
         L     @14,MVTPTR                                          0396 01164000
         CLC   MVOLNDX(1,@14),MVENT                                0396 01165000
         BNE   @RF00396                                            0396 01166000
*       IF MSSSDG=SDGNDX THEN                                      0397 01167000
         CLC   MSSSDG(1,COMMPTR),SDGNDX(@14)                       0397 01168000
         BNE   @RF00397                                            0397 01169000
*         R15=0;                    /* SDG NUMBERS MATCH?    @VA11343*/ 01170000
         SLR   R15,R15                                             0398 01171000
*       ELSE                                                       0399 01172000
*         DO;                       /*                       @VA11343*/ 01173000
         B     @RC00397                                            0399 01174000
@RF00397 DS    0H                                                  0400 01175000
*           MSSSDG=SDGNDX;          /* NO - GET CORRECT SDG  @VA12420*/ 01176000
         L     @14,MVTPTR                                          0400 01177000
         MVC   MSSSDG(1,COMMPTR),SDGNDX(@14)                       0400 01178000
*           R15='10'X;              /* SET ERROR RETURN CODE @VA12420*/ 01179000
         LA    R15,16                                              0401 01180000
*           IF VOLMTD=ON|VOLMTDXC=ON THEN/* FLAG AS MTD      @VA12420*/ 01181000
         TM    VOLMTD(@14),B'11000000'                             0402 01182000
         BZ    @RF00402                                            0402 01183000
*             VOLMNTD=ON;           /* TURN ON MTD FLG IN MSSCOM IF     01184000
*                                      SO                    @VA12420*/ 01185000
         LA    @14,1                                               0403 01186000
         ST    @14,VOLMNTD                                         0403 01187000
*           ELSE                                                   0404 01188000
*             ;                     /*                       @VA12420*/ 01189000
@RF00402 DS    0H                                                  0405 01190000
*         END;                      /*                       @VA12420*/ 01191000
*     ELSE                                                         0406 01192000
*       R15='0'X;                   /* GET RSN CODE IF R15^=0      0406 01193000
*                                                            @VA11343*/ 01194000
         B     @RC00396                                            0406 01195000
@RF00396 SLR   R15,R15                                             0406 01196000
*   ELSE                                                           0407 01197000
*     R15='0'X;                                                    0407 01198000
         B     @RC00395                                            0407 01199000
@RF00395 SLR   R15,R15                                             0407 01200000
*   RSNCODE=R15;                    /* PRESERVE R15 ACROSS FREEMAIN     01201000
*                                                            @VA12420*/ 01202000
@RC00395 STCM  R15,15,RSNCODE                                      0408 01203000
*   R0=512;                         /* SIZE OF MVT BUFFER FOR      0409 01204000
*                                      FREEMAIN              @VA11343*/ 01205000
         LA    R0,512                                              0409 01206000
*   R1=MVTPTR;                      /* ADDRESS OF MVT BUFFER @VA11343*/ 01207000
         L     R1,MVTPTR                                           0410 01208000
*   GEN(FREEMAIN R,LV=(0),A=(1));   /*                       @VA11343*/ 01209000
         FREEMAIN R,LV=(0),A=(1)                                        01210000
*   R15=RSNCODE;                    /* RESTORE R15 AFTER FREEMAIN  0412 01211000
*                                                            @VA12420*/ 01212000
         ICM   R15,15,RSNCODE                                      0412 01213000
*   RETURN CODE(R15);               /*                       @VA12420*/ 01214000
         L     @14,@SA00005                                        0413 01215000
         LM    @00,@12,@SA00005+8                                  0413 01216000
         BR    @14                                                 0413 01217000
*   RFY                                                            0414 01218000
*    (R0,                                                          0414 01219000
*     R1,                                                          0414 01220000
*     R15) UNRSTD;                  /*                       @VA11343*/ 01221000
*   END QRYPROC;                    /*                       @VA12420*/ 01222000
*MNTPROC:                                                          0416 01223000
*   PROC;                           /*                       @VA12420*/ 01224000
MNTPROC  STM   @14,@12,12(@13)                                     0416 01225000
*/* **************************************************************** */ 01226000
*/* WHEN CP MOUNTS A VOLUME, NO UCB'S ARE GEN'D. THIS CAUSES THE MSC */ 01227000
*/* TO RESTRICT THE MOUNTED VOLUME SUCH THAT NO OS DATASETS MAY BE   */ 01228000
*/* ALLOCATED ON THAT VOLUME. IN ORDER TO GET AROUND THAT PROBLEM, A */ 01229000
*/* BIT IN THE MOUNT ORDER IS TURNED ON, INDICATING THAT THIS VOLUME */ 01230000
*/* IS A GENERAL-USE VOLUME (I.E. - MOUNTED BY THE CENTRAL SERVER).  */ 01231000
*/* **************************************************************** */ 01232000
*                                                                  0417 01233000
*   IF SHRDVUA=ON THEN                                             0417 01234000
         TM    SHRDVUA(COMMPTR),B'00000100'                        0417 01235000
         BNO   @RF00417                                            0417 01236000
*     DO;                           /* IS IT GEN-USE VOL?@VA11342    */ 01237000
*                                                                  0418 01238000
*       /*************************************************************/ 01239000
*       /*                                                           */ 01240000
*       /* MACRO INVOCATION:                                 @ZA28964*/ 01241000
*       /* ICBMNTDE MF(E,MONBLK)TYPE(MNT)VOLID(MSSSER)VUA(MSSVUA)FLAG*/ 01242000
*       /* S(MTFLAG)HOSTID(CPUID)                            @ZA28964*/ 01243000
*       /* ********************************************************  */ 01244000
*       /*                                                   @Y30LB02*/ 01245000
*       /* MACMEAN MSSC MOUNT/DEMOUNT MACRO                  @Y30LB02*/ 01246000
*       /* VERSION - VS/2 REL 3 77/12/15 LEVEL 04            @ZA28964*/ 01247000
*       /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.          @Y30LB02*/ 01248000
*       /* THE LIST FORM OF THIS MACRO SHOULD BE             @Y30LB02*/ 01249000
*       /* INVOKED FIRST IN ORDER TO SET UP NECESSARY        @Y30LB02*/ 01250000
*       /* DECLARES. IF THE COMPLETE ARGUMENT IS             @Y30LB02*/ 01251000
*       /* SPECIFIED THE REQ BLOCK WILL BE ZEROED.           @Y30LB02*/ 01252000
*       /* ********************************************************  */ 01253000
*       /*                                                   @Y30LB02*/ 01254000
*       /*                                                           */ 01255000
*       /*************************************************************/ 01256000
*                                                                  0419 01257000
*       RFY                                                        0419 01258000
*         MDREG1 RSTD;              /* RESTRICT REG 1        @Y30LB02*/ 01259000
*       MDREG1=ADDR(MONBLK);        /* R1 PTR TO REQ BLOCK   @Y30LB02*/ 01260000
         LA    MDREG1,MONBLK                                       0420 01261000
*       MDLEN='1C'X;                /* LENGTH OF MOUNT REQUEST BLOCK    01262000
*                                                            @Y30LB02*/ 01263000
         LA    @12,28                                              0421 01264000
         ST    @12,MDLEN                                           0421 01265000
*       MDOPCD='08'X;               /* MOUNT OPCODE          @Y30LB02*/ 01266000
         MVI   MDOPCD,X'08'                                        0422 01267000
*       MDFLG=(MTFLAG);             /* FLAGS                 @Y30LB02*/ 01268000
         LH    @12,MTFLAG                                          0423 01269000
         N     @12,@CF03224                                        0423 01270000
         STH   @12,MDFLG                                           0423 01271000
*       MDVOL=(MSSSER);             /* VALUE OF VOLID        @Y30LB02*/ 01272000
         MVC   MDVOL(6),MSSSER(COMMPTR)                            0424 01273000
*       MDVUA=(MSSVUA);             /* VALUE OF VUA          @Y30LB02*/ 01274000
         LH    @12,MSSVUA(,COMMPTR)                                0425 01275000
         N     @12,@CF03224                                        0425 01276000
         STH   @12,MDVUA                                           0425 01277000
*       MDHOST=(CPUID);             /* FILL IN HOSTID        @Y30LB02*/ 01278000
         MVC   MDHOST(5),CPUID                                     0426 01279000
*       SVC(126);                   /* INVOKE THE MSSC SVC   @Y30LB02*/ 01280000
         SVC   126                                                 0427 01281000
*       RFY                                                        0428 01282000
*         MDREG1 UNRSTD;            /* UNREST REG 1          @Y30LB02*/ 01283000
*                                                                  0428 01284000
*       /*************************************************************/ 01285000
*       /*                                                           */ 01286000
*       /*                                                   @VA11342*/ 01287000
*       /*                                                           */ 01288000
*       /*************************************************************/ 01289000
*                                                                  0429 01290000
*     END;                          /*                       @VA11342*/ 01291000
*   ELSE                                                           0430 01292000
*     DO;                           /*                       @VA11342*/ 01293000
*                                                                  0430 01294000
         B     @RC00417                                            0430 01295000
@RF00417 DS    0H                                                  0431 01296000
*       /*************************************************************/ 01297000
*       /*                                                           */ 01298000
*       /* MACRO INVOCATION:                                 @ZA28964*/ 01299000
*       /* ICBMNTDE                                                  */ 01300000
*       /* MF(E,MONBLK)TYPE(MNT)VOLID(MSSSER)VUA(MSSVUA)HOSTID(CPUID)*/ 01301000
*       /*                                                   @ZA28964*/ 01302000
*       /* ********************************************************  */ 01303000
*       /*                                                   @Y30LB02*/ 01304000
*       /* MACMEAN MSSC MOUNT/DEMOUNT MACRO                  @Y30LB02*/ 01305000
*       /* VERSION - VS/2 REL 3 77/12/15 LEVEL 04            @ZA28964*/ 01306000
*       /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.          @Y30LB02*/ 01307000
*       /* THE LIST FORM OF THIS MACRO SHOULD BE             @Y30LB02*/ 01308000
*       /* INVOKED FIRST IN ORDER TO SET UP NECESSARY        @Y30LB02*/ 01309000
*       /* DECLARES. IF THE COMPLETE ARGUMENT IS             @Y30LB02*/ 01310000
*       /* SPECIFIED THE REQ BLOCK WILL BE ZEROED.           @Y30LB02*/ 01311000
*       /* ********************************************************  */ 01312000
*       /*                                                   @Y30LB02*/ 01313000
*       /*                                                           */ 01314000
*       /*************************************************************/ 01315000
*                                                                  0431 01316000
*       RFY                                                        0431 01317000
*         MDREG1 RSTD;              /* RESTRICT REG 1        @Y30LB02*/ 01318000
*       MDREG1=ADDR(MONBLK);        /* R1 PTR TO REQ BLOCK   @Y30LB02*/ 01319000
         LA    MDREG1,MONBLK                                       0432 01320000
*       MDLEN='1C'X;                /* LENGTH OF MOUNT REQUEST BLOCK    01321000
*                                                            @Y30LB02*/ 01322000
         LA    @12,28                                              0433 01323000
         ST    @12,MDLEN                                           0433 01324000
*       MDOPCD='08'X;               /* MOUNT OPCODE          @Y30LB02*/ 01325000
         MVI   MDOPCD,X'08'                                        0434 01326000
*       MDVOL=(MSSSER);             /* VALUE OF VOLID        @Y30LB02*/ 01327000
         MVC   MDVOL(6),MSSSER(COMMPTR)                            0435 01328000
*       MDVUA=(MSSVUA);             /* VALUE OF VUA          @Y30LB02*/ 01329000
         LH    @12,MSSVUA(,COMMPTR)                                0436 01330000
         N     @12,@CF03224                                        0436 01331000
         STH   @12,MDVUA                                           0436 01332000
*       MDHOST=(CPUID);             /* FILL IN HOSTID        @Y30LB02*/ 01333000
         MVC   MDHOST(5),CPUID                                     0437 01334000
*       SVC(126);                   /* INVOKE THE MSSC SVC   @Y30LB02*/ 01335000
         SVC   126                                                 0438 01336000
*       RFY                                                        0439 01337000
*         MDREG1 UNRSTD;            /* UNREST REG 1          @Y30LB02*/ 01338000
*     END;                          /*                       @VA11342*/ 01339000
*   RFY                                                            0441 01340000
*    (R0,                                                          0441 01341000
*     R15) RSTD;                    /*                       @VA12420*/ 01342000
@RC00417 DS    0H                                                  0442 01343000
*   IF R15^=0 THEN                                                 0442 01344000
         LTR   R15,R15                                             0442 01345000
         BZ    @RF00442                                            0442 01346000
*     DO;                           /*                       @VA12420*/ 01347000
*       RSNCODE=R0;                 /*                       @VA12420*/ 01348000
         STCM  R0,15,RSNCODE                                       0444 01349000
*       MSSRC=RSNCODE(3:4);         /*                       @VA12420*/ 01350000
         MVC   MSSRC(2,COMMPTR),RSNCODE+2                          0445 01351000
*     END;                          /*                       @VA12420*/ 01352000
*   ELSE                                                           0447 01353000
*     ;                             /*                       @VA12420*/ 01354000
@RF00442 DS    0H                                                  0448 01355000
*   RETURN CODE(R15);               /*                       @VA12420*/ 01356000
         L     @14,12(,@13)                                        0448 01357000
         LM    @00,@12,20(@13)                                     0448 01358000
         BR    @14                                                 0448 01359000
*   RFY                                                            0449 01360000
*    (R0,                                                          0449 01361000
*     R15) UNRSTD;                  /*                       @VA12420*/ 01362000
*   END MNTPROC;                    /*                       @VA12420*/ 01363000
*                                                                  0451 01364000
*/* **************************************************************** */ 01365000
*/*  SUB-PROC TO SET UP THE INITIAL SDG TABLE OF VUA'S GEN'D FOR CP  */ 01366000
*/* **************************************************************** */ 01367000
*                                                                  0451 01368000
*QRYMSC:                                                           0451 01369000
*   PROC;                           /*                       @VA11343*/ 01370000
QRYMSC   STM   @14,@12,@SA00007                                    0451 01371000
*/*  ******************************************************* @Z40LB22*/ 01372000
*/*  MSSC QMWCS/QLAB/QTAB/QSWCS/QCEL MACRO             @Z40LB22      */ 01373000
*/*  OS/VS2 VERSION--03/21/75 LEVEL 00                  @Z40LB22     */ 01374000
*/*  THIS IS THE UNINITIALIZED LIST FORM                     @Z40LB22*/ 01375000
*/*  GENERAL AREA TO BE OVERLAID BY SPECIFIC ORDERS        @Z40LB22  */ 01376000
*/*  ******************************************************* @Z40LB22*/ 01377000
*                                                                  0452 01378000
*   DCL                                                            0452 01379000
*     1 QUERLIST,                   /* REQUEST BLOCK         @Z40LB22*/ 01380000
*      2 QULEN FIXED(31),           /* LENGTH = 44 BYTES     @Z40LB22*/ 01381000
*      2 QUORD CHAR(1),             /* ORDER - COULD BE FOR QMWCS  0452 01382000
*                                      (0B), QLAB (05), QTAB (05), 0452 01383000
*                                      QSWCS (05), OR QCEL (07)    0452 01384000
*                                                            @Z40LB22*/ 01385000
*      2 QURES CHAR(1),             /* RESERVED BITS         @Z40LB22*/ 01386000
*      2 QUCODE BIT(8),             /* CODE - COULD BE FOR QMWCS   0452 01387000
*                                      (03), QLAB (08), QTAB (06), OR   01388000
*                                      QSWCS (10)            @Z40LB22*/ 01389000
*       3 QULIB BIT(8),             /* QCEL ONLY - ID OF THE MSF TO     01390000
*                                      BE AUDITED            @Z40LB22*/ 01391000
*      2 QUSECT BIT(8),             /* QMWCS AND QSWCS ONLY - THE  0452 01392000
*                                      SECTOR OF CODE TO BE READ   0452 01393000
*                                                            @Z40LB22*/ 01394000
*       3 QUXADDR BIT(8),           /* QCEL ONLY - THE START X ADDR     01395000
*                                      OF CELLS TO BE AUDITED      0452 01396000
*                                                            @Z40LB22*/ 01397000
*        4 QUFLAG BIT(8),           /* QLAB ONLY - SET TO HEX 10, THE   01398000
*                                      LZYX OF CART IS SUPPLIED    0452 01399000
*                                                            @Z40LB22*/ 01400000
*         5 QURES1 CHAR(1),         /* QTAB ONLY - RESERVED BITS   0452 01401000
*                                                            @Z40LB22*/ 01402000
*      2 QUPARM CHAR(32),           /* PARM AREA FOR ANY SPECIFIED 0452 01403000
*                                                            @Z40LB22*/ 01404000
*      2 QUPTR FIXED(31);           /* ADDR OF A 512 BYTE DATA AREA     01405000
*                                                            @Z40LB22*/ 01406000
*   DCL                                                            0453 01407000
*     1 QWPARM DEFINED(QUPARM),     /* MSC AND SA WCS READ   @Z40LB22*/ 01408000
*      2 QWRES1 CHAR(2),            /* MSC WCS ONLY - RESERVED BITS     01409000
*                                                            @Z40LB22*/ 01410000
*       3 QWSSID CHAR(2),           /* SA WCS ONLY - SUBSYSTEM ID OF    01411000
*                                      THE SA                @Z40LB22*/ 01412000
*      2 QWFLAG BIT(8),             /* READ INDICATOR        @Z40LB22*/ 01413000
*       3 QWMEM BIT(1),             /* BIT 0=0 READ FROM MAIN STORAGE   01414000
*                                      BIT 0=1 READ FROM EXTENDED  0453 01415000
*                                      STORAGE               @Z40LB22*/ 01416000
*       3 * BIT(6),                 /* UNUSED                @ZA27590*/ 01417000
*       3 QWALTMSC BIT(1),          /* BIT 7=0 DUMP PRIMARY MSC BIT     01418000
*                                      7=1 DUMP ALTERNATE MSC      0453 01419000
*                                                            @ZA27590*/ 01420000
*      2 QWRES2 CHAR(29);           /* RESERVED BITS         @Z40LB22*/ 01421000
*   DCL                                                            0454 01422000
*     1 QTPARM DEFINED(QUPARM),     /* QTAB REQUEST BLOCK    @Z40LB22*/ 01423000
*      2 QTID BIT(8),               /*                       @Z40LB22*/ 01424000
*       3 QTTABID BIT(4),           /* TABLE ID              @Z40LB22*/ 01425000
*      2 QTFLAG BIT(8),             /* READ CHR BIT 3=1 BLOCK CHR  0454 01426000
*                                      SUPPLIED BIT 7=1 READ REQUEST    01427000
*                                                            @Z40LB22*/ 01428000
*      2 QTDATA CHAR(18),           /* TABLE DEPENDENT DATA  @Z40LB22*/ 01429000
*      2 QTDASCHR BIT(32),          /* THE CHR OF RECORD TO BE READ     01430000
*                                      ORDER                 @Z40LB22*/ 01431000
*      2 QTRES CHAR(8);             /* RESERVED              @Z40LB22*/ 01432000
*   DCL                                                            0455 01433000
*     1 QLPARM DEFINED(QUPARM),     /* QLAB REQUEST BLOCK    @Z40LB22*/ 01434000
*      2 QLZYX FIXED(15),           /* THE MSF AND CELL ADDR OF CART.   01435000
*                                      TO BE READ            @Z40LB22*/ 01436000
*      2 QLRES CHAR(30);            /* RESERVED              @Z40LB22*/ 01437000
*   DCL                                                            0456 01438000
*     1 QCPARM DEFINED(QUPARM),     /* QCEL 8 WORD BIT MAP   @Z40LB22*/ 01439000
*      2 QCMAD0Z0 BIT(32),          /* WORD 1 OF CELL ADDR TO BE   0456 01440000
*                                      TESTED                @Z40LB22*/ 01441000
*      2 QCMAD0Z1 BIT(32),          /* WORD 2 OF CELL ADDR TO BE   0456 01442000
*                                      TESTED                @Z40LB22*/ 01443000
*      2 QCMAD1Z0 BIT(32),          /* WORD 3 OF CELL ADDR TO BE   0456 01444000
*                                      TESTED                @Z40LB22*/ 01445000
*      2 QCMAD1Z1 BIT(32),          /* WORD 4 OF CELL ADDR TO BE   0456 01446000
*                                      TESTED                @Z40LB22*/ 01447000
*      2 QCMAD2Z0 BIT(32),          /* WORD 5 OF CELL ADDR TO BE   0456 01448000
*                                      TESTED                @Z40LB22*/ 01449000
*      2 QCMAD2Z1 BIT(32),          /* WORD 6 OF CELL ADDR TO BE   0456 01450000
*                                      TESTED                @Z40LB22*/ 01451000
*      2 QCMAD3Z0 BIT(32),          /* WORD 7 OF CELL ADDR TO BE   0456 01452000
*                                      TESTED                @Z40LB22*/ 01453000
*      2 QCMAD3Z1 BIT(32);          /* WORD 8 OF CELL ADDR TO BE   0456 01454000
*                                      TESTED                @Z40LB22   01455000
*                                      LIST FORM OF ICBQUERY MACRO 0456 01456000
*                                                            @VA11343*/ 01457000
*/* **************************************************************** */ 01458000
*/*  CYLINDER, HEAD, AND RECORD LOCATION STRUCTURE FOR MSC QUERY     */ 01459000
*/* **************************************************************** */ 01460000
*                                                                  0457 01461000
*   DCL                                                            0457 01462000
*     1 CHRMAP CHAR(4),             /*                       @VA11343*/ 01463000
*      2 CYL CHAR(2),               /* CYLINDER              @VA11343*/ 01464000
*      2 HD CHAR(1),                /* HEAD                  @VA11343*/ 01465000
*      2 REC CHAR(1);               /* RECORD                @VA11343*/ 01466000
*/* **************************************************************** */ 01467000
*/* STRUCTURE OF RESPONSE FROM QUERY OF MSC CONFIGURATION TABLE      */ 01468000
*/*   NOTE: THE FIELD 'BYTE1' IS USED IN TWO WAYS. EACH OF THE 16    */ 01469000
*/*   MAIN ENTRIES IN THE CONFIGURATION INDEX TABLE CONSISTS OF 4    */ 01470000
*/*   PARTS, THE FIRST OF WHICH IS SIMPLY AN INDICATION WHETHER THE  */ 01471000
*/*   INFORMATION IN THE OTHER 3 PARTS IS ABOUT VUA'S OR NOT. IF THE */ 01472000
*/*   HIGH-ORDER BIT OF THIS FIRST BYTE IS ON, THEN THEY ARE VUA'S.  */ 01473000
*/*   FOR THE OTHER 3 PARTS OF EACH MAIN ENTRY, THE FIELD 'BYTE1'    */ 01474000
*/*   CONTAINS THE CPUID INDEX VALUE ASSOCIATED WITH THIS CPUID.     */ 01475000
*/*   BECAUSE THE CONFIGURATION INDEX TABLE APPEARS TO BE A 16X4     */ 01476000
*/*   ARRAY, THE FOLLOWING STRUCTURE SEEMS TO MOST EFFICIENTLY       */ 01477000
*/*   DESCRIBE IT, IF THE ABOVE NOTE IS KEPT IN MIND.                */ 01478000
*/* **************************************************************** */ 01479000
*                                                                  0458 01480000
*   DCL                                                            0458 01481000
*     1 CONFIGTB BASED(FIRSTPTR),   /*                       @VA11343*/ 01482000
*      2 * CHAR(256),               /* TOP HALF OF QUERY BUFFER    0458 01483000
*                                                            @VA11343*/ 01484000
*      2 CONFIGA(16,4),             /* .. CONFIGURATION INDEX TABLE     01485000
*                                      ..                    @VA11343*/ 01486000
*       3 BYTE1 BIT(8),             /* EITHER INDEX OR             0458 01487000
*                                      CARTRIDGE-STORE       @VA11343*/ 01488000
*        4 BIT1 BIT(1),             /* ON - THIS IS A CARTRIDGE STORE   01489000
*                                                            @VA11343*/ 01490000
*        4 * BIT(7),                /* BITS USED IN INDEX VALUE    0458 01491000
*                                                            @VA11343*/ 01492000
*       3 BYTE2 BIT(8),             /* CHANNEL, CONTROL UNIT @VA11343*/ 01493000
*        4 CTLUNIT BIT(2),          /* CU BITS OF CUU        @VA11343*/ 01494000
*        4 * BIT(2),                /* ... UNREFERENCED ...  @VA11343*/ 01495000
*        4 CHANNEL BIT(4),          /* CH BITS OF CUU (CUD)  @VA11343*/ 01496000
*      2 MFGID(16),                 /* ... MANUFACTURER'S ID TABLE 0458 01497000
*                                      ...                   @VA11343*/ 01498000
*       3 MFGCPUID CHAR(5),         /* CPUID                 @VA11343*/ 01499000
*       3 * CHAR(3);                /* ... UNREFERENCED ...  @VA11343*/ 01500000
*/* **************************************************************** */ 01501000
*/*  STRUCTURE OF CONFIGURATION DATA BLOCK BUFFER OF QUERY RESPONSE  */ 01502000
*/* **************************************************************** */ 01503000
*                                                                  0459 01504000
*   DCL                                                            0459 01505000
*     1 CONFIGDB BASED(SECNDPTR),   /*                       @VA11343*/ 01506000
*      2 * CHAR(256),               /* FIRST HALF OF QUERY BUFFER  0459 01507000
*                                                            @VA11343*/ 01508000
*      2 CONFIGB(64),               /* CONFIGURATION DATA BLOCK ENTRY   01509000
*                                                            @VA11343*/ 01510000
*       3 STATUS BIT(8),            /* SHARED STATUS AND SDG NUMBER     01511000
*                                                            @VA11343*/ 01512000
*        4 CONFSHR BIT(1),          /* CAN'T BE SHARED W/OTHER CPU'S    01513000
*                                      IF ON@VA11343                 */ 01514000
*        4 * BIT(2),                /* ..... UNREFERENCED .....    0459 01515000
*                                                            @VA11343*/ 01516000
*        4 CONFSDG BIT(5),          /* SDG NUMBER            @VA11343*/ 01517000
*       3 * CHAR(3);                /* ..... UNREFERENCED .....    0459 01518000
*                                                            @VA11343*/ 01519000
*/* **************************************************************** */ 01520000
*/* STRUCTURE OF TABLE OF VUA'S IN CP'S CONFIGURATION TO PASS TO CP  */ 01521000
*/* **************************************************************** */ 01522000
*                                                                  0460 01523000
*   DCL                                                            0460 01524000
*     1 MSSTBL BASED(MSSPTR),       /*                       @VA11343*/ 01525000
*      2 CNTVUA FIXED(31),          /* COUNT OF VUA'S FOUND  @VA11343*/ 01526000
*      2 VUATBL(1792),              /* VUA LIST (1792 POSSIBLE)    0460 01527000
*                                                            @VA11343*/ 01528000
*       3 VUA1 BIT(8),              /* .... CHANNEL ....     @VA11343*/ 01529000
*        4 ZEROS BIT(4),            /* FILLER, SHOULD BE X'0'      0460 01530000
*                                                            @VA11343*/ 01531000
*        4 CH BIT(4),               /* BITS REPRESENTING CHANNEL   0460 01532000
*                                                            @VA11343*/ 01533000
*       3 VUA2 BIT(8),              /* .... CONTROL UNIT, DEVICE   0460 01534000
*                                                            @VA11343*/ 01535000
*        4 CU BIT(2),               /* BITS REPRESENTING CTL UNIT  0460 01536000
*                                                            @VA11343*/ 01537000
*        4 DV BIT(6),               /* BITS REPRESENTING DEVICE    0460 01538000
*                                                            @VA11343*/ 01539000
*       3 STAT BIT(8),              /* .... STATUS FLAGS ....      0460 01540000
*                                                            @VA11343*/ 01541000
*        4 SHRD BIT(1),             /* WHEN ON, VUA MAY BE SHARED  0460 01542000
*                                                            @VA11343*/ 01543000
*        4 * BIT(7),                /* ..... RESERVED .....  @VA11343*/ 01544000
*       3 NUMSDG BIT(8),            /* .... SDG FIELD ....   @VA11343*/ 01545000
*        4 * BIT(3),                /* LEADING BITS OF SDG MUST BE 0460 01546000
*                                      ZEROS                 @VA11343*/ 01547000
*        4 SDGNUM BIT(5);           /* SDG NUMBER THIS VUA IS IN   0460 01548000
*                                                            @VA11343*/ 01549000
*                                                                  0461 01550000
*/* **************************************************************** */ 01551000
*/*   OTHER DECLARES FOR THIS SUB-PROC                               */ 01552000
*/* **************************************************************** */ 01553000
*                                                                  0461 01554000
*   DCL                                                            0461 01555000
*     FIRSTPTR PTR(31),             /* PTR TO 1ST QUERY BUFFER     0461 01556000
*                                                            @VA11343*/ 01557000
*     SECNDPTR PTR(31),             /* PTR TO 2ND QUERY BUFFER     0461 01558000
*                                                            @VA11343*/ 01559000
*     MSSPTR PTR(31);               /* PTR TO TABLE OF VUA'S @VA11343*/ 01560000
*   DCL                                                            0462 01561000
*     RELINDEX FIXED(15);           /* REL INDX INTO MFG CPUID TABLE    01562000
*                                                            @VA11343*/ 01563000
*   DCL                                                            0463 01564000
*     LNDEX FIXED(8),               /* LOOP CONTROL - 1 TO 16      0463 01565000
*                                                            @VA11343*/ 01566000
*     JNDEX FIXED(8),               /* INDEX TO THIS SA PORT (B,C,D)    01567000
*                                                            @VA11343*/ 01568000
*     KNDEX FIXED BIN(8),           /* LOOP CONTROL - 64 VUA'S/SDG 0463 01569000
*                                                            @VA11343*/ 01570000
*     TEMP1 BIT(8);                 /* TEMP STORE FOR BIT          0463 01571000
*                                      MANIPULATION          @VA11343*/ 01572000
*   DCL                                                            0464 01573000
*     TEMP2 FIXED(31);                                             0464 01574000
*                                                                  0464 01575000
*/* **************************************************************** */ 01576000
*/*   END OF DECLARES FOR THIS SUB-PROC                              */ 01577000
*/* **************************************************************** */ 01578000
*                                                                  0465 01579000
*                                                                  0465 01580000
*/* **************************************************************** */ 01581000
*/* GET A BUFFER FOR CONFIGURATION TABLE, A BUFFER FOR CONFIGURATION */ 01582000
*/*  INDEX TABLE, AND A LARGE BUFFER TO PASS VUA'S TO CP IN          */ 01583000
*/* **************************************************************** */ 01584000
*                                                                  0465 01585000
*   RFY                                                            0465 01586000
*    (R0,                                                          0465 01587000
*     R1,                                                          0465 01588000
*     R2) RSTD;                     /*                       @VA11343*/ 01589000
*   R0=512;                         /* SIZE OF CONFIG TABLES @VA11343*/ 01590000
         LA    R0,512                                              0466 01591000
*   GEN(GETMAIN R,LV=(0));          /* GET BUFFER FOR CONFIG INDX  0467 01592000
*                                                            @VA11343*/ 01593000
         GETMAIN R,LV=(0)                                               01594000
*   FIRSTPTR=R1;                    /* SAVE ADDR OF CONFIG         0468 01595000
*                                      INDX/MANUF. ID TABLE  @VA11343*/ 01596000
         ST    R1,FIRSTPTR                                         0468 01597000
*   R0=512;                         /* SIZE OF CONFIG DATA BLOCK   0469 01598000
*                                      RESPONSE              @VA11343*/ 01599000
         LA    R0,512                                              0469 01600000
*   GEN(GETMAIN R,LV=(0));          /* GET BUFFER FOR CONFIG D.B.  0470 01601000
*                                                            @VA11343*/ 01602000
         GETMAIN R,LV=(0)                                               01603000
*   SECNDPTR=R1;                    /* SAVE ADDR OF CONFIG DATA BLOCK   01604000
*                                      RESPONSE              @VA11343*/ 01605000
         ST    R1,SECNDPTR                                         0471 01606000
*   R2=7172;                        /* SIZE OF VUA TABLE TO BE SENT     01607000
*                                      TO CP                 @VA11343*/ 01608000
         L     R2,@CF03206                                         0472 01609000
*   GEN(GETMAIN R,LV=(2),SP=253);   /* GET BUFFER FOR VUA TABLE    0473 01610000
*                                                            @VA11343*/ 01611000
         GETMAIN R,LV=(2),SP=253                                        01612000
*   MSSPTR=R1;                      /* SAVE ADDR OF VUA BUFFER     0474 01613000
*                                                            @VA11343*/ 01614000
         ST    R1,MSSPTR                                           0474 01615000
*   CNTVUA=ZEROFULL;                /* CLEAR COUNT FIELD IN BUFF   0475 01616000
*                                                            @VA11343*/ 01617000
         L     @12,MSSPTR                                          0475 01618000
         SLR   @15,@15                                             0475 01619000
         ST    @15,CNTVUA(,@12)                                    0475 01620000
*   RFY                                                            0476 01621000
*    (R0,                                                          0476 01622000
*     R1,                                                          0476 01623000
*     R2) UNRSTD;                   /* UNRESTRICT R0,R1,R2   @VA11343*/ 01624000
*/* **************************************************************** */ 01625000
*/*  END OF BUFFER-GRABBING ROUTINE                                  */ 01626000
*/* **************************************************************** */ 01627000
*                                                                  0477 01628000
*   QRYID='70'X;                    /* SET UP TABLE ID       @VA11343*/ 01629000
         MVI   QRYID,X'70'                                         0477 01630000
*   QRYRD='11'X;                    /* SET UP READ OF MSC TABLES   0478 01631000
*                                                            @VA11343*/ 01632000
         MVI   QRYRD,X'11'                                         0478 01633000
*   CYL='001A'X;                    /* SET UP CYLINDER ID    @VA11343*/ 01634000
         MVC   CYL(2),@CB03209                                     0479 01635000
*   HD='0A'X;                       /* SET UP HEAD ID        @VA11343*/ 01636000
         MVI   HD,X'0A'                                            0480 01637000
*   REC='01'X;                      /* SET UP READ OF RECORD 1     0481 01638000
*                                                            @VA11343*/ 01639000
         MVI   REC,X'01'                                           0481 01640000
*/* **************************************************************** */ 01641000
*/* QUERY MSC TO GET CONFIGURATION TABLE, MANUFACTURER'S ID TABLE    */ 01642000
*/* **************************************************************** */ 01643000
*/*  ******************************************************* @Z40LB22*/ 01644000
*/*  MSSC ICBQUERY QSWCS/QLAB/QTAB/QSWCS QCEL  MACRO         @Z40LB22*/ 01645000
*/*  OS/VS2 VERSION-- 03/21/75 LEVEL 00                      @Z40LB22*/ 01646000
*/*  THIS IS THE OUTPUT FOR THE EXECUTE FORM.                @Z40LB22*/ 01647000
*/*  THE LIST FORM OF THIS MACRO SHOULD BE                   @Z40LB22*/ 01648000
*/*  INVOKED FIRST IN ORDER TO SET UP NECESSARY              @Z40LB22*/ 01649000
*/*  DECLARES.  IF THE COMPLETE ARGUMENT IS                  @Z40LB22*/ 01650000
*/*  SPECIFIED THE REQ BLOCK WILL BE ZEROED.                 @Z40LB22*/ 01651000
*/*  ******************************************************* @Z40LB22*/ 01652000
*                                                                  0482 01653000
*   RFY                                                            0482 01654000
*    (QUERR1) RSTD;                 /* RESTRICT R1           @Z40LB22*/ 01655000
*   QUERR1=ADDR(QUERLIST);          /* SET QUERR1 TO REQ BLOCK     0483 01656000
*                                                            @Z40LB22*/ 01657000
         LA    QUERR1,QUERLIST                                     0483 01658000
*   QUERLIST=QUERLIST&&QUERLIST;    /* ZERO REQUEST BLOCK    @Z40LB22*/ 01659000
         XC    QUERLIST(44),QUERLIST                               0484 01660000
*   QULEN='2C'X;                    /* SET LENGTH FIELD      @Z40LB22*/ 01661000
         LA    @12,44                                              0485 01662000
         ST    @12,QULEN                                           0485 01663000
*   QUORD='05'X;                    /* SET OPCODE FIELD      @Z40LB22*/ 01664000
         MVI   QUORD,X'05'                                         0486 01665000
*   QUCODE='06'X;                   /* SET CODE TYPE         @Z40LB22*/ 01666000
         MVI   QUCODE,X'06'                                        0487 01667000
*   QUPARM=(QRYPARM);               /* FILL IN PARAMETERS    @Z40LB22*/ 01668000
         MVI   QUPARM+20,C' '                                      0488 01669000
         MVC   QUPARM+21(11),QUPARM+20                             0488 01670000
         MVC   QUPARM(20),QRYPARM                                  0488 01671000
*   QTDASCHR=(CHRMAP);              /* FILL IN CHR           @Z40LB22*/ 01672000
         MVC   QTDASCHR(4),CHRMAP                                  0489 01673000
*   QUPTR=ADDR(CONFIGTB);           /* ADDR OF DATAPTR FIELD @Z40LB22*/ 01674000
         L     @12,FIRSTPTR                                        0490 01675000
         ST    @12,QUPTR                                           0490 01676000
*   SVC(126);                       /* ISSUE SVC INST.       @Z40LB22*/ 01677000
         SVC   126                                                 0491 01678000
*   RFY                                                            0492 01679000
*    (QUERR1) UNRSTD;               /* UNRESTRICT R1         @Z40LB22*/ 01680000
*/*      @VA11343                                                    */ 01681000
*                                                                  0493 01682000
*   RFY                                                            0493 01683000
*     R15 RSTD;                     /*                       @VA11343*/ 01684000
*/* **************************************************************** */ 01685000
*/* IF THE QUERY OF THE CONFIGURATION TABLE DID NOT GO OKAY, SET A   */ 01686000
*/* RETURN CODE OF 4 IN R15 AND RETURN; THE CENTRAL SERVER WILL BE   */ 01687000
*/* TERMINATED.                                                      */ 01688000
*/* **************************************************************** */ 01689000
*                                                                  0494 01690000
*   IF R15^=0 THEN                                                 0494 01691000
         LTR   R15,R15                                             0494 01692000
         BZ    @RF00494                                            0494 01693000
*     R15=4;                        /*                       @VA11343*/ 01694000
         LA    R15,4                                               0495 01695000
*   ELSE                                                           0496 01696000
*     DO;                           /*                       @VA11343*/ 01697000
         B     @RC00494                                            0496 01698000
@RF00494 DS    0H                                                  0497 01699000
*/* **************************************************************** */ 01700000
*/* IF QUERY OF CONFIGURATION TABLE WENT OKAY, LOOK IN THE           */ 01701000
*/* MANUFACTURER'S ID TABLE FOR A MATCH TO THIS CPUID. IF NOT FOUND, */ 01702000
*/* SET R15 = 8 AND RETURN (CENTRAL SERVER WILL BE TERMINATED). IF   */ 01703000
*/* A MATCH IS FOUND, COMPUTE THE RELATIVE CPUID INDEX INTO THE      */ 01704000
*/* CONFIGURATION INDEX TABLE BY SUBTRACTING 1 FROM THE INDEX INTO   */ 01705000
*/* MANUFACTURER'S ID TABLE (CPUID INDICES START AT 0 WHILE MFG ID   */ 01706000
*/* INDICES START AT 1).                                             */ 01707000
*/* **************************************************************** */ 01708000
*                                                                  0497 01709000
*       RFY                                                        0497 01710000
*         R15 UNRSTD;               /*                       @VA11343*/ 01711000
*       DO LNDEX=1 TO 16 WHILE(CPUID^=MFGCPUID(LNDEX));/*    @VA11343*/ 01712000
         LA    @12,1                                               0498 01713000
         STC   @12,LNDEX                                           0498 01714000
@DL00498 LR    @01,@12                                             0498 01715000
         SLA   @01,3                                               0498 01716000
         L     @15,FIRSTPTR                                        0498 01717000
         ALR   @15,@01                                             0498 01718000
         CLC   CPUID(5),MFGCPUID-8(@15)                            0498 01719000
         BE    @DC00498                                            0498 01720000
*       END;                        /*                       @VA11343*/ 01721000
         AL    @12,@CF00074                                        0499 01722000
         STC   @12,LNDEX                                           0499 01723000
         C     @12,@CF00060                                        0499 01724000
         BNH   @DL00498                                            0499 01725000
@DC00498 DS    0H                                                  0500 01726000
*       RFY                                                        0500 01727000
*         R15 RSTD;                 /*                       @VA11343*/ 01728000
*/* **************************************************************** */ 01729000
*/* AT THIS POINT WE HAVE LOOKED AT ALL THE CPUID'S IN THE MANUFAC-  */ 01730000
*/* TURER'S ID TABLE. IF THE LAST ONE DOESN'T MATCH, THEN NONE DO.   */ 01731000
*/* **************************************************************** */ 01732000
*                                                                  0501 01733000
*       IF CPUID^=MFGCPUID(LNDEX) THEN                             0501 01734000
         SLR   @14,@14                                             0501 01735000
         IC    @14,LNDEX                                           0501 01736000
         SLA   @14,3                                               0501 01737000
         L     @12,FIRSTPTR                                        0501 01738000
         ALR   @12,@14                                             0501 01739000
         CLC   CPUID(5),MFGCPUID-8(@12)                            0501 01740000
         BE    @RF00501                                            0501 01741000
*         R15=8;                    /*                       @VA11343*/ 01742000
         LA    R15,8                                               0502 01743000
*       ELSE                                                       0503 01744000
*         DO;                       /*                       @VA11343*/ 01745000
         B     @RC00501                                            0503 01746000
@RF00501 DS    0H                                                  0504 01747000
*           RFY                                                    0504 01748000
*             R15 UNRSTD;           /*                       @VA11343*/ 01749000
*           RELINDEX=LNDEX-1;       /* RELATIVE INDEX TO CPUID     0505 01750000
*                                                            @VA11343*/ 01751000
         SLR   @12,@12                                             0505 01752000
         IC    @12,LNDEX                                           0505 01753000
         BCTR  @12,0                                               0505 01754000
         STH   @12,RELINDEX                                        0505 01755000
*/* **************************************************************** */ 01756000
*/* NOW THAT WE HAVE SET THE RELATIVE CPUID INDEX, WE NEED TO LOOK   */ 01757000
*/* AT EACH OF THE 16 ENTRIES IN THE CONFIGURATION INDEX TABLE. IF   */ 01758000
*/* THE FIRST BIT OF EACH ENTRY IS ON, THEN THAT ENTRY REPRESENTS A  */ 01759000
*/* CARTRIDGE STORE AND WE WANT TO IGNORE IT. IF THE FIRST BIT IS    */ 01760000
*/* OFF, THAT ENTRY REPRESENTS UP TO 3 SETS OF UP TO 64 VUA'S EACH.  */ 01761000
*/* **************************************************************** */ 01762000
*                                                                  0506 01763000
*           DO LNDEX=1 TO 16;       /* NOW READ CONFIG TABLE @VA11343*/ 01764000
         LA    @12,1                                               0506 01765000
         STC   @12,LNDEX                                           0506 01766000
@DL00506 DS    0H                                                  0507 01767000
*             IF BIT1(LNDEX,1)=ON THEN                             0507 01768000
         SLA   @12,3                                               0507 01769000
         L     @01,FIRSTPTR                                        0507 01770000
         ALR   @01,@12                                             0507 01771000
         TM    BIT1-8(@01),B'10000000'                             0507 01772000
         BO    @RT00507                                            0507 01773000
*               ;                   /* IF ON - IGNORE THE          0508 01774000
*                                      ENTRY@VA11343                 */ 01775000
*/* **************************************************************** */ 01776000
*/* IF THE ENTRY IS OF VUA'S, WE WANT TO CHECK THE 1ST BYTE OF EACH  */ 01777000
*/* OF THE REMAINING 3 TWO-BYTE PARTS OF THAT ENTRY FOR A MATCH WITH */ 01778000
*/* THE RELATIVE CPUID INDEX WE HAVE COMPUTED ABOVE. IF IT DOESN'T   */ 01779000
*/* MATCH, WE IGNORE IT. IF IT MATCHES, WE NEED TO COMPUTE THE PARMS */ 01780000
*/* AND RECORD NUMBER OF THE CORRECT CONFIGURATION DATA BLOCK TO BE  */ 01781000
*/* READ, AND ISSUE THE READ REQUEST.                                */ 01782000
*/* **************************************************************** */ 01783000
*                                                                  0509 01784000
*             ELSE                                                 0509 01785000
*               DO JNDEX=2 TO 4 BY 1;/* ELSE CHECK EACH PORT @VA11343*/ 01786000
         LA    @12,2                                               0509 01787000
         STC   @12,JNDEX                                           0509 01788000
@DL00509 DS    0H                                                  0510 01789000
*/* **************************************************************** */ 01790000
*/* IGNORE IF NOT THE PROPER CPUID                                   */ 01791000
*/* **************************************************************** */ 01792000
*                                                                  0510 01793000
*                 IF BYTE1(LNDEX,JNDEX)^=RELINDEX THEN             0510 01794000
         SLR   @01,@01                                             0510 01795000
         IC    @01,LNDEX                                           0510 01796000
         SLA   @01,2                                               0510 01797000
         ALR   @01,@12                                             0510 01798000
         ALR   @01,@01                                             0510 01799000
         L     @12,FIRSTPTR                                        0510 01800000
         SLR   @15,@15                                             0510 01801000
         IC    @15,BYTE1-10(@01,@12)                               0510 01802000
         CH    @15,RELINDEX                                        0510 01803000
         BNE   @RT00510                                            0510 01804000
*                   ;               /*                       @VA11343*/ 01805000
*                 ELSE                                             0512 01806000
*                   DO;             /*                       @VA11343*/ 01807000
*                     REC=((LNDEX-1)*4)+JNDEX;/* REC NUM OF C. D.  0513 01808000
*                                      BLOK                  @VA11343*/ 01809000
         SLR   @12,@12                                             0513 01810000
         IC    @12,LNDEX                                           0513 01811000
         BCTR  @12,0                                               0513 01812000
         SLA   @12,2                                               0513 01813000
         SLR   @01,@01                                             0513 01814000
         IC    @01,JNDEX                                           0513 01815000
         ALR   @12,@01                                             0513 01816000
         STC   @12,REC                                             0513 01817000
*                     IF REC<=32 THEN                              0514 01818000
         CLI   REC,32                                              0514 01819000
         BNH   @RT00514                                            0514 01820000
*                       ;           /* WE NEED TO MOVE TO NEXT HEAD?    01821000
*                                                            @VA11343*/ 01822000
*                     ELSE                                         0516 01823000
*                       DO;         /* YES!!!!               @VA11343*/ 01824000
*                         HD='0B'X; /* SET NEXT HEAD ID      @VA11343*/ 01825000
         MVI   HD,X'0B'                                            0517 01826000
*                         REC=REC-32;/* COMPUTE REC NUM FOR NEW HEAD    01827000
*                                                            @VA11343*/ 01828000
         SLR   @12,@12                                             0518 01829000
         IC    @12,REC                                             0518 01830000
         SL    @12,@CF01168                                        0518 01831000
         STC   @12,REC                                             0518 01832000
*                       END;        /*                       @VA11343*/ 01833000
*                                                                  0519 01834000
*                     /***********************************************/ 01835000
*                     /*                                             */ 01836000
*                     /* *********************************************/ 01837000
*                     /* ***********                         @Z40LB22*/ 01838000
*                     /* MSSC ICBQUERY QSWCS/QLAB/QTAB/QSWCS QCEL    */ 01839000
*                     /* MACRO                               @Z40LB22*/ 01840000
*                     /* OS/VS2 VERSION-- 03/21/75 LEVEL 00  @Z40LB22*/ 01841000
*                     /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.    */ 01842000
*                     /*                                     @Z40LB22*/ 01843000
*                     /* THE LIST FORM OF THIS MACRO SHOULD BE       */ 01844000
*                     /*                                     @Z40LB22*/ 01845000
*                     /* INVOKED FIRST IN ORDER TO SET UP NECESSARY  */ 01846000
*                     /*                                     @Z40LB22*/ 01847000
*                     /* DECLARES. IF THE COMPLETE ARGUMENT IS       */ 01848000
*                     /*                                     @Z40LB22*/ 01849000
*                     /* SPECIFIED THE REQ BLOCK WILL BE ZEROED.     */ 01850000
*                     /*                                     @Z40LB22*/ 01851000
*                     /* *********************************************/ 01852000
*                     /* ***********                         @Z40LB22*/ 01853000
*                     /*                                             */ 01854000
*                     /***********************************************/ 01855000
*                                                                  0520 01856000
*                     RFY                                          0520 01857000
*                      (QUERR1) RSTD;/* RESTRICT R1          @Z40LB22*/ 01858000
@RT00514 DS    0H                                                  0521 01859000
*                     QUERR1=ADDR(QUERLIST);/* SET QUERR1 TO REQ   0521 01860000
*                                      BLOCK                 @Z40LB22*/ 01861000
         LA    QUERR1,QUERLIST                                     0521 01862000
*                     QUERLIST=QUERLIST&&QUERLIST;/* ZERO REQUEST  0522 01863000
*                                      BLOCK                 @Z40LB22*/ 01864000
         XC    QUERLIST(44),QUERLIST                               0522 01865000
*                     QULEN='2C'X;  /* SET LENGTH FIELD      @Z40LB22*/ 01866000
         LA    @12,44                                              0523 01867000
         ST    @12,QULEN                                           0523 01868000
*                     QUORD='05'X;  /* SET OPCODE FIELD      @Z40LB22*/ 01869000
         MVI   QUORD,X'05'                                         0524 01870000
*                     QUCODE='06'X; /* SET CODE TYPE         @Z40LB22*/ 01871000
         MVI   QUCODE,X'06'                                        0525 01872000
*                     QUPARM=(QRYPARM);/* FILL IN PARAMETERS @Z40LB22*/ 01873000
         MVI   QUPARM+20,C' '                                      0526 01874000
         MVC   QUPARM+21(11),QUPARM+20                             0526 01875000
         MVC   QUPARM(20),QRYPARM                                  0526 01876000
*                     QTDASCHR=(CHRMAP);/* FILL IN CHR       @Z40LB22*/ 01877000
         MVC   QTDASCHR(4),CHRMAP                                  0527 01878000
*                     QUPTR=ADDR(CONFIGDB);/* ADDR OF DATAPTR FIELD     01879000
*                                                            @Z40LB22*/ 01880000
         L     @12,SECNDPTR                                        0528 01881000
         ST    @12,QUPTR                                           0528 01882000
*                     SVC(126);     /* ISSUE SVC INST.       @Z40LB22*/ 01883000
         SVC   126                                                 0529 01884000
*                     RFY                                          0530 01885000
*                      (QUERR1) UNRSTD;/* UNRESTRICT R1      @Z40LB22*/ 01886000
*                                                                  0530 01887000
*                     /***********************************************/ 01888000
*                     /*                                             */ 01889000
*                     /*                                     @VA11343*/ 01890000
*                     /*                                             */ 01891000
*                     /***********************************************/ 01892000
*                                                                  0531 01893000
*                     RFY                                          0531 01894000
*                      (R0,                                        0531 01895000
*                       R1,                                        0531 01896000
*                       R15) RSTD;  /*                       @VA11343*/ 01897000
*/* **************************************************************** */ 01898000
*/* IF R15^=0 THEN ERROR ON QUERY. SET A RETURN CODE OF 4 AND RETURN */ 01899000
*/* TO CALLER, WHERE THE CENTRAL SERVER WILL BE TERMINATED.          */ 01900000
*/* **************************************************************** */ 01901000
*                                                                  0532 01902000
*                     IF R15^=0 THEN                               0532 01903000
         LTR   R15,R15                                             0532 01904000
         BZ    @RF00532                                            0532 01905000
*                       DO;         /*                       @VA11343*/ 01906000
*                         R15=4;    /*                       @VA11343*/ 01907000
         LA    R15,4                                               0534 01908000
*                         GO TO ENDALL;/*                    @VA11343*/ 01909000
         B     ENDALL                                              0535 01910000
*                       END;        /*                       @VA11343*/ 01911000
*/* **************************************************************** */ 01912000
*/* IF QUERY WAS GOOD CHECK EACH OF THE 64 ENTRIES IN THE RESPONSE   */ 01913000
*/* BUFFER. IF THE STATUS OF ANY ENTRY IS SET TO X'FF' THEN IGNORE   */ 01914000
*/* ENTRY. OTHERWISE, IT'S A GOOD ENTRY SO GET THE SDG AND VUA NBRS. */ 01915000
*/* **************************************************************** */ 01916000
*                                                                  0537 01917000
*                     ELSE                                         0537 01918000
*                       DO KNDEX=1 TO 64;/*                  @VA11343*/ 01919000
@RF00532 LA    @14,1                                               0537 01920000
         STC   @14,KNDEX                                           0537 01921000
@DL00537 DS    0H                                                  0538 01922000
*                         IF STATUS(KNDEX)='FF'X THEN              0538 01923000
         SLA   @14,2                                               0538 01924000
         L     @12,SECNDPTR                                        0538 01925000
         ALR   @12,@14                                             0538 01926000
         CLI   STATUS-4(@12),X'FF'                                 0538 01927000
         BE    @RT00538                                            0538 01928000
*                           ;       /*                       @VA11343*/ 01929000
*                         ELSE                                     0540 01930000
*                           DO;     /*                       @VA11343*/ 01931000
*                             CNTVUA=CNTVUA+1;/* INCREMENT COUNT OF     01932000
*                                      VUA'S                 @VA11343*/ 01933000
         L     @14,MSSPTR                                          0541 01934000
         LA    @12,1                                               0541 01935000
         AL    @12,CNTVUA(,@14)                                    0541 01936000
         ST    @12,CNTVUA(,@14)                                    0541 01937000
*/* **************************************************************** */ 01938000
*/* PICK UP THE CHANNEL IN THE LOW-ORDER BITS OF THE FIRST BYTE OF   */ 01939000
*/* THIS VUA-TABLE ENTRY.                                            */ 01940000
*/* **************************************************************** */ 01941000
*                                                                  0542 01942000
*                             VUA1(CNTVUA)=(VUA1(CNTVUA)&'00'X)|/* 0542 01943000
*                                                            @VA11343*/ 01944000
*                                 (BYTE2(LNDEX,JNDEX)&'0F'X);/*    0542 01945000
*                                                            @VA11343*/ 01946000
         SLA   @12,2                                               0542 01947000
         ST    @12,@TF00001                                        0542 01948000
         ALR   @12,@14                                             0542 01949000
         ST    @12,@TF00002                                        0542 01950000
         LR    @12,@14                                             0542 01951000
         AL    @12,@TF00001                                        0542 01952000
         MVC   @TS00001(1),VUA1-4(@12)                             0542 01953000
         NI    @TS00001,X'00'                                      0542 01954000
         L     @12,FIRSTPTR                                        0542 01955000
         SLR   @14,@14                                             0542 01956000
         IC    @14,LNDEX                                           0542 01957000
         SLA   @14,2                                               0542 01958000
         ST    @12,@TF00003                                        0542 01959000
         SLR   @12,@12                                             0542 01960000
         IC    @12,JNDEX                                           0542 01961000
         ALR   @14,@12                                             0542 01962000
         ALR   @14,@14                                             0542 01963000
         L     @12,@TF00003                                        0542 01964000
         ALR   @12,@14                                             0542 01965000
         MVC   @TS00001+1(1),BYTE2-10(@12)                         0542 01966000
         NI    @TS00001+1,X'0F'                                    0542 01967000
         OC    @TS00001(1),@TS00001+1                              0542 01968000
         L     @12,@TF00002                                        0542 01969000
         MVC   VUA1-4(1,@12),@TS00001                              0542 01970000
*/* **************************************************************** */ 01971000
*/* PICK UP THE CONTROL UNIT IN THE HIGH-ORDER 2 BITS OF THE SECOND  */ 01972000
*/* BYTE OF THIS VUA-TABLE ENTRY.                                    */ 01973000
*/* **************************************************************** */ 01974000
*                                                                  0543 01975000
*                             VUA2(CNTVUA)=(VUA2(CNTVUA)&'3F'X)|/* 0543 01976000
*                                                            @VA11343*/ 01977000
*                                 (BYTE2(LNDEX,JNDEX)&'C0'X);/*    0543 01978000
*                                                            @VA11343*/ 01979000
         L     @12,MSSPTR                                          0543 01980000
         ST    @14,@TF00002                                        0543 01981000
         LR    @14,@12                                             0543 01982000
         AL    @14,@TF00001                                        0543 01983000
         ST    @14,@TF00004                                        0543 01984000
         LR    @14,@12                                             0543 01985000
         AL    @14,@TF00001                                        0543 01986000
         MVC   @TS00001(1),VUA2-4(@14)                             0543 01987000
         NI    @TS00001,X'3F'                                      0543 01988000
         L     @14,@TF00003                                        0543 01989000
         AL    @14,@TF00002                                        0543 01990000
         MVC   @TS00001+1(1),BYTE2-10(@14)                         0543 01991000
         NI    @TS00001+1,X'C0'                                    0543 01992000
         OC    @TS00001(1),@TS00001+1                              0543 01993000
         L     @14,@TF00004                                        0543 01994000
         MVC   VUA2-4(1,@14),@TS00001                              0543 01995000
*                             TEMP1=KNDEX-1;/* SET UP FOR BIT MOVE 0544 01996000
*                                                            @VA11343*/ 01997000
         SLR   @14,@14                                             0544 01998000
         IC    @14,KNDEX                                           0544 01999000
         LR    @12,@14                                             0544 02000000
         BCTR  @12,0                                               0544 02001000
         STC   @12,TEMP1                                           0544 02002000
*/* **************************************************************** */ 02003000
*/* THE REMAINING BITS IN THE THIRD BYTE OF THIS VUA-TABLE ENTRY     */ 02004000
*/* SHOULD CONTAIN THE INDEX INTO THE CONFIG DATA BLOK (1-64) MINUS  */ 02005000
*/* 1. THIS IS THE DEVICE NUMBER.                                    */ 02006000
*/* **************************************************************** */ 02007000
*                                                                  0545 02008000
*                             VUA2(CNTVUA)=(VUA2(CNTVUA)&'C0'X)|/* 0545 02009000
*                                                            @VA11343*/ 02010000
*                                 (TEMP1&'3F'X);                   0545 02011000
*                                                                  0545 02012000
         L     @12,MSSPTR                                          0545 02013000
         LR    @14,@12                                             0545 02014000
         AL    @14,@TF00001                                        0545 02015000
         ST    @14,@TF00002                                        0545 02016000
         LR    @14,@12                                             0545 02017000
         AL    @14,@TF00001                                        0545 02018000
         MVC   @TS00001(1),VUA2-4(@14)                             0545 02019000
         NI    @TS00001,X'C0'                                      0545 02020000
         MVC   @TS00001+1(1),TEMP1                                 0545 02021000
         NI    @TS00001+1,X'3F'                                    0545 02022000
         OC    @TS00001(1),@TS00001+1                              0545 02023000
         L     @14,@TF00002                                        0545 02024000
         MVC   VUA2-4(1,@14),@TS00001                              0545 02025000
*/* **************************************************************** */ 02026000
*/* CP EXPECTS SHARED STATUS TO BE REFLECTED EXACTLY OPPOSITE FROM   */ 02027000
*/*        HOW IT'S REPRESENTED IN THE MSC TABLES                    */ 02028000
*/* **************************************************************** */ 02029000
*                                                                  0546 02030000
*                             IF CONFSHR(KNDEX)=ON THEN            0546 02031000
         SLR   @14,@14                                             0546 02032000
         IC    @14,KNDEX                                           0546 02033000
         SLA   @14,2                                               0546 02034000
         L     @12,SECNDPTR                                        0546 02035000
         ALR   @12,@14                                             0546 02036000
         TM    CONFSHR-4(@12),B'10000000'                          0546 02037000
         BNO   @RF00546                                            0546 02038000
*                               SHRD(CNTVUA)=OFF;/*          @VA11343*/ 02039000
         L     @14,MSSPTR                                          0547 02040000
         AL    @14,@TF00001                                        0547 02041000
         NI    SHRD-4(@14),B'01111111'                             0547 02042000
*                             ELSE                                 0548 02043000
*                               SHRD(CNTVUA)=ON;/*           @VA11343*/ 02044000
         B     @RC00546                                            0548 02045000
@RF00546 L     @14,MSSPTR                                          0548 02046000
         L     @12,CNTVUA(,@14)                                    0548 02047000
         SLA   @12,2                                               0548 02048000
         ALR   @14,@12                                             0548 02049000
         OI    SHRD-4(@14),B'10000000'                             0548 02050000
*/* **************************************************************** */ 02051000
*/* GET THE SDG NUMBER                                               */ 02052000
*/* **************************************************************** */ 02053000
*                                                                  0549 02054000
*                             NUMSDG(CNTVUA)='00'X;/*        @VA11343*/ 02055000
@RC00546 L     @14,MSSPTR                                          0549 02056000
         L     @12,CNTVUA(,@14)                                    0549 02057000
         SLA   @12,2                                               0549 02058000
         ST    @12,@TF00001                                        0549 02059000
         ALR   @12,@14                                             0549 02060000
         MVI   NUMSDG-4(@12),X'00'                                 0549 02061000
*                             NUMSDG(CNTVUA)=(STATUS(KNDEX)&'1F'X);/*   02062000
*                                                            @VA11343*/ 02063000
         AL    @14,@TF00001                                        0550 02064000
         SLR   @12,@12                                             0550 02065000
         IC    @12,KNDEX                                           0550 02066000
         SLA   @12,2                                               0550 02067000
         ST    @12,@TF00001                                        0550 02068000
         L     @12,SECNDPTR                                        0550 02069000
         AL    @12,@TF00001                                        0550 02070000
         MVC   NUMSDG-4(1,@14),STATUS-4(@12)                       0550 02071000
         NI    NUMSDG-4(@14),X'1F'                                 0550 02072000
*                           END;    /*                       @VA11343*/ 02073000
*                       END;        /*                       @VA11343*/ 02074000
@RT00538 LA    @14,1                                               0552 02075000
         SLR   @12,@12                                             0552 02076000
         IC    @12,KNDEX                                           0552 02077000
         ALR   @14,@12                                             0552 02078000
         STC   @14,KNDEX                                           0552 02079000
         C     @14,@CF01914                                        0552 02080000
         BNH   @DL00537                                            0552 02081000
*                   END;            /*                       @VA11343*/ 02082000
*               END;                /*                       @VA11343*/ 02083000
@RT00510 LA    @12,1                                               0554 02084000
         SLR   @01,@01                                             0554 02085000
         IC    @01,JNDEX                                           0554 02086000
         ALR   @12,@01                                             0554 02087000
         STC   @12,JNDEX                                           0554 02088000
         C     @12,@CF00109                                        0554 02089000
         BNH   @DL00509                                            0554 02090000
*           END;                    /*                       @VA11343*/ 02091000
@RT00507 LA    @12,1                                               0555 02092000
         SLR   @01,@01                                             0555 02093000
         IC    @01,LNDEX                                           0555 02094000
         ALR   @12,@01                                             0555 02095000
         STC   @12,LNDEX                                           0555 02096000
         C     @12,@CF00060                                        0555 02097000
         BNH   @DL00506                                            0555 02098000
*         END;                      /*                       @VA11343*/ 02099000
*     END;                          /*                       @VA11343*/ 02100000
@RC00501 DS    0H                                                  0558 02101000
*/* **************************************************************** */ 02102000
*/*  WE'RE JUST ABOUT DONE WITH INITIALIZATION. GET RID OF BUFFERS.  */ 02103000
*/* **************************************************************** */ 02104000
*                                                                  0558 02105000
*ENDALL:                            /*                       @VA11343*/ 02106000
*   RFY                                                            0558 02107000
*    (R0,                                                          0558 02108000
*     R1,                                                          0558 02109000
*     R2,                                                          0558 02110000
*     R15) RSTD;                    /*                       @VA11343*/ 02111000
@RC00494 DS    0H                                                  0558 02112000
ENDALL   DS    0H                                                  0559 02113000
*   TEMP2=R15;                      /* SAVE RETURN CODE AROUND MACROS   02114000
*                                                            @VA11343*/ 02115000
         ST    R15,TEMP2                                           0559 02116000
*   R0=512;                         /* SIZE OF QUERY RESPONSE BUFFER    02117000
*                                                            @VA11343*/ 02118000
         LA    R0,512                                              0560 02119000
*   R1=FIRSTPTR;                    /* RELEASE CONFIG TABLE BUFFER 0561 02120000
*                                                            @VA11343*/ 02121000
         L     R1,FIRSTPTR                                         0561 02122000
*   GEN(FREEMAIN R,LV=(0),A=(1));   /*                       @VA11343*/ 02123000
         FREEMAIN R,LV=(0),A=(1)                                        02124000
*   R0=512;                         /* SIZE OF QUERY RESPONSE BUFFER    02125000
*                                                            @VA11343*/ 02126000
         LA    R0,512                                              0563 02127000
*   R1=SECNDPTR;                    /* RELEASE CONFIG DATA BLOK    0564 02128000
*                                      BUFFER                @VA11343*/ 02129000
         L     R1,SECNDPTR                                         0564 02130000
*   GEN(FREEMAIN R,LV=(0),A=(1));   /*                       @VA11343*/ 02131000
         FREEMAIN R,LV=(0),A=(1)                                        02132000
*   R15=TEMP2;                      /* RESTORE RETURN CODE AFTER   0566 02133000
*                                      MACROS                @VA11343*/ 02134000
         L     R15,TEMP2                                           0566 02135000
*/* **************************************************************** */ 02136000
*/* IF THE RETURN CODE WE'RE PASSING BACK AT THIS POINT IS NOT ZEROS */ 02137000
*/* WE WANT TO RELEASE THE TABLE WE'VE BUILT, NOT SEND IT TO CP, AND */ 02138000
*/* TELL THE CALLING PROC TO TERMINATE THE CENTRAL SERVER.           */ 02139000
*/* **************************************************************** */ 02140000
*                                                                  0567 02141000
*   IF R15=0 THEN                                                  0567 02142000
         LTR   R15,R15                                             0567 02143000
         BNZ   @RF00567                                            0567 02144000
*     DO;                           /* IS IT OKAY TO ISSUE DIAG    0568 02145000
*                                      SUBCODE 20?           @VA11343*/ 02146000
*       RFY                                                        0569 02147000
*        (R5,                                                      0569 02148000
*         R6) RSTD;                 /*                       @VA11343*/ 02149000
*       R5=20;                      /* SUBCODE 20 TO TELL CP TO BUILD   02150000
*                                      SDG TABLES            @VA11343*/ 02151000
         LA    R5,20                                               0570 02152000
*       R6=MSSPTR;                  /* POINT TO LIST OF VUA'S IN CP'S   02153000
*                                      CONFIG                @VA11343*/ 02154000
         L     R6,MSSPTR                                           0571 02155000
*       GEN REFS(R0,R4,R6,DIAGNOSE);                               0572 02156000
*                              /* ISSUE THE DIAGNOSE INSTR  @VA11343*/  02157000
        LRA   R4,0(R6)                                  /*  @VA11343*/  02158000
        EX    R0,DIAGNOSE                               /*  @VA11343*/  02159000
*       RFY                                                        0573 02160000
*        (R5,                                                      0573 02161000
*         R6) UNRSTD;               /*                       @VA11343*/ 02162000
*       IF R15=0 THEN                                              0574 02163000
         LTR   R15,R15                                             0574 02164000
         BZ    @RT00574                                            0574 02165000
*         ;                         /* DID CP BUILD SDG TABLES     0575 02166000
*                                      CORRECTLY?            @VA11343*/ 02167000
*       ELSE                                                       0576 02168000
*         TEMP2=12;                 /* SAVE NEW RETURN CODE IF NOT 0576 02169000
*                                                            @VA11343*/ 02170000
         MVC   TEMP2(4),@CF02226                                   0576 02171000
*     END;                          /*                       @VA11343*/ 02172000
@RT00574 DS    0H                                                  0578 02173000
*   R2=7172;                        /* SIZE OF BUFFER PASSED TO CP 0578 02174000
*                                                            @VA11343*/ 02175000
@RF00567 L     R2,@CF03206                                         0578 02176000
*   R1=MSSPTR;                      /* POINT AT VUA TABLE BUFFER   0579 02177000
*                                                            @VA11343*/ 02178000
         L     R1,MSSPTR                                           0579 02179000
*   GEN(FREEMAIN R,LV=(2),A=(1),SP=253);/*                   @VA11343*/ 02180000
         FREEMAIN R,LV=(2),A=(1),SP=253                                 02181000
*   R15=TEMP2;                      /* RESTORE CORRECT RETURN CODE 0581 02182000
*                                                            @VA11343*/ 02183000
         L     R15,TEMP2                                           0581 02184000
*   RETURN CODE(R15);               /* RETURN TO CALLING PROC      0582 02185000
*                                                            @VA11343*/ 02186000
         L     @14,@SA00007                                        0582 02187000
         LM    @00,@12,@SA00007+8                                  0582 02188000
         BR    @14                                                 0582 02189000
*   RFY                                                            0583 02190000
*    (R0,                                                          0583 02191000
*     R1,                                                          0583 02192000
*     R2,                                                          0583 02193000
*     R15) UNRSTD;                  /*                       @VA11343*/ 02194000
*   END QRYMSC;                     /*                       @VA11343*/ 02195000
*   END DMKMSS                      /*                       @VA11343*/ 02196000
*                                                                  0585 02197000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02198000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 02199000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 02200000
*/*%INCLUDE SYSLIB  (IEZDEB  )                                       */ 02201000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 02202000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02203000
*/*%INCLUDE SYSLIB  (IEZSSC  )                                       */ 02204000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 02205000
*/*%INCLUDE SYSLIB  (IHAPCCA )                                       */ 02206000
*/*%INCLUDE SYSLIB  (IHAPCCAT)                                       */ 02207000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 02208000
*/*%INCLUDE SYSLIB  (MSSCOM  )                                       */ 02209000
*                                                                  0585 02210000
*       ;                                                          0585 02211000
@DATA    DS    0H                                                       02212000
@CH03037 DC    XL2'0193'                                                02213000
         DS    0F                                                       02214000
@AL00206 EQU   *                       LIST WITH   1 ARGUMENT(S)        02215000
@AL00347 DC    A(@CF00060)             LIST WITH   1 ARGUMENT(S)        02216000
@AL00212 DC    A(@CF00109)             LIST WITH   1 ARGUMENT(S)        02217000
@AL00236 EQU   *                       LIST WITH   1 ARGUMENT(S)        02218000
@AL00352 DC    A(@CF00072)             LIST WITH   1 ARGUMENT(S)        02219000
@AL00357 DC    A(@CF02226)             LIST WITH   1 ARGUMENT(S)        02220000
@DATD    DSECT                                                          02221000
         DS    0F                                                       02222000
@SA00001 DS    18F                                                      02223000
@SA00004 DS    15F                                                      02224000
@SA00007 DS    15F                                                      02225000
@SA00003 DS    15F                                                      02226000
@PC00003 DS    1F                                                       02227000
@SA00005 DS    15F                                                      02228000
@SA00002 DS    15F                                                      02229000
@TF00001 DS    F                                                        02230000
@TF00002 DS    F                                                        02231000
@TF00003 DS    F                                                        02232000
@TF00004 DS    F                                                        02233000
DMKMSS   CSECT                                                          02234000
         DS    0F                                                       02235000
@CF00074 DC    F'1'                                                     02236000
@CF00109 DC    F'4'                                                     02237000
@CH00109 EQU   @CF00109+2                                               02238000
@CF00072 DC    F'8'                                                     02239000
@CF02226 DC    F'12'                                                    02240000
@CF00060 DC    F'16'                                                    02241000
@CF01168 DC    F'32'                                                    02242000
@CF01914 DC    F'64'                                                    02243000
@CF03206 DC    F'7172'                                                  02244000
@CF03221 DC    F'-4'                                                    02245000
@CF03224 DC    XL4'0000FFFF'                                            02246000
@DATD    DSECT                                                          02247000
         DS    0D                                                       02248000
DEBDAPTR DS    A                                                        02249000
DEBEXPTR DS    A                                                        02250000
DEBSBPTR DS    A                                                        02251000
TCBPTR   DS    A                                                        02252000
PCCAPTR  DS    A                                                        02253000
PCCATBL  DS    A                                                        02254000
MVTPTR   DS    A                                                        02255000
TEMP3    DS    F                                                        02256000
TEMP     DS    F                                                        02257000
VOLMNTD  DS    F                                                        02258000
FIRSTPTR DS    A                                                        02259000
SECNDPTR DS    A                                                        02260000
MSSPTR   DS    A                                                        02261000
TEMP2    DS    F                                                        02262000
MVINDX   DS    F                                                        02263000
RELINDEX DS    H                                                        02264000
I        DS    FL1                                                      02265000
LNDEX    DS    FL1                                                      02266000
JNDEX    DS    FL1                                                      02267000
KNDEX    DS    FL1                                                      02268000
@TS00001 DS    CL2                                                      02269000
         DS    CL4                                                      02270000
WRKAREA  DS    CL192                                                    02271000
         ORG   WRKAREA                                                  02272000
COMMDCB  DS    CL92                                                     02273000
BUFFER   DS    CL40                                                     02274000
RCODE    DS    FL2                                                      02275000
         DS    CL3                                                      02276000
ADECB    DS    AL3                                                      02277000
INITFLAG DS    BL1                                                      02278000
         ORG   INITFLAG                                                 02279000
MSSINIT  DS    BL1                                                      02280000
VIRTFLAG EQU   INITFLAG+0                                               02281000
INITCTR  EQU   INITFLAG+0                                               02282000
@NM00001 EQU   INITFLAG+0                                               02283000
         ORG   WRKAREA+144                                              02284000
RETCODE  DS    FL4                                                      02285000
OPENLIST DS    FL4                                                      02286000
MSSECB   DS    FL4                                                      02287000
INDEX    DS    FL4                                                      02288000
WTLIST   DS    CL8                                                      02289000
         ORG   WTLIST                                                   02290000
ADMSSECB DS    AL4                                                      02291000
ENDLIST  DS    CL1                                                      02292000
WTORECBA DS    AL3                                                      02293000
         ORG   WRKAREA+168                                              02294000
SAVE1    DS    FL4                                                      02295000
SAVE2    DS    FL4                                                      02296000
SAVE3    DS    FL4                                                      02297000
         DS    CL4                                                      02298000
VIRT     DS    CL8                                                      02299000
         ORG   VIRT                                                     02300000
@NM00002 DS    CL1                                                      02301000
CPUID    DS    CL5                                                      02302000
@NM00003 DS    CL2                                                      02303000
         ORG   WRKAREA+192                                              02304000
MDSKEXTS DS    CL64                                                     02305000
         ORG   MDSKEXTS                                                 02306000
BEGCC    DS    FL2                                                      02307000
ENDCC    DS    FL2                                                      02308000
@NM00088 DS    CL60                                                     02309000
         ORG   MDSKEXTS+64                                              02310000
QRYPARM  DS    CL20                                                     02311000
         ORG   QRYPARM                                                  02312000
QRYID    DS    CL1                                                      02313000
QRYRD    DS    CL1                                                      02314000
QRYSEC   DS    CL2                                                      02315000
QRYVOL   DS    CL6                                                      02316000
QRYFILL  DS    CL10                                                     02317000
         ORG   QRYPARM+20                                               02318000
RSNCODE  DS    CL4                                                      02319000
TEMP4    DS    CL4                                                      02320000
QUERLIST DS    CL44                                                     02321000
         ORG   QUERLIST                                                 02322000
QULEN    DS    FL4                                                      02323000
QUORD    DS    CL1                                                      02324000
QURES    DS    CL1                                                      02325000
QUCODE   DS    BL1                                                      02326000
         ORG   QUCODE                                                   02327000
QULIB    DS    BL1                                                      02328000
         ORG   QUERLIST+7                                               02329000
QUSECT   DS    BL1                                                      02330000
         ORG   QUSECT                                                   02331000
QUXADDR  DS    BL1                                                      02332000
         ORG   QUXADDR                                                  02333000
QUFLAG   DS    BL1                                                      02334000
         ORG   QUFLAG                                                   02335000
QURES1   DS    CL1                                                      02336000
         ORG   QUERLIST+8                                               02337000
QUPARM   DS    CL32                                                     02338000
QUPTR    DS    FL4                                                      02339000
         ORG   QUERLIST+44                                              02340000
CHRMAP   DS    CL4                                                      02341000
         ORG   CHRMAP                                                   02342000
CYL      DS    CL2                                                      02343000
HD       DS    CL1                                                      02344000
REC      DS    CL1                                                      02345000
         ORG   CHRMAP+4                                                 02346000
TEMP1    DS    BL1                                                      02347000
DMKMSS   CSECT                                                          02348000
         DS    0F                                                       02349000
@SIZDATD DC    AL1(0)                                                   02350000
         DC    AL3(@ENDDATD-@DATD)                                      02351000
         DS    0D                                                       02352000
DIAGNOSE DC    XL4'83450078'                                            02353000
HEX80    DC    XL4'80000000'                                            02354000
MASK     DC    XL4'80000000'                                            02355000
SPTIME   DC    A(10)                                                    02356000
MTFLAG   DC    XL2'0100'                                                02357000
DMFLAG   DC    XL2'2000'                                                02358000
MASK2    DC    XL1'3F'                                                  02359000
VIRTTEST DC    XL1'FF'                                                  02360000
LISTEND  DC    XL1'80'                                                  02361000
RLQSH    DC    XL1'44'                                                  02362000
NMBREXTS DC    XL1'01'                                                  02363000
@CB02882 DC    X'0000'                                                  02364000
@CB02973 DC    X'C6C6'                                                  02365000
@CB03209 DC    X'001A'                                                  02366000
         DS    CL1                                                      02367000
WTORECB  DS    CL4                                                      02368000
         ORG   WTORECB                                                  02369000
WTPOST   DS    BL1                                                      02370000
         ORG   WTPOST                                                   02371000
WAITFLG  DS    BL1                                                      02372000
POSTFLAG EQU   WTPOST+0                                                 02373000
@NM00004 EQU   WTPOST+0                                                 02374000
         ORG   WTORECB+1                                                02375000
RBADDR   DS    AL3                                                      02376000
         ORG   WTORECB+4                                                02377000
WTOREPLY DS    CL1                                                      02378000
         DS    CL3                                                      02379000
MONBLK   DS    CL28                                                     02380000
         ORG   MONBLK                                                   02381000
MDLEN    DC    XL4'1C'                                                  02382000
MDOPCD   DC    XL1'08'                                                  02383000
MNTRES1  DC    X'00'                                                    02384000
MDFLG    DC    B'0000000000000000'                                      02385000
         ORG   MDFLG                                                    02386000
@NM00080 DS    BL1                                                      02387000
MDVISMNT EQU   MDFLG+0                                                  02388000
MDVSVRQ  EQU   MDFLG+0                                                  02389000
MDSRTCH  EQU   MDFLG+0                                                  02390000
MDMEXT   EQU   MDFLG+0                                                  02391000
@NM00081 EQU   MDFLG+0                                                  02392000
         ORG   MONBLK+8                                                 02393000
MDVOL    DS    CL6                                                      02394000
         ORG   MDVOL                                                    02395000
@NM00082 DC    6X'00'                                                   02396000
         ORG   MONBLK+14                                                02397000
MDVUA    DC    H'0'                                                     02398000
MDHOST   DS    CL5                                                      02399000
         ORG   MDHOST                                                   02400000
@NM00083 DC    5X'00'                                                   02401000
         ORG   MONBLK+21                                                02402000
MNTRES2  DC    XL3'0'                                                   02403000
MNTEXTP  DC    A(0)                                                     02404000
         ORG   MNTEXTP                                                  02405000
MDJFCB   DS    AL4                                                      02406000
         ORG   MONBLK+28                                                02407000
DMOBLK   DS    CL28                                                     02408000
         ORG   DMOBLK                                                   02409000
DMLEN    DC    XL4'1C'                                                  02410000
DMOPCD   DC    XL1'06'                                                  02411000
DMNTRES1 DC    X'00'                                                    02412000
DMNTFLAG DC    B'0000000000000000'                                      02413000
         ORG   DMNTFLAG                                                 02414000
DMBITRE1 DS    BL1                                                      02415000
DMDELRSP EQU   DMNTFLAG+0                                               02416000
DMVUAVAL EQU   DMNTFLAG+0                                               02417000
DMBITRES EQU   DMNTFLAG+0                                               02418000
         ORG   DMOBLK+8                                                 02419000
DMVOL    DC    XL6'0'                                                   02420000
DMNTASID DC    XL2'0'                                                   02421000
DMNTECB  DC    A(0)                                                     02422000
DMHOST   DC    XL5'0'                                                   02423000
DMNTRES2 DC    XL1'0'                                                   02424000
DMNTVUA  DC    H'0'                                                     02425000
         ORG   DMOBLK+28                                                02426000
RLQBLK   DS    CL96                                                     02427000
         ORG   RLQBLK                                                   02428000
ARLL     DC    F'96'                                                    02429000
AROP     DC    AL1(4)                                                   02430000
@NM00084 DC    X'00'                                                    02431000
ARFLG    DC    B'00000000'                                              02432000
         ORG   ARFLG                                                    02433000
ARBDUBD  DS    BL1                                                      02434000
ARDRES   EQU   ARFLG+0                                                  02435000
ARINH    EQU   ARFLG+0                                                  02436000
ARSEC    EQU   ARFLG+0                                                  02437000
ARWANR   EQU   ARFLG+0                                                  02438000
ARVMSW   EQU   ARFLG+0                                                  02439000
@NM00085 EQU   ARFLG+0                                                  02440000
         ORG   RLQBLK+7                                                 02441000
ARNMEXT  DC    AL1(0)                                                   02442000
ARVOL    DC    X'000000000000'                                          02443000
ARASID   DC    X'0000'                                                  02444000
ARECB    DC    A(0)                                                     02445000
ARHOST   DC    X'0000000000'                                            02446000
@NM00086 DC    X'00'                                                    02447000
ARCOMPC  DC    X'0000'                                                  02448000
AREXT    DS    CL4                                                      02449000
         ORG   AREXT+0                                                  02450000
@NM00087 DC    X'00000000'                                              02451000
         ORG   RLQBLK+92                                                02452000
ARNEDB   DC    A(0)                                                     02453000
         ORG   RLQBLK+96                                                02454000
WAITTIME DC    CL8'00100000'                                            02455000
BLNK     DC    X'40'                                                    02456000
PATCH    DC    CL60'PATCH AREA DMKMSS'                                  02457000
MVENT    DC    X'00'                                                    02458000
         DS    CL2                                                      02459000
I03506   DS    CL52                                                     02460000
         ORG   I03506                                                   02461000
I0350601 DC    H'48'                                                    02462000
I0350602 DC    B'1000000000000000'                                      02463000
I0350603 DC    CL44'DMKMSS ERROR READING MSS CONFIGURATION TABLE'       02464000
I0350604 DC    B'0001000000000000'                                      02465000
I0350605 DC    B'0100000000000000'                                      02466000
         ORG   I03506+52                                                02467000
I03508   DS    CL58                                                     02468000
         ORG   I03508                                                   02469000
I0350801 DC    H'54'                                                    02470000
I0350802 DC    B'1000000000000000'                                      02471000
I0350803 DC    CL50'DMKMSS CPUID NOT FOUND IN MSS CONFIGURATION TABLES' 02472000
I0350804 DC    B'0001000000000000'                                      02473000
I0350805 DC    B'0100000000000000'                                      02474000
         ORG   I03508+58                                                02475000
         DS    CL2                                                      02476000
I03510   DS    CL53                                                     02477000
         ORG   I03510                                                   02478000
I0351001 DC    H'49'                                                    02479000
I0351002 DC    B'1000000000000000'                                      02480000
I0351003 DC    CL45'DMKMSS ERROR CREATING MSS CONFIGURATION TABLE'      02481000
I0351004 DC    B'0001000000000000'                                      02482000
I0351005 DC    B'0100000000000000'                                      02483000
         ORG   I03510+53                                                02484000
         DS    CL3                                                      02485000
I03514   DS    CL42                                                     02486000
         ORG   I03514                                                   02487000
I0351401 DC    H'38'                                                    02488000
I0351402 DC    B'1000000000000000'                                      02489000
I0351403 DC    CL34'INVALID REQUEST CODE IN VM REQUEST'                 02490000
I0351404 DC    B'0001000000000000'                                      02491000
I0351405 DC    B'0100000000000000'                                      02492000
         ORG   I03514+42                                                02493000
         DS    CL2                                                      02494000
I03516   DS    CL48                                                     02495000
         ORG   I03516                                                   02496000
I0351601 DC    H'44'                                                    02497000
I0351602 DC    B'1000000000000000'                                      02498000
I0351603 DC    CL40'DMKMSS ENDING ERROR- MSS NOT INITIALIZED'           02499000
I0351604 DC    B'0001000000000000'                                      02500000
I0351605 DC    B'0100000000000000'                                      02501000
         ORG   I03516+48                                                02502000
I03518   DS    CL60                                                     02503000
         ORG   I03518                                                   02504000
I0351801 DC    H'56'                                                    02505000
I0351802 DC    B'1000000000000000'                                      02506000
I0351803 DC    CL52'DMKMSS ENDING ERROR- DCB FOR COMM. DEVICE NOT OPENEC02507000
               D'                                                       02508000
I0351804 DC    B'0001000000000000'                                      02509000
I0351805 DC    B'0100000000000000'                                      02510000
         ORG   I03518+60                                                02511000
I03520   DS    CL62                                                     02512000
         ORG   I03520                                                   02513000
I0352001 DC    H'58'                                                    02514000
I0352002 DC    B'1000000000000000'                                      02515000
I0352003 DC    CL54'DMKMSS ENDING ERROR-DMKMSS MUST RUN IN A VIRTUAL MAC02516000
               CH.'                                                     02517000
I0352004 DC    B'0001000000000000'                                      02518000
I0352005 DC    B'0100000000000000'                                      02519000
         ORG   I03520+62                                                02520000
DMKMSS   CSECT                                                          02521000
ACTDCB DCB DSORG=PS,DDNAME=COMM,LRECL=80,RECFM=F,MACRF=PL               02522000
@DATD    DSECT                                                          02523000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02524000
@ENDDATD EQU   *                                                        02525000
DMKMSS   CSECT                                                          02526000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02527000
@01      EQU   01                                                       02528000
@02      EQU   02                                                       02529000
@03      EQU   03                                                       02530000
@04      EQU   04                                                       02531000
@05      EQU   05                                                       02532000
@06      EQU   06                                                       02533000
@07      EQU   07                                                       02534000
@08      EQU   08                                                       02535000
@09      EQU   09                                                       02536000
@10      EQU   10                                                       02537000
@11      EQU   11                                                       02538000
@12      EQU   12                                                       02539000
@13      EQU   13                                                       02540000
@14      EQU   14                                                       02541000
@15      EQU   15                                                       02542000
R0       EQU   @00                                                      02543000
R1       EQU   @01                                                      02544000
R2       EQU   @02                                                      02545000
R3       EQU   @03                                                      02546000
R4       EQU   @04                                                      02547000
R5       EQU   @05                                                      02548000
R6       EQU   @06                                                      02549000
R7       EQU   @07                                                      02550000
R8       EQU   @08                                                      02551000
R9       EQU   @09                                                      02552000
R10      EQU   @10                                                      02553000
R12      EQU   @12                                                      02554000
R13      EQU   @13                                                      02555000
R14      EQU   @14                                                      02556000
R15      EQU   @15                                                      02557000
GPR00P   EQU   @00                                                      02558000
GPR01P   EQU   @01                                                      02559000
DCBPTR   EQU   @02                                                      02560000
DEBPTR   EQU   @03                                                      02561000
UCBPTR   EQU   @07                                                      02562000
ICBPTR   EQU   @08                                                      02563000
COMMPTR  EQU   @09                                                      02564000
MDREG1   EQU   @01                                                      02565000
ARR1     EQU   @01                                                      02566000
QUERR1   EQU   @01                                                      02567000
R11      EQU   @11                                                      02568000
CVTPTR   EQU   16                                                       02569000
PSA      EQU   0                                                        02570000
FLCRNPSW EQU   PSA                                                      02571000
FLCROPSW EQU   PSA+8                                                    02572000
FLCICCW2 EQU   PSA+16                                                   02573000
PSAEEPSW EQU   PSA+132                                                  02574000
PSAESPSW EQU   PSA+136                                                  02575000
FLCSVILC EQU   PSAESPSW+1                                               02576000
PSAEPPSW EQU   PSA+140                                                  02577000
FLCPIILC EQU   PSAEPPSW+1                                               02578000
FLCPICOD EQU   PSAEPPSW+2                                               02579000
PSAPICOD EQU   FLCPICOD+1                                               02580000
FLCTEA   EQU   PSAEPPSW+4                                               02581000
FLCPER   EQU   PSA+152                                                  02582000
FLCMCLA  EQU   PSA+168                                                  02583000
FLCCHNID EQU   FLCMCLA                                                  02584000
FLCCHTM  EQU   FLCCHNID                                                 02585000
FLCIOEL  EQU   FLCMCLA+4                                                02586000
FLCIOA   EQU   FLCMCLA+16                                               02587000
PSAMEDC  EQU   FLCMCLA+76                                               02588000
FLCFSA   EQU   FLCMCLA+80                                               02589000
PSATOLD  EQU   PSA+540                                                  02590000
PSAAOLD  EQU   PSA+548                                                  02591000
PSASUPER EQU   PSA+552                                                  02592000
PSASUP1  EQU   PSASUPER                                                 02593000
PSASUP2  EQU   PSASUPER+1                                               02594000
PSASUP3  EQU   PSASUPER+2                                               02595000
PSASUP4  EQU   PSASUPER+3                                               02596000
PSACLHT  EQU   PSA+640                                                  02597000
PSALKSA  EQU   PSA+696                                                  02598000
PSAHLHI  EQU   PSA+760                                                  02599000
PSADSSFL EQU   PSA+836                                                  02600000
PSADSSF1 EQU   PSADSSFL                                                 02601000
PSADSSF3 EQU   PSADSSFL+2                                               02602000
PSADSSF4 EQU   PSADSSFL+3                                               02603000
PSARSVT  EQU   PSA+896                                                  02604000
IHADCB   EQU   0                                                        02605000
IHADCS00 EQU   0                                                        02606000
DCBFDAD  EQU   IHADCS00+5                                               02607000
IHADCS01 EQU   0                                                        02608000
DCBDVTBL EQU   IHADCS01                                                 02609000
IHADCS11 EQU   0                                                        02610000
DCBRELB  EQU   IHADCS11                                                 02611000
DCBREL   EQU   DCBRELB+1                                                02612000
DCBBUFCB EQU   IHADCS11+4                                               02613000
DCBDSORG EQU   IHADCS11+10                                              02614000
DCBDSRG1 EQU   DCBDSORG                                                 02615000
DCBDSRG2 EQU   DCBDSORG+1                                               02616000
DCBIOBAD EQU   IHADCS11+12                                              02617000
DCBODEB  EQU   DCBIOBAD                                                 02618000
DCBLNP   EQU   DCBODEB                                                  02619000
DCBQSLM  EQU   DCBLNP                                                   02620000
DCBIOBAA EQU   DCBODEB+1                                                02621000
IHADCS50 EQU   0                                                        02622000
DCBSVCXL EQU   IHADCS50                                                 02623000
DCBEODAD EQU   IHADCS50+4                                               02624000
DCBBFALN EQU   DCBEODAD                                                 02625000
DCBHIARC EQU   DCBBFALN                                                 02626000
DCBBFTEK EQU   DCBHIARC                                                 02627000
DCBBFT   EQU   DCBBFTEK                                                 02628000
DCBEXLST EQU   IHADCS50+8                                               02629000
DCBRECFM EQU   DCBEXLST                                                 02630000
DCBRECLA EQU   DCBRECFM                                                 02631000
IHADCS24 EQU   0                                                        02632000
DCBOFLGS EQU   IHADCS24+8                                               02633000
DCBOFLWR EQU   DCBOFLGS                                                 02634000
DCBOFOPN EQU   DCBOFLGS                                                 02635000
DCBIFLG  EQU   IHADCS24+9                                               02636000
DCBIBPCT EQU   DCBIFLG                                                  02637000
DCBMACR  EQU   IHADCS24+10                                              02638000
DCBMACR1 EQU   DCBMACR                                                  02639000
DCBMRFE  EQU   DCBMACR1                                                 02640000
DCBMRGET EQU   DCBMRFE                                                  02641000
DCBMRAPG EQU   DCBMACR1                                                 02642000
DCBMRRD  EQU   DCBMRAPG                                                 02643000
DCBMRCI  EQU   DCBMACR1                                                 02644000
DCBMRMVG EQU   DCBMRCI                                                  02645000
DCBMRLCG EQU   DCBMACR1                                                 02646000
DCBMRABC EQU   DCBMACR1                                                 02647000
DCBMRPT1 EQU   DCBMRABC                                                 02648000
DCBMRSBG EQU   DCBMRPT1                                                 02649000
DCBMRCRL EQU   DCBMACR1                                                 02650000
DCBMRCHK EQU   DCBMRCRL                                                 02651000
DCBMRRDX EQU   DCBMRCHK                                                 02652000
DCBMRDMG EQU   DCBMACR1                                                 02653000
DCBMACR2 EQU   DCBMACR+1                                                02654000
DCBMRPUT EQU   DCBMACR2                                                 02655000
DCBMRWRT EQU   DCBMACR2                                                 02656000
DCBMRMVP EQU   DCBMACR2                                                 02657000
DCBMR5WD EQU   DCBMACR2                                                 02658000
DCBMRLDM EQU   DCBMR5WD                                                 02659000
DCBMRLCP EQU   DCBMRLDM                                                 02660000
DCBMR4WD EQU   DCBMACR2                                                 02661000
DCBMRPT2 EQU   DCBMR4WD                                                 02662000
DCBMRTMD EQU   DCBMRPT2                                                 02663000
DCBMR3WD EQU   DCBMACR2                                                 02664000
DCBMRCTL EQU   DCBMR3WD                                                 02665000
DCBMRSTK EQU   DCBMRCTL                                                 02666000
DCBMR1WD EQU   DCBMACR2                                                 02667000
DCBMRSWA EQU   DCBMR1WD                                                 02668000
DCBMRDMD EQU   DCBMRSWA                                                 02669000
IHADCS25 EQU   0                                                        02670000
DCBMACRF EQU   IHADCS25+2                                               02671000
DCBMACF1 EQU   DCBMACRF                                                 02672000
DCBMFFE  EQU   DCBMACF1                                                 02673000
DCBMFGET EQU   DCBMFFE                                                  02674000
DCBMFAPG EQU   DCBMACF1                                                 02675000
DCBMFRD  EQU   DCBMFAPG                                                 02676000
DCBMFCI  EQU   DCBMACF1                                                 02677000
DCBMFMVG EQU   DCBMFCI                                                  02678000
DCBMFLCG EQU   DCBMACF1                                                 02679000
DCBMFABC EQU   DCBMACF1                                                 02680000
DCBMFPT1 EQU   DCBMFABC                                                 02681000
DCBMFSBG EQU   DCBMFPT1                                                 02682000
DCBMFCRL EQU   DCBMACF1                                                 02683000
DCBMFCHK EQU   DCBMFCRL                                                 02684000
DCBMFDMG EQU   DCBMACF1                                                 02685000
DCBMACF2 EQU   DCBMACRF+1                                               02686000
DCBMFPUT EQU   DCBMACF2                                                 02687000
DCBMFWRT EQU   DCBMACF2                                                 02688000
DCBMFMVP EQU   DCBMACF2                                                 02689000
DCBMF5WD EQU   DCBMACF2                                                 02690000
DCBMFLDM EQU   DCBMF5WD                                                 02691000
DCBMFLCP EQU   DCBMFLDM                                                 02692000
DCBMF4WD EQU   DCBMACF2                                                 02693000
DCBMFPT2 EQU   DCBMF4WD                                                 02694000
DCBMFTMD EQU   DCBMFPT2                                                 02695000
DCBMF3WD EQU   DCBMACF2                                                 02696000
DCBMFCTL EQU   DCBMF3WD                                                 02697000
DCBMFSTK EQU   DCBMFCTL                                                 02698000
DCBMF1WD EQU   DCBMACF2                                                 02699000
DCBMFSWA EQU   DCBMF1WD                                                 02700000
DCBMFDMD EQU   DCBMFSWA                                                 02701000
DCBDEBAD EQU   IHADCS25+4                                               02702000
DCBIFLGS EQU   DCBDEBAD                                                 02703000
DCBIFPCT EQU   DCBIFLGS                                                 02704000
IHADCS26 EQU   0                                                        02705000
DCBWRITE EQU   IHADCS26                                                 02706000
DCBREAD  EQU   DCBWRITE                                                 02707000
DCBWRITA EQU   DCBREAD+1                                                02708000
IHADCS27 EQU   0                                                        02709000
DCBGET   EQU   IHADCS27                                                 02710000
DCBPUT   EQU   DCBGET                                                   02711000
DCBGETA  EQU   DCBPUT+1                                                 02712000
IHADCS36 EQU   0                                                        02713000
DCBGERR  EQU   IHADCS36                                                 02714000
DCBPERR  EQU   DCBGERR                                                  02715000
DCBCHECK EQU   DCBPERR                                                  02716000
DCBOPTCD EQU   DCBCHECK                                                 02717000
DCBOPTH  EQU   DCBOPTCD                                                 02718000
DCBOPTO  EQU   DCBOPTH                                                  02719000
DCBOPTZ  EQU   DCBOPTCD                                                 02720000
DCBGERRA EQU   DCBCHECK+1                                               02721000
DCBPERRA EQU   DCBGERRA                                                 02722000
DCBSYNAD EQU   IHADCS36+4                                               02723000
DCBCIND1 EQU   IHADCS36+8                                               02724000
DCBCIND2 EQU   IHADCS36+9                                               02725000
DCBIOBA  EQU   IHADCS36+16                                              02726000
DCBCICB  EQU   DCBIOBA                                                  02727000
IHADCS52 EQU   0                                                        02728000
DCBDIRCT EQU   IHADCS52                                                 02729000
DCBQSWS  EQU   DCBDIRCT                                                 02730000
DCBUSASI EQU   DCBQSWS                                                  02731000
DCBQADFS EQU   DCBUSASI                                                 02732000
DCBBUFOF EQU   DCBDIRCT+1                                               02733000
IHADCS37 EQU   0                                                        02734000
DCBFLAG1 EQU   IHADCS37                                                 02735000
IHADCS38 EQU   0                                                        02736000
DCBEOBR  EQU   IHADCS38                                                 02737000
DCBPOINT EQU   IHADCS38+12                                              02738000
DCBCNTRL EQU   DCBPOINT                                                 02739000
IHADCS40 EQU   0                                                        02740000
DCBEOBAD EQU   IHADCS40                                                 02741000
DCBCCCW  EQU   IHADCS40+4                                               02742000
DCBRECAD EQU   DCBCCCW                                                  02743000
DCBRECBT EQU   DCBRECAD                                                 02744000
DCBRCREL EQU   DCBRECBT                                                 02745000
@NM00030 EQU   IHADCS40+12                                              02746000
DCBEROPT EQU   @NM00030                                                 02747000
DEBBASIC EQU   0                                                        02748000
DEBTCBAD EQU   DEBBASIC                                                 02749000
DEBDEBAD EQU   DEBBASIC+4                                               02750000
DEBIRBAD EQU   DEBBASIC+8                                               02751000
DEBOFLGS EQU   DEBIRBAD                                                 02752000
DEBOPATB EQU   DEBBASIC+12                                              02753000
DEBFLGS1 EQU   DEBBASIC+14                                              02754000
DEBUSRPG EQU   DEBBASIC+16                                              02755000
DEBRRQ   EQU   DEBBASIC+20                                              02756000
DEBECBAD EQU   DEBRRQ                                                   02757000
DEBDCBAD EQU   DEBBASIC+24                                              02758000
DEBPROTG EQU   DEBDCBAD                                                 02759000
DEBAPPAD EQU   DEBBASIC+28                                              02760000
DEBBASND EQU   DEBBASIC+32                                              02761000
DEBDASD  EQU   0                                                        02762000
DEBUCBAD EQU   DEBDASD                                                  02763000
DEBACSMD EQU   0                                                        02764000
DEBVOLSQ EQU   DEBACSMD                                                 02765000
DEBVOLBT EQU   DEBVOLSQ                                                 02766000
DEBDSNM  EQU   DEBACSMD+4                                               02767000
DEBUTSAA EQU   DEBDSNM                                                  02768000
DEBACS01 EQU   0                                                        02769000
DEBDSNAM EQU   DEBACS01                                                 02770000
DEBACS02 EQU   0                                                        02771000
DEBDBLK  EQU   DEBACS02                                                 02772000
DEBACS03 EQU   0                                                        02773000
DEBACS04 EQU   0                                                        02774000
DEBTBFRA EQU   DEBACS04                                                 02775000
DEBTCCWA EQU   DEBACS04+4                                               02776000
DEBACS05 EQU   0                                                        02777000
DEBFUCBA EQU   DEBACS05                                                 02778000
DEBLUCBA EQU   DEBACS05+4                                               02779000
DEBACS06 EQU   0                                                        02780000
DEBACS07 EQU   0                                                        02781000
DEBACS08 EQU   0                                                        02782000
DEBSUBNM EQU   0                                                        02783000
DEB      EQU   0                                                        02784000
DEBAVT   EQU   DEB                                                      02785000
DEBEOEA  EQU   DEBAVT                                                   02786000
DEBEOEAB EQU   DEBEOEA                                                  02787000
DEBSIOA  EQU   DEBAVT+4                                                 02788000
DEBSIOAB EQU   DEBSIOA                                                  02789000
DEBPCIA  EQU   DEBAVT+8                                                 02790000
DEBPCIAB EQU   DEBPCIA                                                  02791000
DEBCEA   EQU   DEBAVT+12                                                02792000
DEBCEAB  EQU   DEBCEA                                                   02793000
DEBXCEA  EQU   DEBAVT+16                                                02794000
DEBXCEAB EQU   DEBXCEA                                                  02795000
DEBPREFX EQU   DEB+20                                                   02796000
DEBXTNP  EQU   DEBPREFX+8                                               02797000
DEBXTN   EQU   0                                                        02798000
DEBXFLG1 EQU   DEBXTN+2                                                 02799000
UCB      EQU   0                                                        02800000
UCBOB    EQU   0                                                        02801000
UCBJBNR  EQU   UCBOB                                                    02802000
UCBFL5   EQU   UCBOB+1                                                  02803000
UCBAF    EQU   UCBFL5                                                   02804000
UCBSTAT  EQU   UCBOB+3                                                  02805000
UCBCHAN  EQU   UCBOB+4                                                  02806000
UCBCHA   EQU   UCBCHAN                                                  02807000
UCBUA    EQU   UCBCHAN+1                                                02808000
UCBSFLS  EQU   UCBOB+6                                                  02809000
UCBFLA   EQU   UCBSFLS                                                  02810000
UCBFL1   EQU   UCBFLA                                                   02811000
UCBBSY   EQU   UCBFL1                                                   02812000
UCBNRY   EQU   UCBFL1                                                   02813000
UCBPST   EQU   UCBFL1                                                   02814000
UCBCUB   EQU   UCBFL1                                                   02815000
UCBFLB   EQU   UCBSFLS+1                                                02816000
UCBCHM   EQU   UCBOB+8                                                  02817000
UCBCHM1  EQU   UCBCHM                                                   02818000
UCBPTH0  EQU   UCBCHM1                                                  02819000
UCBPTH1  EQU   UCBCHM1                                                  02820000
UCBWGT   EQU   UCBOB+12                                                 02821000
UCBTYP   EQU   UCBOB+16                                                 02822000
UCBTBYT1 EQU   UCBTYP                                                   02823000
UCB1FEA5 EQU   UCBTBYT1                                                 02824000
UCB1FEA6 EQU   UCBTBYT1                                                 02825000
UCBTBYT2 EQU   UCBTYP+1                                                 02826000
UCB2OPT2 EQU   UCBTBYT2                                                 02827000
UCBDUDN1 EQU   UCB2OPT2                                                 02828000
UCB2OPT3 EQU   UCBTBYT2                                                 02829000
UCBDUDN2 EQU   UCB2OPT3                                                 02830000
UCB2OPT4 EQU   UCBTBYT2                                                 02831000
UCBRWTAU EQU   UCB2OPT4                                                 02832000
UCB2OPT6 EQU   UCBTBYT2                                                 02833000
UCB2OPT7 EQU   UCBTBYT2                                                 02834000
UCBTBYT3 EQU   UCBTYP+2                                                 02835000
UCBDVCLS EQU   UCBTBYT3                                                 02836000
UCBTBYT4 EQU   UCBTYP+3                                                 02837000
UCBEXTPT EQU   UCBOB+20                                                 02838000
UCBFLC   EQU   UCBEXTPT                                                 02839000
UCBDEV   EQU   UCBOB+24                                                 02840000
UCBCMEXT EQU   0                                                        02841000
UCBATI   EQU   UCBCMEXT+3                                               02842000
@NM00041 EQU   UCBATI                                                   02843000
UCBFLP1  EQU   UCBCMEXT+5                                               02844000
UCBMIHTI EQU   UCBCMEXT+16                                              02845000
UCBMT    EQU   0                                                        02846000
UCBOCR   EQU   0                                                        02847000
UCB3540X EQU   0                                                        02848000
UCBDKBYT EQU   UCB3540X+6                                               02849000
UCB3800X EQU   0                                                        02850000
UCBOPTNS EQU   UCB3800X                                                 02851000
UCBACTIV EQU   UCB3800X+3                                               02852000
UCBMDRBF EQU   UCB3800X+36                                              02853000
UCBUCS   EQU   0                                                        02854000
UCBUCSOP EQU   UCBUCS+4                                                 02855000
UCBFCBOP EQU   UCBUCS+5                                                 02856000
CVTMAP   EQU   0                                                        02857000
CVTDAR   EQU   CVTMAP+72                                                02858000
CVTFLGS1 EQU   CVTDAR                                                   02859000
CVTDCB   EQU   CVTMAP+116                                               02860000
CVTIOQET EQU   CVTMAP+120                                               02861000
CVTIERLC EQU   CVTMAP+144                                               02862000
CVTHEAD  EQU   CVTMAP+160                                               02863000
CVTSV76C EQU   CVTHEAD                                                  02864000
CVTOPTA  EQU   CVTMAP+182                                               02865000
CVTOPTB  EQU   CVTMAP+183                                               02866000
CVTGTF   EQU   CVTMAP+236                                               02867000
CVTGTFST EQU   CVTGTF                                                   02868000
CVTGTFS  EQU   CVTGTFST                                                 02869000
CVTSTATE EQU   CVTGTFST                                                 02870000
CVTTMODE EQU   CVTGTFST                                                 02871000
CVTFORM  EQU   CVTGTFST                                                 02872000
CVTAQAVT EQU   CVTMAP+240                                               02873000
CVTTCMFG EQU   CVTAQAVT                                                 02874000
CVTVOLM2 EQU   CVTMAP+244                                               02875000
CVTTATA  EQU   CVTVOLM2                                                 02876000
CVTTSKS  EQU   CVTTATA                                                  02877000
CVTVOLF2 EQU   CVTTSKS                                                  02878000
CVTTAT   EQU   CVTTATA+1                                                02879000
CVTATER  EQU   CVTMAP+248                                               02880000
CVTEXT1  EQU   CVTMAP+252                                               02881000
CVTPURG  EQU   CVTMAP+260                                               02882000
CVTQMSG  EQU   CVTMAP+268                                               02883000
CVTDMSR  EQU   CVTMAP+272                                               02884000
CVTRSV37 EQU   CVTDMSR                                                  02885000
CVTDMSRF EQU   CVTRSV37                                                 02886000
CVTERPV  EQU   CVTMAP+316                                               02887000
CVTINTLA EQU   CVTMAP+320                                               02888000
CVTAPF   EQU   CVTMAP+324                                               02889000
CVTEXT2  EQU   CVTMAP+328                                               02890000
CVTHJES  EQU   CVTMAP+332                                               02891000
CVTPGSIA EQU   CVTMAP+348                                               02892000
CVTA1F1  EQU   CVTMAP+356                                               02893000
CVTSYSK  EQU   CVTMAP+357                                               02894000
CVTVOLM1 EQU   CVTMAP+380                                               02895000
CVTVOLF1 EQU   CVTVOLM1                                                 02896000
CVTXTNT1 EQU   0                                                        02897000
CVTXTNT2 EQU   0                                                        02898000
CVTDSSV  EQU   CVTXTNT2                                                 02899000
CVTFLGBT EQU   CVTXTNT2+5                                               02900000
CVTQID   EQU   CVTXTNT2+24                                              02901000
CVTICB   EQU   CVTXTNT2+48                                              02902000
CVTRV400 EQU   CVTXTNT2+52                                              02903000
CVTRV409 EQU   CVTXTNT2+53                                              02904000
CVTATCVT EQU   CVTXTNT2+64                                              02905000
CVTRV429 EQU   CVTXTNT2+84                                              02906000
CVTRV438 EQU   CVTXTNT2+85                                              02907000
CVTRV457 EQU   CVTXTNT2+112                                             02908000
CVTRV466 EQU   CVTXTNT2+113                                             02909000
CVTFIX   EQU   0                                                        02910000
CVTRELNO EQU   CVTFIX+252                                               02911000
ICB2SSCB EQU   0                                                        02912000
ICBPUCB  EQU   ICB2SSCB+28                                              02913000
ICBOPT   EQU   ICB2SSCB+48                                              02914000
ICBFLG   EQU   ICB2SSCB+52                                              02915000
ICBFG1   EQU   ICBFLG                                                   02916000
ICBI     EQU   ICBFG1                                                   02917000
ICBTRACE EQU   ICB2SSCB+148                                             02918000
TCBFIX   EQU   0                                                        02919000
TCBFRS   EQU   TCBFIX                                                   02920000
TCB      EQU   0                                                        02921000
TCBPIE   EQU   TCB+4                                                    02922000
TCBPMASK EQU   TCBPIE                                                   02923000
TCBCMP   EQU   TCB+16                                                   02924000
TCBCMPF  EQU   TCBCMP                                                   02925000
TCBCPP   EQU   TCBCMPF                                                  02926000
TCBSTCC  EQU   TCBCMPF                                                  02927000
TCBCDBL  EQU   TCBCMPF                                                  02928000
TCBCWTO  EQU   TCBCMPF                                                  02929000
TCBCIND  EQU   TCBCMPF                                                  02930000
TCBCMSG  EQU   TCBCMPF                                                  02931000
TCBTRN   EQU   TCB+20                                                   02932000
TCBABF   EQU   TCBTRN                                                   02933000
TCBMSS   EQU   TCB+24                                                   02934000
TCBPKF   EQU   TCB+28                                                   02935000
TCBFLGS  EQU   TCB+29                                                   02936000
TCBFLGS1 EQU   TCBFLGS                                                  02937000
TCBFLGS2 EQU   TCBFLGS+1                                                02938000
TCBFLGS3 EQU   TCBFLGS+2                                                02939000
TCBFLGS4 EQU   TCBFLGS+3                                                02940000
TCBFLGS5 EQU   TCBFLGS+4                                                02941000
TCBABWF  EQU   TCBFLGS5                                                 02942000
TCBJPQ   EQU   TCB+44                                                   02943000
TCBPURGE EQU   TCBJPQ                                                   02944000
TCBGRS   EQU   TCB+48                                                   02945000
TCBFSA   EQU   TCB+112                                                  02946000
TCBTME   EQU   TCB+120                                                  02947000
TCBJSTCB EQU   TCB+124                                                  02948000
TCBTSFLG EQU   TCB+148                                                  02949000
TCBTSTSK EQU   TCBTSFLG                                                 02950000
TCBSTAB  EQU   TCB+160                                                  02951000
TCBNSTAE EQU   TCBSTAB                                                  02952000
TCBTCT   EQU   TCB+164                                                  02953000
TCBTCTGF EQU   TCBTCT                                                   02954000
TCBSCNDY EQU   TCB+172                                                  02955000
TCBNDSP  EQU   TCBSCNDY                                                 02956000
TCBNDSP1 EQU   TCBNDSP+1                                                02957000
TCBNDSP2 EQU   TCBNDSP+2                                                02958000
TCBNDSP3 EQU   TCBNDSP+3                                                02959000
TCBJSCB  EQU   TCB+180                                                  02960000
TCBRECDE EQU   TCBJSCB                                                  02961000
TCBEXT1  EQU   TCB+196                                                  02962000
TCBBITS  EQU   TCB+200                                                  02963000
TCBNDSP4 EQU   TCBBITS                                                  02964000
TCBNDSP5 EQU   TCBBITS+1                                                02965000
TCBFLGS6 EQU   TCBBITS+2                                                02966000
TCBFLGS7 EQU   TCBBITS+3                                                02967000
TCBDAR   EQU   TCB+204                                                  02968000
TCBDARC  EQU   TCBDAR                                                   02969000
TCBEXT2  EQU   TCB+208                                                  02970000
TCBXSCT  EQU   TCB+240                                                  02971000
TCBXSCT1 EQU   TCBXSCT                                                  02972000
TCBFOE   EQU   TCB+244                                                  02973000
TCBESTAE EQU   TCB+264                                                  02974000
TCBESTRM EQU   TCBESTAE+1                                               02975000
TCBAFFN  EQU   TCB+274                                                  02976000
TCBFBYT1 EQU   TCB+276                                                  02977000
TCBFBYT2 EQU   TCB+277                                                  02978000
TCBRV124 EQU   TCB+278                                                  02979000
TCBRV133 EQU   TCB+279                                                  02980000
TCBXTNT2 EQU   0                                                        02981000
TCBGTF   EQU   TCBXTNT2                                                 02982000
TCBTFLG  EQU   TCBGTF                                                   02983000
TCBRV146 EQU   TCBXTNT2+28                                              02984000
TCBRV155 EQU   TCBXTNT2+29                                              02985000
TCBRV164 EQU   TCBXTNT2+30                                              02986000
TCBRV173 EQU   TCBXTNT2+31                                              02987000
PCCA     EQU   0                                                        02988000
PCCACPID EQU   PCCA+4                                                   02989000
PCCACAFM EQU   PCCA+18                                                  02990000
PCCATMST EQU   PCCA+128                                                 02991000
PCCATMFL EQU   PCCATMST                                                 02992000
PCCATODE EQU   PCCATMST+1                                               02993000
PCCACCE  EQU   PCCATMST+2                                               02994000
PCCAINTE EQU   PCCATMST+3                                               02995000
PCCAEMSB EQU   PCCA+136                                                 02996000
PCCAEMSI EQU   PCCAEMSB                                                 02997000
PCCARISP EQU   PCCAEMSI                                                 02998000
PCCAEMS2 EQU   PCCAEMSI+1                                               02999000
PCCAEMS3 EQU   PCCAEMSI+2                                               03000000
PCCARMSB EQU   PCCAEMSI+3                                               03001000
PCCACHAN EQU   PCCA+224                                                 03002000
PCCAWERP EQU   PCCA+280                                                 03003000
PCCACHPF EQU   PCCAWERP+4                                               03004000
PCCACHBL EQU   PCCAWERP+5                                               03005000
PCCACHVA EQU   PCCAWERP+6                                               03006000
PCCACHTS EQU   PCCAWERP+7                                               03007000
PCCACHS1 EQU   PCCA+288                                                 03008000
PCCACHS2 EQU   PCCA+289                                                 03009000
PCCACHRB EQU   PCCA+290                                                 03010000
PCCACHF1 EQU   PCCA+308                                                 03011000
PCCACHF2 EQU   PCCA+309                                                 03012000
PCCACHF3 EQU   PCCA+310                                                 03013000
PCCACHF4 EQU   PCCA+311                                                 03014000
PCCAATTR EQU   PCCA+376                                                 03015000
PCCAVT   EQU   0                                                        03016000
PCCAT00P EQU   PCCAVT                                                   03017000
OSMSCOMM EQU   0                                                        03018000
MSSSER   EQU   OSMSCOMM                                                 03019000
MSSVUA   EQU   OSMSCOMM+6                                               03020000
MSSFLAG1 EQU   OSMSCOMM+36                                              03021000
MOUNT    EQU   MSSFLAG1                                                 03022000
DEMOUNT  EQU   MSSFLAG1                                                 03023000
RELINQSH EQU   MSSFLAG1                                                 03024000
MSSERR   EQU   MSSFLAG1                                                 03025000
MSSFLAG2 EQU   OSMSCOMM+37                                              03026000
MSSRETRY EQU   MSSFLAG2                                                 03027000
SHRDVUA  EQU   MSSFLAG2                                                 03028000
MSSRC    EQU   OSMSCOMM+38                                              03029000
MSSSDG   EQU   OSMSCOMM+40                                              03030000
MSSFLAG3 EQU   OSMSCOMM+41                                              03031000
MVTBL    EQU   0                                                        03032000
MVOLNDX  EQU   MVTBL+44                                                 03033000
MNTFLG   EQU   MVTBL+268                                                03034000
VOLMTD   EQU   MNTFLG                                                   03035000
VOLMTDXC EQU   MNTFLG                                                   03036000
SDGNDX   EQU   MVTBL+271                                                03037000
CONFIGTB EQU   0                                                        03038000
CONFIGA  EQU   CONFIGTB+256                                             03039000
BYTE1    EQU   CONFIGA                                                  03040000
BIT1     EQU   BYTE1                                                    03041000
BYTE2    EQU   CONFIGA+1                                                03042000
MFGID    EQU   CONFIGTB+384                                             03043000
MFGCPUID EQU   MFGID                                                    03044000
CONFIGDB EQU   0                                                        03045000
CONFIGB  EQU   CONFIGDB+256                                             03046000
STATUS   EQU   CONFIGB                                                  03047000
CONFSHR  EQU   STATUS                                                   03048000
MSSTBL   EQU   0                                                        03049000
CNTVUA   EQU   MSSTBL                                                   03050000
VUATBL   EQU   MSSTBL+4                                                 03051000
VUA1     EQU   VUATBL                                                   03052000
VUA2     EQU   VUATBL+1                                                 03053000
STAT     EQU   VUATBL+2                                                 03054000
SHRD     EQU   STAT                                                     03055000
NUMSDG   EQU   VUATBL+3                                                 03056000
UCBBGN   EQU   0                                                        03057000
OPCODE   EQU   0                                                        03058000
DEBBAS02 EQU   DEBBASND                                                 03059000
DEBDDS1  EQU   DEBBAS02                                                 03060000
DEBSUCBA EQU   DEBDDS1                                                  03061000
DEBDEVED EQU   DEBDDS1+4                                                03062000
DEBRDCB  EQU   DEBDDS1+4                                                03063000
DEBPDCB  EQU   DEBDDS1+8                                                03064000
DEBWDCB  EQU   DEBDDS1+12                                               03065000
DEBACS09 EQU   DEBDEVED                                                 03066000
DEBASC09 EQU   DEBACS09                                                 03067000
DEBEAMFG EQU   DEBASC09+3                                               03068000
DEBDSID  EQU   DEBASC09+4                                               03069000
DEBEOD   EQU   DEBASC09+12                                              03070000
DEBBOE   EQU   DEBEOD                                                   03071000
DEBEODRV EQU   DEBBOE                                                   03072000
DEBEODTT EQU   DEBBOE+1                                                 03073000
DEBEOD0  EQU   DEBBOE+2                                                 03074000
DEBEODSS EQU   DEBBOE+3                                                 03075000
DEBBAS01 EQU   DEBBASND                                                 03076000
DEBISAM  EQU   DEBBAS01                                                 03077000
DEBFIEAD EQU   DEBISAM                                                  03078000
DEBFPEAD EQU   DEBISAM+4                                                03079000
DEBFOEAD EQU   DEBISAM+8                                                03080000
DEBEXPT  EQU   DEBISAM+12                                               03081000
DEBRPSID EQU   DEBEXPT                                                  03082000
UCBOBS01 EQU   UCBDEV                                                   03083000
UCBSTAB  EQU   UCBOBS01+10                                              03084000
UCBBSVL  EQU   UCBSTAB                                                  03085000
UCBPRSRS EQU   UCBSTAB                                                  03086000
UCBDMCT  EQU   UCBOBS01+11                                              03087000
UCBFL4   EQU   UCBOBS01+13                                              03088000
UCBOBS02 EQU   UCBDEV                                                   03089000
UCBTFL1  EQU   UCBOBS02+19                                              03090000
UCBXTN   EQU   UCBOBS02+20                                              03091000
UCBVOPT  EQU   UCBXTN                                                   03092000
UCBOBS03 EQU   UCBDEV                                                   03093000
UCBXTADR EQU   UCBOBS03                                                 03094000
UCBOBS04 EQU   UCBDEV                                                   03095000
UCBBTA   EQU   UCBOBS04+12                                              03096000
UCBOBS06 EQU   UCBDEV                                                   03097000
UCBAOF   EQU   UCBOBS06                                                 03098000
UCBAOF1  EQU   UCBAOF                                                   03099000
UCBAOF2  EQU   UCBAOF+1                                                 03100000
@NM00040 EQU   UCBOBS06+3                                               03101000
UCBIRB   EQU   UCBOBS06+4                                               03102000
UCBGRAF  EQU   UCBIRB                                                   03103000
UCBLDNCA EQU   UCBOBS06+8                                               03104000
UCBRDYQ  EQU   UCBLDNCA                                                 03105000
UCBIRLN  EQU   UCBRDYQ                                                  03106000
UCBLDNCB EQU   UCBRDYQ+1                                                03107000
UCBCTLNK EQU   UCBOBS06+12                                              03108000
UCBOBS07 EQU   UCBDEV                                                   03109000
UCBOBS08 EQU   UCBDEV                                                   03110000
UCBCTCAD EQU   UCBOBS08                                                 03111000
UCBCTCF1 EQU   UCBOBS08+4                                               03112000
UCBOBS09 EQU   UCBDEV                                                   03113000
UCBIOSBA EQU   UCBOBS09                                                 03114000
UCBRV066 EQU   UCBOBS09+4                                               03115000
CVTS01   EQU   CVTPGSIA                                                 03116000
CVTLPDIA EQU   CVTS01+12                                                03117000
CVTDIRST EQU   CVTLPDIA                                                 03118000
CVTSLIDA EQU   CVTS01+24                                                03119000
CVTCTLFG EQU   CVTS01+50                                                03120000
CVTPCCAT EQU   CVTS01+416                                               03121000
CVTRV210 EQU   CVTS01+424                                               03122000
CVTRV219 EQU   CVTS01+425                                               03123000
CVTRV228 EQU   CVTS01+426                                               03124000
CVTRV237 EQU   CVTS01+427                                               03125000
CVTMFRTR EQU   CVTS01+452                                               03126000
CVTRV262 EQU   CVTS01+468                                               03127000
CVTRV271 EQU   CVTS01+469                                               03128000
CVTRV280 EQU   CVTS01+470                                               03129000
CVTRV289 EQU   CVTS01+471                                               03130000
CVTGSDA  EQU   CVTS01+600                                               03131000
PSARSVTE EQU   PSARSVT                                                  03132000
MSSECBAD EQU   UCBIOSBA                                                 03133000
MSSASCBA EQU   UCBRV066                                                 03134000
QWPARM   EQU   QUPARM                                                   03135000
QWRES1   EQU   QWPARM                                                   03136000
QWFLAG   EQU   QWPARM+2                                                 03137000
QTPARM   EQU   QUPARM                                                   03138000
QTID     EQU   QTPARM                                                   03139000
QTDASCHR EQU   QTPARM+20                                                03140000
QLPARM   EQU   QUPARM                                                   03141000
QCPARM   EQU   QUPARM                                                   03142000
ARFLAG   EQU   ARFLG                                                    03143000
ARLEN    EQU   ARLL                                                     03144000
ARNMEXTS EQU   ARNMEXT                                                  03145000
DMHOSTID EQU   DMHOST                                                   03146000
DMNTLEN  EQU   DMLEN                                                    03147000
DMOPCODE EQU   DMOPCD                                                   03148000
DMVOLID  EQU   DMVOL                                                    03149000
FLC      EQU   PSA                                                      03150000
MNTFLAGS EQU   MDFLG                                                    03151000
MNTHOSTD EQU   MDHOST                                                   03152000
MNTJFCB  EQU   MDJFCB                                                   03153000
MNTLEN   EQU   MDLEN                                                    03154000
MNTOPCD  EQU   MDOPCD                                                   03155000
MNTVOLID EQU   MDVOL                                                    03156000
MNTVUA   EQU   MDVUA                                                    03157000
*                                      START UNREFERENCED COMPONENTS    03158000
QCMAD3Z1 EQU   QCPARM+28                                                03159000
QCMAD3Z0 EQU   QCPARM+24                                                03160000
QCMAD2Z1 EQU   QCPARM+20                                                03161000
QCMAD2Z0 EQU   QCPARM+16                                                03162000
QCMAD1Z1 EQU   QCPARM+12                                                03163000
QCMAD1Z0 EQU   QCPARM+8                                                 03164000
QCMAD0Z1 EQU   QCPARM+4                                                 03165000
QCMAD0Z0 EQU   QCPARM                                                   03166000
QLRES    EQU   QLPARM+2                                                 03167000
QLZYX    EQU   QLPARM                                                   03168000
QTRES    EQU   QTPARM+24                                                03169000
QTDATA   EQU   QTPARM+2                                                 03170000
QTFLAG   EQU   QTPARM+1                                                 03171000
QTTABID  EQU   QTID                                                     03172000
QWRES2   EQU   QWPARM+3                                                 03173000
QWALTMSC EQU   QWFLAG                                                   03174000
@NM00094 EQU   QWFLAG                                                   03175000
QWMEM    EQU   QWFLAG                                                   03176000
QWSSID   EQU   QWRES1                                                   03177000
PSARSAV  EQU   PSARSVTE+60                                              03178000
PSARSTK  EQU   PSARSVTE+56                                              03179000
PSAESAV3 EQU   PSARSVTE+52                                              03180000
PSAESTK3 EQU   PSARSVTE+48                                              03181000
PSAESAV2 EQU   PSARSVTE+44                                              03182000
PSAESTK2 EQU   PSARSVTE+40                                              03183000
PSAESAV1 EQU   PSARSVTE+36                                              03184000
PSAESTK1 EQU   PSARSVTE+32                                              03185000
PSAPSAV  EQU   PSARSVTE+28                                              03186000
PSAPSTK  EQU   PSARSVTE+24                                              03187000
PSAMSAV  EQU   PSARSVTE+20                                              03188000
PSAMSTK  EQU   PSARSVTE+16                                              03189000
PSASSAV  EQU   PSARSVTE+12                                              03190000
PSASSTK  EQU   PSARSVTE+8                                               03191000
PSANSTK  EQU   PSARSVTE+4                                               03192000
PSACSTK  EQU   PSARSVTE                                                 03193000
CVTRV628 EQU   CVTS01+728                                               03194000
CVTRV627 EQU   CVTS01+724                                               03195000
CVTRV626 EQU   CVTS01+720                                               03196000
CVTRV625 EQU   CVTS01+716                                               03197000
CVTRV624 EQU   CVTS01+712                                               03198000
CVTRV623 EQU   CVTS01+708                                               03199000
CVTRV622 EQU   CVTS01+704                                               03200000
CVTRV621 EQU   CVTS01+700                                               03201000
CVTIHASU EQU   CVTS01+696                                               03202000
CVTSUSP  EQU   CVTS01+692                                               03203000
CVTT6SVC EQU   CVTS01+688                                               03204000
CVTCDAL  EQU   CVTS01+684                                               03205000
CVTTCTL  EQU   CVTS01+680                                               03206000
CVTRSUME EQU   CVTS01+676                                               03207000
CVTJTERM EQU   CVTS01+672                                               03208000
CVTASMRM EQU   CVTS01+668                                               03209000
CVTTCASP EQU   CVTS01+664                                               03210000
CVT0PT03 EQU   CVTS01+660                                               03211000
CVT0PT0E EQU   CVTS01+656                                               03212000
CVTRV609 EQU   CVTS01+652                                               03213000
CVTCGK   EQU   CVTS01+648                                               03214000
CVTRAC   EQU   CVTS01+644                                               03215000
CVTHSM   EQU   CVTS01+640                                               03216000
CVTRV605 EQU   CVTS01+636                                               03217000
CVTRV604 EQU   CVTS01+632                                               03218000
CVTEFF02 EQU   CVTS01+628                                               03219000
CVTCBBR  EQU   CVTS01+624                                               03220000
CVTSSCR  EQU   CVTS01+620                                               03221000
CVTEVENT EQU   CVTS01+616                                               03222000
CVTCRCA  EQU   CVTS01+612                                               03223000
CVTTPIO  EQU   CVTS01+608                                               03224000
CVTADV   EQU   CVTS01+604                                               03225000
CVTGSDAB EQU   CVTGSDA                                                  03226000
CVTQV3   EQU   CVTS01+596                                               03227000
CVTQV2   EQU   CVTS01+592                                               03228000
CVTQV1   EQU   CVTS01+588                                               03229000
CVTRPT   EQU   CVTS01+584                                               03230000
CVTSSRB  EQU   CVTS01+580                                               03231000
CVTCSDRL EQU   CVTS01+576                                               03232000
CVTEXP1  EQU   CVTS01+572                                               03233000
CVTRMPMT EQU   CVTS01+568                                               03234000
CVTRMPTT EQU   CVTS01+564                                               03235000
CVTVPSA  EQU   CVTS01+560                                               03236000
CVTVSTOP EQU   CVTS01+556                                               03237000
CVTGTFR8 EQU   CVTS01+552                                               03238000
CVTQUIT  EQU   CVTS01+548                                               03239000
CVTVACR  EQU   CVTS01+544                                               03240000
CVTWTCB  EQU   CVTS01+540                                               03241000
CVTSTPRS EQU   CVTS01+536                                               03242000
CVT0PT02 EQU   CVTS01+532                                               03243000
CVTDARCM EQU   CVTS01+528                                               03244000
CVTIRECM EQU   CVTS01+524                                               03245000
CVTJRECM EQU   CVTS01+520                                               03246000
CVTVEMS0 EQU   CVTS01+516                                               03247000
CVTSPFRR EQU   CVTS01+512                                               03248000
CVTRLSTG EQU   CVTS01+508                                               03249000
CVT0TC0A EQU   CVTS01+504                                               03250000
CVTGMBR  EQU   CVTS01+500                                               03251000
CVTLFRM  EQU   CVTS01+496                                               03252000
CVTRMBR  EQU   CVTS01+492                                               03253000
CVTVIOP  EQU   CVTS01+488                                               03254000
CVTRV307 EQU   CVTS01+486                                               03255000
CVTRV306 EQU   CVTS01+484                                               03256000
CVTRV305 EQU   CVTS01+482                                               03257000
CVTRV304 EQU   CVTS01+480                                               03258000
CVTRV303 EQU   CVTS01+478                                               03259000
CVTRV302 EQU   CVTS01+476                                               03260000
CVTTRCA  EQU   CVTS01+472                                               03261000
CVTRV297 EQU   CVTRV289                                                 03262000
CVTRV296 EQU   CVTRV289                                                 03263000
CVTRV295 EQU   CVTRV289                                                 03264000
CVTRV294 EQU   CVTRV289                                                 03265000
CVTRV293 EQU   CVTRV289                                                 03266000
CVTRV292 EQU   CVTRV289                                                 03267000
CVTRV291 EQU   CVTRV289                                                 03268000
CVTRV290 EQU   CVTRV289                                                 03269000
CVTRV288 EQU   CVTRV280                                                 03270000
CVTRV287 EQU   CVTRV280                                                 03271000
CVTRV286 EQU   CVTRV280                                                 03272000
CVTRV285 EQU   CVTRV280                                                 03273000
CVTRV284 EQU   CVTRV280                                                 03274000
CVTRV283 EQU   CVTRV280                                                 03275000
CVTRV282 EQU   CVTRV280                                                 03276000
CVTRV281 EQU   CVTRV280                                                 03277000
CVTRV279 EQU   CVTRV271                                                 03278000
CVTRV278 EQU   CVTRV271                                                 03279000
CVTRV277 EQU   CVTRV271                                                 03280000
CVTRV276 EQU   CVTRV271                                                 03281000
CVTRV275 EQU   CVTRV271                                                 03282000
CVTRV274 EQU   CVTRV271                                                 03283000
CVTRV273 EQU   CVTRV271                                                 03284000
CVTRV272 EQU   CVTRV271                                                 03285000
CVTRV270 EQU   CVTRV262                                                 03286000
CVTRV269 EQU   CVTRV262                                                 03287000
CVTRV268 EQU   CVTRV262                                                 03288000
CVTRV267 EQU   CVTRV262                                                 03289000
CVTRV266 EQU   CVTRV262                                                 03290000
CVTRV265 EQU   CVTRV262                                                 03291000
CVTRV264 EQU   CVTRV262                                                 03292000
CVTRV263 EQU   CVTRV262                                                 03293000
CVTVFP   EQU   CVTS01+464                                               03294000
CVTVSI   EQU   CVTS01+460                                               03295000
CVTVPSIB EQU   CVTS01+456                                               03296000
CVTMFACT EQU   CVTMFRTR                                                 03297000
CVTMFCTL EQU   CVTS01+448                                               03298000
CVTPVBP  EQU   CVTS01+444                                               03299000
CVTPWI   EQU   CVTS01+440                                               03300000
CVTRV254 EQU   CVTS01+438                                               03301000
CVTRV253 EQU   CVTS01+436                                               03302000
CVTRV252 EQU   CVTS01+434                                               03303000
CVTRV251 EQU   CVTS01+433                                               03304000
CVTRV250 EQU   CVTS01+432                                               03305000
CVTRV249 EQU   CVTS01+431                                               03306000
CVTRV248 EQU   CVTS01+430                                               03307000
CVTRV247 EQU   CVTS01+429                                               03308000
CVTRV246 EQU   CVTS01+428                                               03309000
CVTRV245 EQU   CVTRV237                                                 03310000
CVTRV244 EQU   CVTRV237                                                 03311000
CVTRV243 EQU   CVTRV237                                                 03312000
CVTRV242 EQU   CVTRV237                                                 03313000
CVTRV241 EQU   CVTRV237                                                 03314000
CVTRV240 EQU   CVTRV237                                                 03315000
CVTRV239 EQU   CVTRV237                                                 03316000
CVTRV238 EQU   CVTRV237                                                 03317000
CVTRV236 EQU   CVTRV228                                                 03318000
CVTRV235 EQU   CVTRV228                                                 03319000
CVTRV234 EQU   CVTRV228                                                 03320000
CVTRV233 EQU   CVTRV228                                                 03321000
CVTRV232 EQU   CVTRV228                                                 03322000
CVTRV231 EQU   CVTRV228                                                 03323000
CVTRV230 EQU   CVTRV228                                                 03324000
CVTRV229 EQU   CVTRV228                                                 03325000
CVTRV227 EQU   CVTRV219                                                 03326000
CVTRV226 EQU   CVTRV219                                                 03327000
CVTRV225 EQU   CVTRV219                                                 03328000
CVTRV224 EQU   CVTRV219                                                 03329000
CVTRV223 EQU   CVTRV219                                                 03330000
CVTRV222 EQU   CVTRV219                                                 03331000
CVTRV221 EQU   CVTRV219                                                 03332000
CVTRV220 EQU   CVTRV219                                                 03333000
CVTRV218 EQU   CVTRV210                                                 03334000
CVTRV217 EQU   CVTRV210                                                 03335000
CVTRV216 EQU   CVTRV210                                                 03336000
CVTRV215 EQU   CVTRV210                                                 03337000
CVTRV214 EQU   CVTRV210                                                 03338000
CVTRV213 EQU   CVTRV210                                                 03339000
CVTRV212 EQU   CVTRV210                                                 03340000
CVTRV211 EQU   CVTRV210                                                 03341000
CVTLCCAT EQU   CVTS01+420                                               03342000
CVTIPCRP EQU   CVTS01+412                                               03343000
CVTIPCRI EQU   CVTS01+408                                               03344000
CVTIPCDS EQU   CVTS01+404                                               03345000
CVTAIDVT EQU   CVTS01+400                                               03346000
CVTSSAP  EQU   CVTS01+396                                               03347000
CVTEHCIR EQU   CVTS01+392                                               03348000
CVTEHDEF EQU   CVTS01+388                                               03349000
CVTDAIR  EQU   CVTS01+384                                               03350000
CVTPERFM EQU   CVTS01+380                                               03351000
CVT044R2 EQU   CVTS01+376                                               03352000
CVTFETCH EQU   CVTS01+372                                               03353000
CVTRSTWD EQU   CVTS01+368                                               03354000
CVTSPOST EQU   CVTS01+364                                               03355000
CVTIOBP  EQU   CVTS01+360                                               03356000
CVTASMVT EQU   CVTS01+356                                               03357000
CVTRECRQ EQU   CVTS01+352                                               03358000
CVTWSAC  EQU   CVTS01+348                                               03359000
CVTRV149 EQU   CVTS01+344                                               03360000
CVTWSAL  EQU   CVTS01+340                                               03361000
CVTSPSA  EQU   CVTS01+336                                               03362000
CVTGLMN  EQU   CVTS01+332                                               03363000
CVTVEAC0 EQU   CVTS01+328                                               03364000
CVT062R1 EQU   CVTS01+324                                               03365000
CVTRPOST EQU   CVTS01+320                                               03366000
CVTDQIQE EQU   CVTS01+316                                               03367000
CVTCSD   EQU   CVTS01+312                                               03368000
CVTLKRMA EQU   CVTS01+308                                               03369000
CVTRSPIE EQU   CVTS01+304                                               03370000
CVTRENQ  EQU   CVTS01+300                                               03371000
CVTLQCB  EQU   CVTS01+296                                               03372000
CVTFQCB  EQU   CVTS01+292                                               03373000
CVTQCS01 EQU   CVTS01+288                                               03374000
CVTAPFT  EQU   CVTS01+284                                               03375000
CVTPARRL EQU   CVTS01+280                                               03376000
CVTVWAIT EQU   CVTS01+276                                               03377000
CVTGSPL  EQU   CVTS01+272                                               03378000
CVTLSMQ  EQU   CVTS01+268                                               03379000
CVTGSMQ  EQU   CVTS01+264                                               03380000
CVTEXPRO EQU   CVTS01+260                                               03381000
CVTOPCTP EQU   CVTS01+256                                               03382000
CVTSIC   EQU   CVTS01+252                                               03383000
CVTTPIOS EQU   CVTS01+248                                               03384000
CVTRTMS  EQU   CVTS01+244                                               03385000
CVTSDBF  EQU   CVTS01+240                                               03386000
CVTSCBP  EQU   CVTS01+236                                               03387000
CVTSDMP  EQU   CVTS01+232                                               03388000
CVTSV60  EQU   CVTS01+228                                               03389000
CVTRTMCT EQU   CVTS01+224                                               03390000
CVTASCBL EQU   CVTS01+220                                               03391000
CVTASCBH EQU   CVTS01+216                                               03392000
CVTGDA   EQU   CVTS01+212                                               03393000
CVTASVT  EQU   CVTS01+208                                               03394000
CVTVVMDI EQU   CVTS01+204                                               03395000
CVTAQTOP EQU   CVTS01+200                                               03396000
CVTIOSCS EQU   CVTS01+196                                               03397000
CVTSDRM  EQU   CVTS01+192                                               03398000
CVTOPTE  EQU   CVTS01+188                                               03399000
CVTSTXU  EQU   CVTS01+184                                               03400000
CVTQUIS  EQU   CVTS01+180                                               03401000
CVTPARS  EQU   CVTS01+176                                               03402000
CVTS1EE  EQU   CVTS01+172                                               03403000
CVTFRAS  EQU   CVTS01+168                                               03404000
CVTQSAS  EQU   CVTS01+164                                               03405000
CVTCRAS  EQU   CVTS01+160                                               03406000
CVTCRMN  EQU   CVTS01+156                                               03407000
CVTDELCP EQU   CVTS01+152                                               03408000
CVTFRECL EQU   CVTS01+148                                               03409000
CVTGETCL EQU   CVTS01+144                                               03410000
CVTBLDCP EQU   CVTS01+140                                               03411000
CVTAUTHL EQU   CVTS01+136                                               03412000
CVTSCAN  EQU   CVTS01+132                                               03413000
CVTRV144 EQU   CVTS01+130                                               03414000
CVTMAXMP EQU   CVTS01+128                                               03415000
CVTSTCK  EQU   CVTS01+124                                               03416000
CVTRV139 EQU   CVTS01+123                                               03417000
CVTDSSAC EQU   CVTS01+122                                               03418000
CVTRV513 EQU   CVTS01+121                                               03419000
CVTIOSPL EQU   CVTS01+120                                               03420000
CVTPTGT  EQU   CVTS01+116                                               03421000
CVTCSPIE EQU   CVTS01+112                                               03422000
CVTSMFEX EQU   CVTS01+108                                               03423000
CVTOLT0A EQU   CVTS01+104                                               03424000
CVTSRBRT EQU   CVTS01+100                                               03425000
CVTPUTL  EQU   CVTS01+96                                                03426000
CVTASCRL EQU   CVTS01+92                                                03427000
CVTASCRF EQU   CVTS01+88                                                03428000
CVTRV326 EQU   CVTS01+84                                                03429000
CVTRV325 EQU   CVTS01+80                                                03430000
CVTRV324 EQU   CVTS01+76                                                03431000
CVT0VL01 EQU   CVTS01+72                                                03432000
CVTSHRVM EQU   CVTS01+68                                                03433000
CVTRV332 EQU   CVTS01+64                                                03434000
CVTTAS   EQU   CVTS01+60                                                03435000
CVTRSCN  EQU   CVTS01+56                                                03436000
CVTTRAC2 EQU   CVTS01+54                                                03437000
CVTTRACE EQU   CVTS01+52                                                03438000
CVTAPG   EQU   CVTS01+51                                                03439000
CVTSDTRC EQU   CVTCTLFG                                                 03440000
CVTGTRCE EQU   CVTCTLFG                                                 03441000
CVTNOMP  EQU   CVTCTLFG                                                 03442000
CVTRSV79 EQU   CVTCTLFG                                                 03443000
CVTDSTAT EQU   CVTCTLFG                                                 03444000
CVTRSV78 EQU   CVTCTLFG                                                 03445000
CVTRV333 EQU   CVTCTLFG                                                 03446000
CVTRV323 EQU   CVTCTLFG                                                 03447000
CVTSPVLK EQU   CVTS01+49                                                03448000
CVTRSV77 EQU   CVTS01+48                                                03449000
CVTRV331 EQU   CVTS01+44                                                03450000
CVTRV330 EQU   CVTS01+40                                                03451000
CVTRV329 EQU   CVTS01+36                                                03452000
CVTRV328 EQU   CVTS01+32                                                03453000
CVTRV322 EQU   CVTS01+28                                                03454000
CVTSLID  EQU   CVTSLIDA+1                                               03455000
CVTSYLK  EQU   CVTSLIDA                                                 03456000
CVTPSAE0 EQU   CVTS01+20                                                03457000
CVTPSAD0 EQU   CVTS01+16                                                03458000
CVTLPDIR EQU   CVTLPDIA+1                                               03459000
CVTRSV69 EQU   CVTDIRST                                                 03460000
CVTRSV68 EQU   CVTDIRST                                                 03461000
CVTRSV67 EQU   CVTDIRST                                                 03462000
CVTRSV66 EQU   CVTDIRST                                                 03463000
CVTRSV65 EQU   CVTDIRST                                                 03464000
CVTRSV64 EQU   CVTDIRST                                                 03465000
CVTRSV63 EQU   CVTDIRST                                                 03466000
CVTDICOM EQU   CVTDIRST                                                 03467000
CVTPVTP  EQU   CVTS01+8                                                 03468000
CVTLPDSR EQU   CVTS01+4                                                 03469000
CVTGETL  EQU   CVTS01                                                   03470000
UCBRV042 EQU   UCBOBS08+5                                               03471000
UCBRV082 EQU   UCBCTCF1                                                 03472000
UCBRV081 EQU   UCBCTCF1                                                 03473000
UCBRV080 EQU   UCBCTCF1                                                 03474000
UCBRV079 EQU   UCBCTCF1                                                 03475000
UCBRV078 EQU   UCBCTCF1                                                 03476000
UCBRV077 EQU   UCBCTCF1                                                 03477000
UCBRV076 EQU   UCBCTCF1                                                 03478000
UCBCTC80 EQU   UCBCTCF1                                                 03479000
UCBCTCAL EQU   UCBCTCAD                                                 03480000
UCBICNCB EQU   UCBOBS07+4                                               03481000
UCBRV040 EQU   UCBOBS07                                                 03482000
UCBCTLNA EQU   UCBCTLNK+1                                               03483000
UCBRLN   EQU   UCBCTLNK                                                 03484000
UCBRDYQA EQU   UCBLDNCB                                                 03485000
UCBINRLN EQU   UCBIRLN                                                  03486000
UCBIRBA  EQU   UCBIRB+1                                                 03487000
UCBRV039 EQU   UCBGRAF                                                  03488000
UCBDWNR  EQU   UCBGRAF                                                  03489000
UCBRPND  EQU   UCBGRAF                                                  03490000
UCBUPM   EQU   UCBGRAF                                                  03491000
UCBBTAM  EQU   UCBGRAF                                                  03492000
UCBDRNO  EQU   UCBGRAF                                                  03493000
UCBDRO   EQU   UCBGRAF                                                  03494000
UCBOIP   EQU   UCBGRAF                                                  03495000
UCBATRCD EQU   @NM00040                                                 03496000
UCBSKPFG EQU   @NM00040                                                 03497000
UCBRIPND EQU   @NM00040                                                 03498000
UCBRTIAC EQU   @NM00040                                                 03499000
UCBRSV79 EQU   @NM00040                                                 03500000
UCBRSV78 EQU   @NM00040                                                 03501000
UCBRSV77 EQU   @NM00040                                                 03502000
UCBOLTEP EQU   @NM00040                                                 03503000
UCBATNCT EQU   UCBOBS06+2                                               03504000
UCBRSV76 EQU   UCBAOF2                                                  03505000
UCBRSV75 EQU   UCBAOF2                                                  03506000
UCBRSV74 EQU   UCBAOF2                                                  03507000
UCBRSV73 EQU   UCBAOF2                                                  03508000
UCBRSV72 EQU   UCBAOF2                                                  03509000
UCBRSV71 EQU   UCBAOF2                                                  03510000
UCBRSV70 EQU   UCBAOF2                                                  03511000
UCBRSV69 EQU   UCBAOF2                                                  03512000
UCBRSV68 EQU   UCBAOF1                                                  03513000
UCBRSV67 EQU   UCBAOF1                                                  03514000
UCBRSV66 EQU   UCBAOF1                                                  03515000
UCBRSV65 EQU   UCBAOF1                                                  03516000
UCBRSV64 EQU   UCBAOF1                                                  03517000
UCBOFNL  EQU   UCBAOF1                                                  03518000
UCBOFSP  EQU   UCBAOF1                                                  03519000
UCBOFMCR EQU   UCBAOF1                                                  03520000
UCBBTB   EQU   UCBBTA+1                                                 03521000
UCBDI    EQU   UCBBTA                                                   03522000
UCBSNS   EQU   UCBOBS04+8                                               03523000
UCBTEB   EQU   UCBOBS04+4                                               03524000
UCBGCB   EQU   UCBOBS04+3                                               03525000
UCBOPEN  EQU   UCBOBS04+2                                               03526000
UCBSTART EQU   UCBOBS04                                                 03527000
UCBXTNB  EQU   UCBXTN+1                                                 03528000
UCBRSV22 EQU   UCBVOPT                                                  03529000
UCBRSV21 EQU   UCBVOPT                                                  03530000
UCBRSV20 EQU   UCBVOPT                                                  03531000
UCBESVE  EQU   UCBVOPT                                                  03532000
UCBERPC  EQU   UCBVOPT                                                  03533000
UCBESVC  EQU   UCBVOPT                                                  03534000
UCBEVA   EQU   UCBVOPT                                                  03535000
UCBESV   EQU   UCBVOPT                                                  03536000
UCBRV009 EQU   UCBTFL1                                                  03537000
UCBRV008 EQU   UCBTFL1                                                  03538000
UCBRV007 EQU   UCBTFL1                                                  03539000
UCBRV006 EQU   UCBTFL1                                                  03540000
UCBRV005 EQU   UCBTFL1                                                  03541000
UCBDQDSP EQU   UCBTFL1                                                  03542000
UCBNSLTP EQU   UCBTFL1                                                  03543000
UCBNLTP  EQU   UCBTFL1                                                  03544000
UCBRES1B EQU   UCBOBS02+18                                              03545000
UCBFSER  EQU   UCBOBS02+12                                              03546000
@NM00039 EQU   UCBOBS02+4                                               03547000
UCBFSEQ  EQU   UCBOBS02+2                                               03548000
UCBFSCT  EQU   UCBOBS02                                                 03549000
UCBNEXP  EQU   UCBOBS01+20                                              03550000
UCBBASE  EQU   UCBOBS01+16                                              03551000
UCBRES1A EQU   UCBOBS01+15                                              03552000
UCBUSER  EQU   UCBOBS01+14                                              03553000
UCBFL47  EQU   UCBFL4                                                   03554000
UCBMAT   EQU   UCBFL4                                                   03555000
UCBHOLD  EQU   UCBFL4                                                   03556000
UCBATTN  EQU   UCBFL4                                                   03557000
UCBDSS   EQU   UCBFL4                                                   03558000
UCBRESVP EQU   UCBFL4                                                   03559000
UCBWDAV  EQU   UCBFL4                                                   03560000
UCBDAVV  EQU   UCBFL4                                                   03561000
UCBSQC   EQU   UCBOBS01+12                                              03562000
UCBDATP  EQU   UCBOBS01+12                                              03563000
UCBDMC   EQU   UCBDMCT                                                  03564000
UCBMOUNT EQU   UCBDMCT                                                  03565000
UCBBNUL  EQU   UCBSTAB                                                  03566000
UCBSHAR  EQU   UCBSTAB                                                  03567000
UCBBSTR  EQU   UCBSTAB                                                  03568000
UCBBPUB  EQU   UCBSTAB                                                  03569000
UCBBPRV  EQU   UCBSTAB                                                  03570000
UCBBALB  EQU   UCBPRSRS                                                 03571000
UCBPGFL  EQU   UCBSTAB                                                  03572000
UCBDVSHR EQU   UCBBSVL                                                  03573000
UCBVOLI  EQU   UCBOBS01+4                                               03574000
UCBVTOC  EQU   UCBOBS01                                                 03575000
DEBEXPTA EQU   DEBEXPT+1                                                03576000
DEBRSV12 EQU   DEBRPSID                                                 03577000
DEBRSV11 EQU   DEBRPSID                                                 03578000
DEBRSV10 EQU   DEBRPSID                                                 03579000
DEBRSV09 EQU   DEBRPSID                                                 03580000
DEBRPSAP EQU   DEBRPSID                                                 03581000
DEBRPSO  EQU   DEBRPSID                                                 03582000
DEBRPSI  EQU   DEBRPSID                                                 03583000
DEBRPSP  EQU   DEBRPSID                                                 03584000
DEBFOEB  EQU   DEBFOEAD+1                                               03585000
DEBNOEE  EQU   DEBFOEAD                                                 03586000
DEBFPEB  EQU   DEBFPEAD+1                                               03587000
DEBNPEE  EQU   DEBFPEAD                                                 03588000
DEBFIEB  EQU   DEBFIEAD+1                                               03589000
DEBNIEE  EQU   DEBFIEAD                                                 03590000
DEBBOESS EQU   DEBEODSS                                                 03591000
DEBBOE0  EQU   DEBEOD0                                                  03592000
DEBBOETT EQU   DEBEODTT                                                 03593000
DEBBOERV EQU   DEBEODRV                                                 03594000
DEBRV008 EQU   DEBDSID+7                                                03595000
DEBWTPTI EQU   DEBDSID+6                                                03596000
DEBEXDTE EQU   DEBDSID                                                  03597000
DEBRV007 EQU   DEBEAMFG                                                 03598000
DEBRV006 EQU   DEBEAMFG                                                 03599000
DEBRV005 EQU   DEBEAMFG                                                 03600000
DEBRV004 EQU   DEBEAMFG                                                 03601000
DEBSECVL EQU   DEBEAMFG                                                 03602000
DEBVAMSG EQU   DEBEAMFG                                                 03603000
DEBDSOPN EQU   DEBEAMFG                                                 03604000
DEBMULTI EQU   DEBEAMFG                                                 03605000
DEBVSEQU EQU   DEBASC09+2                                               03606000
DEBDSSQL EQU   DEBASC09+1                                               03607000
DEBVOLAC EQU   DEBASC09                                                 03608000
DEBWDCBA EQU   DEBWDCB+1                                                03609000
DEBRSV08 EQU   DEBWDCB                                                  03610000
DEBPDCBA EQU   DEBPDCB+1                                                03611000
DEBRSV07 EQU   DEBPDCB                                                  03612000
DEBRDCBA EQU   DEBRDCB+1                                                03613000
DEBRSV06 EQU   DEBRDCB                                                  03614000
DEBSUCBB EQU   DEBSUCBA+1                                               03615000
DEBSDVM  EQU   DEBSUCBA                                                 03616000
SDGNUM   EQU   NUMSDG                                                   03617000
@NM00103 EQU   NUMSDG                                                   03618000
@NM00102 EQU   STAT                                                     03619000
DV       EQU   VUA2                                                     03620000
CU       EQU   VUA2                                                     03621000
CH       EQU   VUA1                                                     03622000
ZEROS    EQU   VUA1                                                     03623000
@NM00101 EQU   CONFIGB+1                                                03624000
CONFSDG  EQU   STATUS                                                   03625000
@NM00100 EQU   STATUS                                                   03626000
@NM00099 EQU   CONFIGDB                                                 03627000
@NM00098 EQU   MFGID+5                                                  03628000
CHANNEL  EQU   BYTE2                                                    03629000
@NM00097 EQU   BYTE2                                                    03630000
CTLUNIT  EQU   BYTE2                                                    03631000
@NM00096 EQU   BYTE1                                                    03632000
@NM00095 EQU   CONFIGTB                                                 03633000
@NM00093 EQU   MVTBL+272                                                03634000
@NM00092 EQU   MVTBL+269                                                03635000
@NM00091 EQU   MNTFLG                                                   03636000
@NM00090 EQU   MVTBL+45                                                 03637000
@NM00089 EQU   MVTBL                                                    03638000
MSSMSER  EQU   OSMSCOMM+42                                              03639000
@NM00079 EQU   MSSFLAG3                                                 03640000
MSSRC10  EQU   MSSFLAG3                                                 03641000
@NM00078 EQU   MSSFLAG2                                                 03642000
MSSIGNOR EQU   MSSFLAG2                                                 03643000
MSGPROC  EQU   MSSFLAG2                                                 03644000
INPROC   EQU   MSSFLAG2                                                 03645000
MQENT    EQU   MSSFLAG2                                                 03646000
RQENT    EQU   MSSFLAG2                                                 03647000
@NM00077 EQU   MSSFLAG1                                                 03648000
INUSE    EQU   MSSFLAG1                                                 03649000
@NM00076 EQU   MSSFLAG1                                                 03650000
MSSUSER  EQU   OSMSCOMM+28                                              03651000
MSSNEXT  EQU   OSMSCOMM+24                                              03652000
MSSTASK3 EQU   OSMSCOMM+20                                              03653000
MSSTASK2 EQU   OSMSCOMM+16                                              03654000
MSSTASK1 EQU   OSMSCOMM+12                                              03655000
MSSTASKD EQU   OSMSCOMM+8                                               03656000
@NM00049 EQU   PCCA+384                                                 03657000
PCCARV36 EQU   PCCA+380                                                 03658000
PCCARV35 EQU   PCCA+378                                                 03659000
PCCARV01 EQU   PCCA+377                                                 03660000
PCCAR105 EQU   PCCAATTR                                                 03661000
PCCAR104 EQU   PCCAATTR                                                 03662000
PCCAR103 EQU   PCCAATTR                                                 03663000
PCCAR102 EQU   PCCAATTR                                                 03664000
PCCAR101 EQU   PCCAATTR                                                 03665000
PCCAR100 EQU   PCCAATTR                                                 03666000
PCCAIO   EQU   PCCAATTR                                                 03667000
PCCACPUM EQU   PCCAATTR                                                 03668000
PCCARV63 EQU   PCCA+372                                                 03669000
PCCARV62 EQU   PCCA+368                                                 03670000
PCCARV61 EQU   PCCA+364                                                 03671000
PCCARV60 EQU   PCCA+360                                                 03672000
PCCARV59 EQU   PCCA+356                                                 03673000
PCCARV58 EQU   PCCA+352                                                 03674000
PCCARV57 EQU   PCCA+348                                                 03675000
PCCARV56 EQU   PCCA+344                                                 03676000
PCCARV55 EQU   PCCA+340                                                 03677000
PCCARV54 EQU   PCCA+336                                                 03678000
PCCALOGA EQU   PCCA+332                                                 03679000
PCCACHID EQU   PCCA+324                                                 03680000
PCCACHSV EQU   PCCA+312                                                 03681000
PCCARV79 EQU   PCCACHF4                                                 03682000
PCCARV78 EQU   PCCACHF4                                                 03683000
PCCARV77 EQU   PCCACHF4                                                 03684000
PCCARV76 EQU   PCCACHF4                                                 03685000
PCCARV75 EQU   PCCACHF4                                                 03686000
PCCARV74 EQU   PCCACHF4                                                 03687000
PCCARV73 EQU   PCCACHF4                                                 03688000
PCCARV72 EQU   PCCACHF4                                                 03689000
PCCARV71 EQU   PCCACHF3                                                 03690000
PCCARV70 EQU   PCCACHF3                                                 03691000
PCCARV69 EQU   PCCACHF3                                                 03692000
PCCARV68 EQU   PCCACHF3                                                 03693000
PCCARV67 EQU   PCCACHF3                                                 03694000
PCCARV66 EQU   PCCACHF3                                                 03695000
PCCASLCK EQU   PCCACHF3                                                 03696000
PCCAISRB EQU   PCCACHF3                                                 03697000
PCCACF28 EQU   PCCACHF2                                                 03698000
PCCACF27 EQU   PCCACHF2                                                 03699000
PCCACF26 EQU   PCCACHF2                                                 03700000
PCCACF25 EQU   PCCACHF2                                                 03701000
PCCACF24 EQU   PCCACHF2                                                 03702000
PCCACF23 EQU   PCCACHF2                                                 03703000
PCCACF22 EQU   PCCACHF2                                                 03704000
PCCACF21 EQU   PCCACHF2                                                 03705000
PCCACF18 EQU   PCCACHF1                                                 03706000
PCCACF17 EQU   PCCACHF1                                                 03707000
PCCACF16 EQU   PCCACHF1                                                 03708000
PCCACF15 EQU   PCCACHF1                                                 03709000
PCCACF14 EQU   PCCACHF1                                                 03710000
PCCACF13 EQU   PCCACHF1                                                 03711000
PCCACF12 EQU   PCCACHF1                                                 03712000
PCCACF11 EQU   PCCACHF1                                                 03713000
PCCARV05 EQU   PCCA+307                                                 03714000
PCCACHPB EQU   PCCA+306                                                 03715000
PCCALGP2 EQU   PCCA+305                                                 03716000
PCCALGP1 EQU   PCCA+304                                                 03717000
PCCACELL EQU   PCCA+302                                                 03718000
PCCALOGL EQU   PCCA+300                                                 03719000
PCCACHW2 EQU   PCCA+296                                                 03720000
PCCACHW1 EQU   PCCA+292                                                 03721000
PCCAIOSI EQU   PCCA+291                                                 03722000
PCCACNRB EQU   PCCACHRB                                                 03723000
PCCACCVB EQU   PCCACHRB                                                 03724000
PCCACSNB EQU   PCCACHRB                                                 03725000
PCCARV52 EQU   PCCACHRB                                                 03726000
PCCACHIB EQU   PCCACHRB                                                 03727000
PCCACTIB EQU   PCCACHRB                                                 03728000
PCCACINB EQU   PCCACHRB                                                 03729000
PCCACSIB EQU   PCCACHRB                                                 03730000
PCCARV51 EQU   PCCACHS2                                                 03731000
PCCARV50 EQU   PCCACHS2                                                 03732000
PCCACCRA EQU   PCCACHS2                                                 03733000
PCCACURC EQU   PCCACHS2                                                 03734000
PCCACNLG EQU   PCCACHS2                                                 03735000
PCCACMOD EQU   PCCACHS2                                                 03736000
PCCACALT EQU   PCCACHS2                                                 03737000
PCCACIOR EQU   PCCACHS2                                                 03738000
PCCARV47 EQU   PCCACHS1                                                 03739000
PCCACUCB EQU   PCCACHS1                                                 03740000
PCCACIBC EQU   PCCACHS1                                                 03741000
PCCACAND EQU   PCCACHS1                                                 03742000
PCCACNLS EQU   PCCACHS1                                                 03743000
PCCACFRR EQU   PCCACHS1                                                 03744000
PCCACNRE EQU   PCCACHS1                                                 03745000
PCCACCMP EQU   PCCACHS1                                                 03746000
PCCACSEQ EQU   PCCACHTS                                                 03747000
PCCACDIN EQU   PCCACHTS                                                 03748000
PCCARV44 EQU   PCCACHTS                                                 03749000
PCCARV43 EQU   PCCACHTS                                                 03750000
PCCACTEC EQU   PCCACHTS                                                 03751000
PCCACDAV EQU   PCCACHVA                                                 03752000
PCCACCHV EQU   PCCACHVA                                                 03753000
PCCACCMD EQU   PCCACHVA                                                 03754000
PCCACUNS EQU   PCCACHVA                                                 03755000
PCCACSQV EQU   PCCACHVA                                                 03756000
PCCARV42 EQU   PCCACHVA                                                 03757000
PCCARV41 EQU   PCCACHVA                                                 03758000
PCCACITF EQU   PCCACHVA                                                 03759000
PCCARV40 EQU   PCCACHBL                                                 03760000
PCCARV39 EQU   PCCACHBL                                                 03761000
PCCARV38 EQU   PCCACHBL                                                 03762000
PCCACCUE EQU   PCCACHBL                                                 03763000
PCCACSTG EQU   PCCACHBL                                                 03764000
PCCACSCU EQU   PCCACHBL                                                 03765000
PCCACCHA EQU   PCCACHBL                                                 03766000
PCCACCPU EQU   PCCACHBL                                                 03767000
PCCACNOR EQU   PCCACHPF                                                 03768000
PCCACCNT EQU   PCCACHPF                                                 03769000
PCCACSNS EQU   PCCACHPF                                                 03770000
PCCARV37 EQU   PCCACHPF                                                 03771000
PCCACHIO EQU   PCCACHPF                                                 03772000
PCCACTIO EQU   PCCACHPF                                                 03773000
PCCACINT EQU   PCCACHPF                                                 03774000
PCCACSIO EQU   PCCACHPF                                                 03775000
PCCACHUB EQU   PCCAWERP                                                 03776000
PCCAR106 EQU   PCCA+228                                                 03777000
PCCACCHI EQU   PCCA+226                                                 03778000
PCCASRBL EQU   PCCA+225                                                 03779000
PCCAR112 EQU   PCCACHAN                                                 03780000
PCCAR111 EQU   PCCACHAN                                                 03781000
PCCAR110 EQU   PCCACHAN                                                 03782000
PCCAR109 EQU   PCCACHAN                                                 03783000
PCCAR108 EQU   PCCACHAN                                                 03784000
PCCAR107 EQU   PCCACHAN                                                 03785000
PCCAEXDM EQU   PCCACHAN                                                 03786000
PCCAIRST EQU   PCCACHAN                                                 03787000
PCCASRB  EQU   PCCA+180                                                 03788000
PCCACCHM EQU   PCCA+176                                                 03789000
PCCAELBA EQU   PCCA+172                                                 03790000
PCCAELAD EQU   PCCA+168                                                 03791000
PCCALRBR EQU   PCCA+164                                                 03792000
PCCALRBV EQU   PCCA+160                                                 03793000
PCCAPWAR EQU   PCCA+156                                                 03794000
PCCAPWAV EQU   PCCA+152                                                 03795000
PCCAEMSA EQU   PCCAEMSB+12                                              03796000
PCCAEMSE EQU   PCCAEMSB+8                                               03797000
PCCAEMSP EQU   PCCAEMSB+4                                               03798000
PCCARMS  EQU   PCCARMSB                                                 03799000
PCCARV34 EQU   PCCARMSB                                                 03800000
PCCARV33 EQU   PCCARMSB                                                 03801000
PCCARV32 EQU   PCCARMSB                                                 03802000
PCCARV31 EQU   PCCARMSB                                                 03803000
PCCARV30 EQU   PCCARMSB                                                 03804000
PCCARV29 EQU   PCCARMSB                                                 03805000
PCCARV28 EQU   PCCARMSB                                                 03806000
PCCARV27 EQU   PCCAEMS3                                                 03807000
PCCARV26 EQU   PCCAEMS3                                                 03808000
PCCARV25 EQU   PCCAEMS3                                                 03809000
PCCARV24 EQU   PCCAEMS3                                                 03810000
PCCARV23 EQU   PCCAEMS3                                                 03811000
PCCARV22 EQU   PCCAEMS3                                                 03812000
PCCARV21 EQU   PCCAEMS3                                                 03813000
PCCARV20 EQU   PCCAEMS3                                                 03814000
PCCARV19 EQU   PCCAEMS2                                                 03815000
PCCARV18 EQU   PCCAEMS2                                                 03816000
PCCARV17 EQU   PCCAEMS2                                                 03817000
PCCARV16 EQU   PCCAEMS2                                                 03818000
PCCARV15 EQU   PCCAEMS2                                                 03819000
PCCARV14 EQU   PCCAEMS2                                                 03820000
PCCARV13 EQU   PCCAEMS2                                                 03821000
PCCASERP EQU   PCCAEMS2                                                 03822000
PCCARV11 EQU   PCCARISP                                                 03823000
PCCARV10 EQU   PCCARISP                                                 03824000
PCCARV09 EQU   PCCARISP                                                 03825000
PCCARV08 EQU   PCCARISP                                                 03826000
PCCARV07 EQU   PCCARISP                                                 03827000
PCCARV06 EQU   PCCARISP                                                 03828000
PCCASERL EQU   PCCARISP                                                 03829000
PCCAPARL EQU   PCCARISP                                                 03830000
PCCARPB  EQU   PCCA+132                                                 03831000
PCCACTIN EQU   PCCAINTE                                                 03832000
PCCANFIN EQU   PCCAINTE                                                 03833000
PCCANUIN EQU   PCCAINTE                                                 03834000
PCCACTCC EQU   PCCACCE                                                  03835000
PCCANFCC EQU   PCCACCE                                                  03836000
PCCANUCC EQU   PCCACCE                                                  03837000
PCCACTTD EQU   PCCATODE                                                 03838000
PCCANFTD EQU   PCCATODE                                                 03839000
PCCANUTD EQU   PCCATODE                                                 03840000
PCCARV04 EQU   PCCATMFL                                                 03841000
PCCARV03 EQU   PCCATMFL                                                 03842000
PCCARV02 EQU   PCCATMFL                                                 03843000
PCCAMINT EQU   PCCATMFL                                                 03844000
PCCAMCC  EQU   PCCATMFL                                                 03845000
PCCAVKIL EQU   PCCATMFL                                                 03846000
PCCASYNC EQU   PCCATMFL                                                 03847000
PCCAINIT EQU   PCCATMFL                                                 03848000
PCCARV9E EQU   PCCA+124                                                 03849000
PCCARV9D EQU   PCCA+120                                                 03850000
PCCARV9C EQU   PCCA+116                                                 03851000
PCCARV9B EQU   PCCA+112                                                 03852000
PCCARV9A EQU   PCCA+108                                                 03853000
PCCARV99 EQU   PCCA+104                                                 03854000
PCCARV98 EQU   PCCA+100                                                 03855000
PCCARV97 EQU   PCCA+96                                                  03856000
PCCARV96 EQU   PCCA+92                                                  03857000
PCCARV95 EQU   PCCA+88                                                  03858000
PCCARV94 EQU   PCCA+84                                                  03859000
PCCARV93 EQU   PCCA+80                                                  03860000
PCCARV92 EQU   PCCA+76                                                  03861000
PCCARV91 EQU   PCCA+72                                                  03862000
PCCARV90 EQU   PCCA+68                                                  03863000
PCCARV89 EQU   PCCA+64                                                  03864000
PCCARV88 EQU   PCCA+60                                                  03865000
PCCARV87 EQU   PCCA+56                                                  03866000
PCCARV86 EQU   PCCA+52                                                  03867000
PCCARV85 EQU   PCCA+48                                                  03868000
PCCARV84 EQU   PCCA+44                                                  03869000
PCCARV83 EQU   PCCA+40                                                  03870000
PCCARV82 EQU   PCCA+36                                                  03871000
PCCARV81 EQU   PCCA+32                                                  03872000
PCCAPSAR EQU   PCCA+28                                                  03873000
PCCAPSAV EQU   PCCA+24                                                  03874000
PCCATQEP EQU   PCCA+20                                                  03875000
PCCACPUA EQU   PCCA+16                                                  03876000
PCCAPCCA EQU   PCCA                                                     03877000
@NM00048 EQU   TCBXTNT2+32                                              03878000
TCBRV181 EQU   TCBRV173                                                 03879000
TCBRV180 EQU   TCBRV173                                                 03880000
TCBRV179 EQU   TCBRV173                                                 03881000
TCBRV178 EQU   TCBRV173                                                 03882000
TCBRV177 EQU   TCBRV173                                                 03883000
TCBRV176 EQU   TCBRV173                                                 03884000
TCBRV175 EQU   TCBRV173                                                 03885000
TCBRV174 EQU   TCBRV173                                                 03886000
TCBRV172 EQU   TCBRV164                                                 03887000
TCBRV171 EQU   TCBRV164                                                 03888000
TCBRV170 EQU   TCBRV164                                                 03889000
TCBRV169 EQU   TCBRV164                                                 03890000
TCBRV168 EQU   TCBRV164                                                 03891000
TCBRV167 EQU   TCBRV164                                                 03892000
TCBRV166 EQU   TCBRV164                                                 03893000
TCBRV165 EQU   TCBRV164                                                 03894000
TCBRV163 EQU   TCBRV155                                                 03895000
TCBRV162 EQU   TCBRV155                                                 03896000
TCBRV161 EQU   TCBRV155                                                 03897000
TCBRV160 EQU   TCBRV155                                                 03898000
TCBRV159 EQU   TCBRV155                                                 03899000
TCBRV158 EQU   TCBRV155                                                 03900000
TCBRV157 EQU   TCBRV155                                                 03901000
TCBRV156 EQU   TCBRV155                                                 03902000
TCBRV154 EQU   TCBRV146                                                 03903000
TCBRV153 EQU   TCBRV146                                                 03904000
TCBRV152 EQU   TCBRV146                                                 03905000
TCBRV151 EQU   TCBRV146                                                 03906000
TCBRV150 EQU   TCBRV146                                                 03907000
TCBRV149 EQU   TCBRV146                                                 03908000
TCBRV148 EQU   TCBRV146                                                 03909000
TCBRV147 EQU   TCBRV146                                                 03910000
TCBRV145 EQU   TCBXTNT2+26                                              03911000
TCBRV144 EQU   TCBXTNT2+24                                              03912000
TCBCAUF  EQU   TCBXTNT2+20                                              03913000
TCBRV142 EQU   TCBXTNT2+16                                              03914000
TCBRSV49 EQU   TCBXTNT2+12                                              03915000
TCBEVENT EQU   TCBXTNT2+8                                               03916000
TCBRCMP  EQU   TCBXTNT2+5                                               03917000
TCBRSVAB EQU   TCBXTNT2+4                                               03918000
TCBGTFA  EQU   TCBGTF+1                                                 03919000
TCBRSV47 EQU   TCBTFLG                                                  03920000
TCBRSV46 EQU   TCBTFLG                                                  03921000
TCBRSV45 EQU   TCBTFLG                                                  03922000
TCBRSV44 EQU   TCBTFLG                                                  03923000
TCBRSV43 EQU   TCBTFLG                                                  03924000
TCBDSPIT EQU   TCBTFLG                                                  03925000
TCBERRTN EQU   TCBTFLG                                                  03926000
TCBASYNC EQU   TCBTFLG                                                  03927000
@NM00047 EQU   TCB+296                                                  03928000
TCBSVCA2 EQU   TCB+292                                                  03929000
TCBSWASA EQU   TCB+288                                                  03930000
TCBDBTB  EQU   TCB+284                                                  03931000
TCBRPT   EQU   TCB+280                                                  03932000
TCBRV141 EQU   TCBRV133                                                 03933000
TCBRV140 EQU   TCBRV133                                                 03934000
TCBRV139 EQU   TCBRV133                                                 03935000
TCBRV138 EQU   TCBRV133                                                 03936000
TCBRV137 EQU   TCBRV133                                                 03937000
TCBRV136 EQU   TCBRV133                                                 03938000
TCBRV135 EQU   TCBRV133                                                 03939000
TCBRV134 EQU   TCBRV133                                                 03940000
TCBRV132 EQU   TCBRV124                                                 03941000
TCBRV131 EQU   TCBRV124                                                 03942000
TCBRV130 EQU   TCBRV124                                                 03943000
TCBRV129 EQU   TCBRV124                                                 03944000
TCBRV128 EQU   TCBRV124                                                 03945000
TCBRV127 EQU   TCBRV124                                                 03946000
TCBRV126 EQU   TCBRV124                                                 03947000
TCBRV125 EQU   TCBRV124                                                 03948000
TCBRV123 EQU   TCBFBYT2                                                 03949000
TCBRV122 EQU   TCBFBYT2                                                 03950000
TCBECBNV EQU   TCBFBYT2                                                 03951000
TCBSSSYN EQU   TCBFBYT2                                                 03952000
TCBFPRAP EQU   TCBFBYT2                                                 03953000
TCBFDW   EQU   TCBFBYT2                                                 03954000
TCBFMW   EQU   TCBFBYT2                                                 03955000
TCBCNCB  EQU   TCBFBYT2                                                 03956000
TCBLLH   EQU   TCBFBYT1                                                 03957000
TCBRV113 EQU   TCBFBYT1                                                 03958000
TCBEOT   EQU   TCBFBYT1                                                 03959000
TCBRTM2  EQU   TCBFBYT1                                                 03960000
TCBPGNLY EQU   TCBFBYT1                                                 03961000
TCBNDIOS EQU   TCBFBYT1                                                 03962000
TCBRV327 EQU   TCBFBYT1                                                 03963000
TCBEOTFM EQU   TCBFBYT1                                                 03964000
TCBRV326 EQU   TCB+272                                                  03965000
TCBUKYSP EQU   TCB+268                                                  03966000
TCBMODE  EQU   TCBESTAE+3                                               03967000
TCBERTYP EQU   TCBESTAE+2                                               03968000
TCBRV314 EQU   TCBESTRM                                                 03969000
TCBRV313 EQU   TCBESTRM                                                 03970000
TCBRV312 EQU   TCBESTRM                                                 03971000
TCBRV311 EQU   TCBESTRM                                                 03972000
TCBRV310 EQU   TCBESTRM                                                 03973000
TCBRV309 EQU   TCBESTRM                                                 03974000
TCBSTAFX EQU   TCBESTRM                                                 03975000
TCBETERM EQU   TCBESTRM                                                 03976000
TCBSCBKY EQU   TCBESTAE                                                 03977000
TCBRTM12 EQU   TCB+260                                                  03978000
TCBTCBID EQU   TCB+256                                                  03979000
TCBSTAWA EQU   TCB+252                                                  03980000
TCBSWA   EQU   TCB+248                                                  03981000
TCBFOEA  EQU   TCBFOE+1                                                 03982000
TCBRSV42 EQU   TCBFOE                                                   03983000
TCBCCPVI EQU   TCBXSCT+2                                                03984000
TCBRV325 EQU   TCBXSCT+1                                                03985000
TCBRV324 EQU   TCBXSCT1                                                 03986000
TCBRV323 EQU   TCBXSCT1                                                 03987000
TCBRV322 EQU   TCBXSCT1                                                 03988000
TCBRV321 EQU   TCBXSCT1                                                 03989000
TCBRV320 EQU   TCBXSCT1                                                 03990000
TCBRV319 EQU   TCBXSCT1                                                 03991000
TCBS3A   EQU   TCBXSCT1                                                 03992000
TCBACTIV EQU   TCBXSCT1                                                 03993000
TCBRSV41 EQU   TCB+239                                                  03994000
TCBTID   EQU   TCB+238                                                  03995000
TCBRSVAA EQU   TCB+237                                                  03996000
TCBABCUR EQU   TCB+236                                                  03997000
TCBTMSAV EQU   TCB+232                                                  03998000
TCBIOTIM EQU   TCB+228                                                  03999000
TCBRTWA  EQU   TCB+224                                                  04000000
TCBBACK  EQU   TCB+220                                                  04001000
TCBTIRB  EQU   TCB+216                                                  04002000
TCBAECB  EQU   TCB+212                                                  04003000
TCBEXT2A EQU   TCBEXT2+1                                                04004000
TCBRSV39 EQU   TCBEXT2                                                  04005000
TCBSTMCT EQU   TCB+207                                                  04006000
TCBSYSCT EQU   TCB+206                                                  04007000
TCBRSV37 EQU   TCB+205                                                  04008000
TCBEXSVC EQU   TCBDAR                                                   04009000
TCBDARMS EQU   TCBDAR                                                   04010000
TCBDARWT EQU   TCBDAR                                                   04011000
TCBDARO  EQU   TCBDAR                                                   04012000
TCBDARMC EQU   TCBDARC                                                  04013000
TCBDARD  EQU   TCBDAR                                                   04014000
TCBDARS  EQU   TCBDAR                                                   04015000
TCBDARP  EQU   TCBDAR                                                   04016000
TCBGTOFM EQU   TCBFLGS7                                                 04017000
TCBADMP  EQU   TCBFLGS7                                                 04018000
TCBRSTSK EQU   TCBFLGS7                                                 04019000
TCBSVCS  EQU   TCBFLGS7                                                 04020000
TCBSTACK EQU   TCBFLGS7                                                 04021000
TCBRSV34 EQU   TCBFLGS7                                                 04022000
TCBRSV33 EQU   TCBFLGS7                                                 04023000
TCBGPECB EQU   TCBFLGS7                                                 04024000
TCBNTJS  EQU   TCBFLGS6                                                 04025000
TCBAPG   EQU   TCBFLGS6                                                 04026000
TCBMIGR  EQU   TCBFLGS6                                                 04027000
TCBRV303 EQU   TCBFLGS6                                                 04028000
TCBSPVLK EQU   TCBFLGS6                                                 04029000
TCBCPU   EQU   TCBFLGS6                                                 04030000
TCBPIE17 EQU   TCBFLGS6                                                 04031000
TCBRV    EQU   TCBFLGS6                                                 04032000
TCBRSV79 EQU   TCBNDSP5                                                 04033000
TCBRSV78 EQU   TCBNDSP5                                                 04034000
TCBRSV77 EQU   TCBNDSP5                                                 04035000
TCBRSV76 EQU   TCBNDSP5                                                 04036000
TCBRSV75 EQU   TCBNDSP5                                                 04037000
TCBRSV74 EQU   TCBNDSP5                                                 04038000
TCBRSV95 EQU   TCBNDSP5                                                 04039000
TCBRSV94 EQU   TCBNDSP5                                                 04040000
TCBRSV93 EQU   TCBNDSP4                                                 04041000
TCBRSV92 EQU   TCBNDSP4                                                 04042000
TCBRSV91 EQU   TCBNDSP4                                                 04043000
TCBRSV90 EQU   TCBNDSP4                                                 04044000
TCBRSV89 EQU   TCBNDSP4                                                 04045000
TCBRSV88 EQU   TCBNDSP4                                                 04046000
TCBRSV87 EQU   TCBNDSP4                                                 04047000
TCBRSV86 EQU   TCBNDSP4                                                 04048000
TCBEXT1A EQU   TCBEXT1+1                                                04049000
TCBRSV32 EQU   TCBEXT1                                                  04050000
TCBEXCPD EQU   TCB+192                                                  04051000
TCBIOBRC EQU   TCB+188                                                  04052000
TCBDDWTC EQU   TCB+186                                                  04053000
TCBDDEXC EQU   TCB+184                                                  04054000
TCBJSCBB EQU   TCBJSCB+1                                                04055000
@NM00046 EQU   TCBRECDE                                                 04056000
TCBREC   EQU   TCBRECDE                                                 04057000
TCBMDIDS EQU   TCB+176                                                  04058000
TCBNDINT EQU   TCBNDSP3                                                 04059000
TCBRSV27 EQU   TCBNDSP3                                                 04060000
TCBRSV26 EQU   TCBNDSP3                                                 04061000
TCBRSV25 EQU   TCBNDSP3                                                 04062000
TCBSLPER EQU   TCBNDSP3                                                 04063000
TCBSRBND EQU   TCBNDSP3                                                 04064000
TCBRV302 EQU   TCBNDSP3                                                 04065000
TCBLJSND EQU   TCBNDSP3                                                 04066000
TCBABE   EQU   TCBNDSP2                                                 04067000
TCBDSS   EQU   TCBNDSP2                                                 04068000
TCBOWAIT EQU   TCBNDSP2                                                 04069000
TCBIWAIT EQU   TCBNDSP2                                                 04070000
TCBNDTS  EQU   TCBNDSP2                                                 04071000
TCBNDSVC EQU   TCBNDSP2                                                 04072000
TCBSTPP  EQU   TCBNDSP2                                                 04073000
TCBABD   EQU   TCBNDSP2                                                 04074000
TCBRSV22 EQU   TCBNDSP1                                                 04075000
TCBPIEND EQU   TCBNDSP1                                                 04076000
TCBTPSP  EQU   TCBNDSP1                                                 04077000
TCBDDRND EQU   TCBNDSP1                                                 04078000
TCBRSPND EQU   TCBNDSP1                                                 04079000
TCBRSTND EQU   TCBNDSP1                                                 04080000
TCBDARPN EQU   TCBNDSP1                                                 04081000
TCBDARTN EQU   TCBNDSP1                                                 04082000
TCBNDSP0 EQU   TCBNDSP                                                  04083000
TCBUSER  EQU   TCB+168                                                  04084000
TCBTCTB  EQU   TCBTCT+1                                                 04085000
TCBRSV9C EQU   TCBTCTGF                                                 04086000
TCBRSV9B EQU   TCBTCTGF                                                 04087000
TCBRSV9A EQU   TCBTCTGF                                                 04088000
TCBRSV99 EQU   TCBTCTGF                                                 04089000
TCBRSV98 EQU   TCBTCTGF                                                 04090000
TCBRSV97 EQU   TCBTCTGF                                                 04091000
TCBRSV20 EQU   TCBTCTGF                                                 04092000
TCBSMFGF EQU   TCBTCTGF                                                 04093000
TCBSTABB EQU   TCBSTAB+1                                                04094000
TCBSTCUR EQU   TCBNSTAE                                                 04095000
TCBRV301 EQU   TCBNSTAE                                                 04096000
TCBSYNCH EQU   TCBNSTAE                                                 04097000
TCBHALT  EQU   TCBNSTAE                                                 04098000
TCBPPSUP EQU   TCBNSTAE                                                 04099000
TCB33E   EQU   TCBNSTAE                                                 04100000
TCBQUIES EQU   TCBNSTAE                                                 04101000
TCBSTABE EQU   TCBNSTAE                                                 04102000
TCBAQE   EQU   TCB+156                                                  04103000
TCBPQE   EQU   TCB+152                                                  04104000
TCBTSDP  EQU   TCB+151                                                  04105000
TCBTSLP  EQU   TCB+150                                                  04106000
TCBSTPCT EQU   TCB+149                                                  04107000
TCBCPUBN EQU   TCBTSFLG                                                 04108000
TCBDYDSP EQU   TCBTSFLG                                                 04109000
TCBRSV18 EQU   TCBTSFLG                                                 04110000
TCBRSV17 EQU   TCBTSFLG                                                 04111000
TCBTIOTG EQU   TCBTSFLG                                                 04112000
TCBATT   EQU   TCBTSFLG                                                 04113000
TCBSTPPR EQU   TCBTSFLG                                                 04114000
TCBRV300 EQU   TCBTSTSK                                                 04115000
TCBECB   EQU   TCB+144                                                  04116000
TCBIQE   EQU   TCB+140                                                  04117000
TCBLTC   EQU   TCB+136                                                  04118000
TCBOTC   EQU   TCB+132                                                  04119000
TCBNTC   EQU   TCB+128                                                  04120000
TCBJSTCA EQU   TCBJSTCB+1                                               04121000
TCBRSV16 EQU   TCBJSTCB                                                 04122000
TCBTQET  EQU   TCBTME                                                   04123000
TCBTCB   EQU   TCB+116                                                  04124000
TCBFSAB  EQU   TCBFSA+1                                                 04125000
TCBQEL   EQU   TCBFSA                                                   04126000
TCBGRS15 EQU   TCBGRS+60                                                04127000
TCBGRS14 EQU   TCBGRS+56                                                04128000
TCBGRS13 EQU   TCBGRS+52                                                04129000
TCBGRS12 EQU   TCBGRS+48                                                04130000
TCBGRS11 EQU   TCBGRS+44                                                04131000
TCBGRS10 EQU   TCBGRS+40                                                04132000
TCBGRS9  EQU   TCBGRS+36                                                04133000
TCBGRS8  EQU   TCBGRS+32                                                04134000
TCBGRS7  EQU   TCBGRS+28                                                04135000
TCBGRS6  EQU   TCBGRS+24                                                04136000
TCBGRS5  EQU   TCBGRS+20                                                04137000
TCBGRS4  EQU   TCBGRS+16                                                04138000
TCBGRS3  EQU   TCBGRS+12                                                04139000
TCBGRS2  EQU   TCBGRS+8                                                 04140000
TCBGRS1  EQU   TCBGRS+4                                                 04141000
TCBGRS0  EQU   TCBGRS                                                   04142000
TCBJPQB  EQU   TCBJPQ+1                                                 04143000
TCBRSV15 EQU   TCBPURGE                                                 04144000
TCBRSV14 EQU   TCBPURGE                                                 04145000
TCBRSV13 EQU   TCBPURGE                                                 04146000
TCBRSV12 EQU   TCBPURGE                                                 04147000
TCBRSV11 EQU   TCBPURGE                                                 04148000
TCBRSV10 EQU   TCBPURGE                                                 04149000
TCBRSV09 EQU   TCBPURGE                                                 04150000
TCBJPQF  EQU   TCBPURGE                                                 04151000
TCBJLB   EQU   TCB+40                                                   04152000
TCBLLS   EQU   TCB+36                                                   04153000
TCBDSP   EQU   TCB+35                                                   04154000
TCBLMP   EQU   TCB+34                                                   04155000
TCBPNDSP EQU   TCBFLGS5                                                 04156000
TCBFCD1  EQU   TCBFLGS5                                                 04157000
TCBSTP   EQU   TCBFLGS5                                                 04158000
TCBSYS   EQU   TCBFLGS5                                                 04159000
TCBANDSP EQU   TCBFLGS5                                                 04160000
TCBPAGE  EQU   TCBFLGS5                                                 04161000
TCBUXNDF EQU   TCBABWF                                                  04162000
TCBFC    EQU   TCBFLGS5                                                 04163000
TCBONDSP EQU   TCBFLGS4                                                 04164000
TCBMPCND EQU   TCBFLGS4                                                 04165000
TCBMPCVQ EQU   TCBFLGS4                                                 04166000
TCBUXNDV EQU   TCBFLGS4                                                 04167000
TCBHNDSP EQU   TCBFLGS4                                                 04168000
TCBRQENA EQU   TCBFLGS4                                                 04169000
TCBSER   EQU   TCBFLGS4                                                 04170000
TCBNDUMP EQU   TCBFLGS4                                                 04171000
TCBDWSTA EQU   TCBFLGS3                                                 04172000
TCBRSV08 EQU   TCBFLGS3                                                 04173000
TCBRSV07 EQU   TCBFLGS3                                                 04174000
TCBRSV06 EQU   TCBFLGS3                                                 04175000
TCBABGM  EQU   TCBFLGS3                                                 04176000
TCBABTRM EQU   TCBFLGS3                                                 04177000
TCBADINP EQU   TCBFLGS3                                                 04178000
TCBFSM   EQU   TCBFLGS3                                                 04179000
TCBFTS   EQU   TCBFLGS2                                                 04180000
TCBFETXR EQU   TCBFLGS2                                                 04181000
TCBFDSOP EQU   TCBFLGS2                                                 04182000
TCBFJMC  EQU   TCBFLGS2                                                 04183000
TCBFSMC  EQU   TCBFLGS2                                                 04184000
TCBFABOP EQU   TCBFLGS2                                                 04185000
TCBFSTI  EQU   TCBFLGS2                                                 04186000
TCBFOINP EQU   TCBFLGS2                                                 04187000
TCBFX    EQU   TCBFLGS1                                                 04188000
TCBFS    EQU   TCBFLGS1                                                 04189000
TCBFT    EQU   TCBFLGS1                                                 04190000
TCBPDUMP EQU   TCBFLGS1                                                 04191000
TCBNONPR EQU   TCBFLGS1                                                 04192000
TCBFERA  EQU   TCBFLGS1                                                 04193000
TCBFE    EQU   TCBFLGS1                                                 04194000
TCBFA    EQU   TCBFLGS1                                                 04195000
TCBZERO  EQU   TCBPKF                                                   04196000
TCBFLAG  EQU   TCBPKF                                                   04197000
TCBMSSB  EQU   TCBMSS+1                                                 04198000
TCBRSV03 EQU   TCBMSS                                                   04199000
TCBTRNB  EQU   TCBTRN+1                                                 04200000
TCBRSV02 EQU   TCBABF                                                   04201000
TCBOLTEP EQU   TCBABF                                                   04202000
TCBTCP   EQU   TCBABF                                                   04203000
TCBTCPP  EQU   TCBABF                                                   04204000
TCBRSV01 EQU   TCBABF                                                   04205000
TCBGRPH  EQU   TCBABF                                                   04206000
TCBNOCHK EQU   TCBABF                                                   04207000
TCBMOD91 EQU   TCBABF                                                   04208000
TCBCMPC  EQU   TCBCMP+1                                                 04209000
TCBRV318 EQU   TCBCMSG                                                  04210000
TCBRV317 EQU   TCBCIND                                                  04211000
TCBRV316 EQU   TCBCWTO                                                  04212000
TCBCASID EQU   TCBCDBL                                                  04213000
TCBNOCC  EQU   TCBSTCC                                                  04214000
TCBDMPO  EQU   TCBCPP                                                   04215000
TCBCSTEP EQU   TCBCMPF                                                  04216000
TCBCREQ  EQU   TCBCMPF                                                  04217000
TCBTIO   EQU   TCB+12                                                   04218000
TCBDEB   EQU   TCB+8                                                    04219000
TCBPIEA  EQU   TCBPIE+1                                                 04220000
TCBPM    EQU   TCBPMASK                                                 04221000
@NM00045 EQU   TCBPMASK                                                 04222000
TCBRBP   EQU   TCB                                                      04223000
TCBFRS6  EQU   TCBFRS+24                                                04224000
TCBFRS4  EQU   TCBFRS+16                                                04225000
TCBFRS2  EQU   TCBFRS+8                                                 04226000
TCBFRS0  EQU   TCBFRS                                                   04227000
ICBLORD  EQU   ICBTRACE+256                                             04228000
ICBOTRC  EQU   ICBTRACE                                                 04229000
ICBRESV  EQU   ICB2SSCB+128                                             04230000
ICBVOLST EQU   ICB2SSCB+124                                             04231000
ICBVSCRA EQU   ICB2SSCB+120                                             04232000
ICBSAMP  EQU   ICB2SSCB+118                                             04233000
ICBRESVD EQU   ICB2SSCB+117                                             04234000
ICBCPUID EQU   ICB2SSCB+112                                             04235000
ICBFAB   EQU   ICB2SSCB+108                                             04236000
ICBMSSC  EQU   ICB2SSCB+104                                             04237000
ICBRSVP  EQU   ICB2SSCB+100                                             04238000
ICBAEAP  EQU   ICB2SSCB+96                                              04239000
ICBSIOBP EQU   ICB2SSCB+92                                              04240000
ICBIATNA EQU   ICB2SSCB+88                                              04241000
ICBIPRGA EQU   ICB2SSCB+84                                              04242000
ICBSRBP  EQU   ICB2SSCB+80                                              04243000
ICBVVICB EQU   ICB2SSCB+76                                              04244000
ICBVVIC  EQU   ICB2SSCB+72                                              04245000
ICBSIOP  EQU   ICB2SSCB+68                                              04246000
ICBMEP   EQU   ICB2SSCB+64                                              04247000
ICBIORCI EQU   ICB2SSCB+60                                              04248000
ICB2ACTP EQU   ICB2SSCB+56                                              04249000
ICBFG3   EQU   ICBFLG+2                                                 04250000
ICBFG2   EQU   ICBFLG+1                                                 04251000
@NM00044 EQU   ICBFG1                                                   04252000
ICBMSCA  EQU   ICBFG1                                                   04253000
ICBMSCMP EQU   ICBFG1                                                   04254000
ICBS     EQU   ICBFG1                                                   04255000
ICBB     EQU   ICBFG1                                                   04256000
ICBV     EQU   ICBFG1                                                   04257000
ICBR     EQU   ICBFG1                                                   04258000
ICBNVT   EQU   ICBOPT                                                   04259000
ICBVN02P EQU   ICB2SSCB+44                                              04260000
ICBTCB   EQU   ICB2SSCB+40                                              04261000
ICBQHEAD EQU   ICB2SSCB+36                                              04262000
ICBAUCB  EQU   ICB2SSCB+32                                              04263000
ICBCOMQ  EQU   ICB2SSCB+24                                              04264000
ICBIOR   EQU   ICB2SSCB+20                                              04265000
ICBCOM   EQU   ICB2SSCB+16                                              04266000
ICBACTV  EQU   ICB2SSCB+12                                              04267000
ICBECB   EQU   ICB2SSCB+8                                               04268000
ICBSSNAM EQU   ICB2SSCB                                                 04269000
CVTLEVL  EQU   CVTRELNO+2                                               04270000
CVTNUMB  EQU   CVTRELNO                                                 04271000
CVTMDL   EQU   CVTFIX+250                                               04272000
@NM00043 EQU   CVTFIX+248                                               04273000
@NM00042 EQU   CVTFIX                                                   04274000
CVTRV482 EQU   CVTXTNT2+128                                             04275000
CVTRV481 EQU   CVTXTNT2+124                                             04276000
CVTRV480 EQU   CVTXTNT2+120                                             04277000
CVTRV479 EQU   CVTXTNT2+118                                             04278000
CVTRV478 EQU   CVTXTNT2+117                                             04279000
CVTRV477 EQU   CVTXTNT2+116                                             04280000
CVTRV476 EQU   CVTXTNT2+115                                             04281000
CVTRV475 EQU   CVTXTNT2+114                                             04282000
CVTRV474 EQU   CVTRV466                                                 04283000
CVTRV473 EQU   CVTRV466                                                 04284000
CVTRV472 EQU   CVTRV466                                                 04285000
CVTRV471 EQU   CVTRV466                                                 04286000
CVTRV470 EQU   CVTRV466                                                 04287000
CVTRV469 EQU   CVTRV466                                                 04288000
CVTRV468 EQU   CVTRV466                                                 04289000
CVTRV467 EQU   CVTRV466                                                 04290000
CVTRV465 EQU   CVTRV457                                                 04291000
CVTRV464 EQU   CVTRV457                                                 04292000
CVTRV463 EQU   CVTRV457                                                 04293000
CVTRV462 EQU   CVTRV457                                                 04294000
CVTRV461 EQU   CVTRV457                                                 04295000
CVTRV460 EQU   CVTRV457                                                 04296000
CVTRV459 EQU   CVTRV457                                                 04297000
CVTRV458 EQU   CVTRV457                                                 04298000
CVTRV456 EQU   CVTXTNT2+108                                             04299000
CVTRV455 EQU   CVTXTNT2+104                                             04300000
CVTRV454 EQU   CVTXTNT2+100                                             04301000
CVTRV453 EQU   CVTXTNT2+96                                              04302000
CVTRV452 EQU   CVTXTNT2+94                                              04303000
CVTRV451 EQU   CVTXTNT2+92                                              04304000
CVTRV450 EQU   CVTXTNT2+90                                              04305000
CVTRV449 EQU   CVTXTNT2+88                                              04306000
CVTRV448 EQU   CVTXTNT2+87                                              04307000
CVTRV447 EQU   CVTXTNT2+86                                              04308000
CVTRV446 EQU   CVTRV438                                                 04309000
CVTRV445 EQU   CVTRV438                                                 04310000
CVTRV444 EQU   CVTRV438                                                 04311000
CVTRV443 EQU   CVTRV438                                                 04312000
CVTRV442 EQU   CVTRV438                                                 04313000
CVTRV441 EQU   CVTRV438                                                 04314000
CVTRV440 EQU   CVTRV438                                                 04315000
CVTRV439 EQU   CVTRV438                                                 04316000
CVTRV437 EQU   CVTRV429                                                 04317000
CVTRV436 EQU   CVTRV429                                                 04318000
CVTRV435 EQU   CVTRV429                                                 04319000
CVTRV434 EQU   CVTRV429                                                 04320000
CVTRV433 EQU   CVTRV429                                                 04321000
CVTRV432 EQU   CVTRV429                                                 04322000
CVTRV431 EQU   CVTRV429                                                 04323000
CVTRV430 EQU   CVTRV429                                                 04324000
CVTRV428 EQU   CVTXTNT2+80                                              04325000
CVTRV427 EQU   CVTXTNT2+76                                              04326000
CVTRV426 EQU   CVTXTNT2+72                                              04327000
CVTRV425 EQU   CVTXTNT2+68                                              04328000
CVTATACT EQU   CVTATCVT                                                 04329000
CVTRV423 EQU   CVTXTNT2+62                                              04330000
CVTRV422 EQU   CVTXTNT2+60                                              04331000
CVTRV421 EQU   CVTXTNT2+58                                              04332000
CVTRV420 EQU   CVTXTNT2+56                                              04333000
CVTRV419 EQU   CVTXTNT2+55                                              04334000
CVTRV418 EQU   CVTXTNT2+54                                              04335000
CVTRV417 EQU   CVTRV409                                                 04336000
CVTRV416 EQU   CVTRV409                                                 04337000
CVTRV415 EQU   CVTRV409                                                 04338000
CVTRV414 EQU   CVTRV409                                                 04339000
CVTRV413 EQU   CVTRV409                                                 04340000
CVTRV412 EQU   CVTRV409                                                 04341000
CVTRV411 EQU   CVTRV409                                                 04342000
CVTRV410 EQU   CVTRV409                                                 04343000
CVTRV408 EQU   CVTRV400                                                 04344000
CVTRV407 EQU   CVTRV400                                                 04345000
CVTRV406 EQU   CVTRV400                                                 04346000
CVTRV405 EQU   CVTRV400                                                 04347000
CVTRV404 EQU   CVTRV400                                                 04348000
CVTRV403 EQU   CVTRV400                                                 04349000
CVTRV402 EQU   CVTRV400                                                 04350000
CVTRV401 EQU   CVTRV400                                                 04351000
CVTSKTA  EQU   CVTXTNT2+44                                              04352000
CVTCCVT  EQU   CVTXTNT2+40                                              04353000
CVTRSV98 EQU   CVTXTNT2+36                                              04354000
CVTRSV97 EQU   CVTXTNT2+34                                              04355000
CVTRSV96 EQU   CVTXTNT2+32                                              04356000
CVTOLTEP EQU   CVTXTNT2+28                                              04357000
CVTQIDA  EQU   CVTQID+1                                                 04358000
CVTRSV95 EQU   CVTQID                                                   04359000
CVTRSV94 EQU   CVTXTNT2+20                                              04360000
CVTRSV93 EQU   CVTXTNT2+16                                              04361000
CVTRSV92 EQU   CVTXTNT2+12                                              04362000
CVTDEBVR EQU   CVTXTNT2+8                                               04363000
CVTRSV91 EQU   CVTXTNT2+6                                               04364000
CVTRSV9H EQU   CVTFLGBT                                                 04365000
CVTRSV9G EQU   CVTFLGBT                                                 04366000
CVTRSV9F EQU   CVTFLGBT                                                 04367000
CVTRSV9E EQU   CVTFLGBT                                                 04368000
CVTRSV9D EQU   CVTFLGBT                                                 04369000
CVTBAH   EQU   CVTFLGBT                                                 04370000
CVTVME   EQU   CVTFLGBT                                                 04371000
CVTNPE   EQU   CVTFLGBT                                                 04372000
CVTNUCLS EQU   CVTXTNT2+4                                               04373000
CVTDSSVA EQU   CVTDSSV+1                                                04374000
CVTRSV89 EQU   CVTDSSV                                                  04375000
CVTRSV88 EQU   CVTXTNT1+8                                               04376000
CVTRSV87 EQU   CVTXTNT1+4                                               04377000
CVTFACHN EQU   CVTXTNT1                                                 04378000
CVTRV488 EQU   CVTMAP+412                                               04379000
CVTRV487 EQU   CVTMAP+408                                               04380000
CVTRV486 EQU   CVTMAP+404                                               04381000
CVTRV485 EQU   CVTMAP+400                                               04382000
CVTACTAP EQU   CVTMAP+396                                               04383000
CVTAUTH  EQU   CVTMAP+392                                               04384000
CVTRV490 EQU   CVTMAP+388                                               04385000
CVTSU    EQU   CVTMAP+384                                               04386000
CVTVOLT1 EQU   CVTVOLM1+1                                               04387000
CVTVOLI1 EQU   CVTVOLF1                                                 04388000
CVTSTOA  EQU   CVTMAP+376                                               04389000
CVTRSV58 EQU   CVTMAP+374                                               04390000
CVTRSV57 EQU   CVTMAP+372                                               04391000
CVTDDCE  EQU   CVTMAP+368                                               04392000
CVTPNWFR EQU   CVTMAP+364                                               04393000
CVTSMF   EQU   CVTMAP+360                                               04394000
CVTSULK  EQU   CVTMAP+358                                               04395000
CVTSLKO  EQU   CVTSYSK                                                  04396000
CVTSLKP  EQU   CVTSYSK                                                  04397000
CVTSLKQ  EQU   CVTSYSK                                                  04398000
CVTSLKR  EQU   CVTSYSK                                                  04399000
CVTRSV56 EQU   CVTSYSK                                                  04400000
CVTRSV55 EQU   CVTSYSK                                                  04401000
CVTRSV54 EQU   CVTSYSK                                                  04402000
CVTRSV53 EQU   CVTSYSK                                                  04403000
CVTRSV52 EQU   CVTA1F1                                                  04404000
CVTRSV51 EQU   CVTA1F1                                                  04405000
CVTRSV50 EQU   CVTA1F1                                                  04406000
CVTRSV49 EQU   CVTA1F1                                                  04407000
CVTRSV48 EQU   CVTA1F1                                                  04408000
CVTRSV47 EQU   CVTA1F1                                                  04409000
CVTSRSW  EQU   CVTA1F1                                                  04410000
CVTPFSW  EQU   CVTA1F1                                                  04411000
CVTPCVT  EQU   CVTMAP+352                                               04412000
CVTRSV46 EQU   CVTMAP+344                                               04413000
CVTRSV45 EQU   CVTMAP+340                                               04414000
CVTRSV44 EQU   CVTMAP+338                                               04415000
CVTRSV43 EQU   CVTMAP+336                                               04416000
CVTHJESA EQU   CVTHJES+1                                                04417000
CVTRSV42 EQU   CVTHJES                                                  04418000
CVTEXT2A EQU   CVTEXT2+1                                                04419000
CVTRSV41 EQU   CVTEXT2                                                  04420000
CVTAPFA  EQU   CVTAPF+1                                                 04421000
CVTRSV40 EQU   CVTAPF                                                   04422000
CVTRV518 EQU   CVTINTLA                                                 04423000
CVTRV517 EQU   CVTERPV                                                  04424000
CVTEORM  EQU   CVTMAP+312                                               04425000
CVTMCHPR EQU   CVTMAP+308                                               04426000
CVTTZ    EQU   CVTMAP+304                                               04427000
CVTJEPS  EQU   CVTMAP+300                                               04428000
CVTJESCT EQU   CVTMAP+296                                               04429000
CVTMODE  EQU   CVTMAP+292                                               04430000
CVTPTRV  EQU   CVTMAP+288                                               04431000
CVTREAL  EQU   CVTMAP+284                                               04432000
CVTRSV39 EQU   CVTMAP+280                                               04433000
CVTRSV38 EQU   CVTMAP+276                                               04434000
CVTDMSRA EQU   CVTDMSR+1                                                04435000
CVTRV634 EQU   CVTDMSRF                                                 04436000
CVTRV633 EQU   CVTDMSRF                                                 04437000
CVTRV632 EQU   CVTDMSRF                                                 04438000
CVTRV631 EQU   CVTDMSRF                                                 04439000
CVTRV630 EQU   CVTDMSRF                                                 04440000
CVTRV629 EQU   CVTDMSRF                                                 04441000
CVTUDUMP EQU   CVTDMSRF                                                 04442000
CVTSDUMP EQU   CVTDMSRF                                                 04443000
CVTQMSGA EQU   CVTQMSG+1                                                04444000
CVTRSV36 EQU   CVTQMSG                                                  04445000
CVTAMFF  EQU   CVTMAP+264                                               04446000
CVTPURGA EQU   CVTPURG+1                                                04447000
CVTRSV35 EQU   CVTPURG                                                  04448000
CVTCBSP  EQU   CVTMAP+256                                               04449000
CVTATERA EQU   CVTATER+1                                                04450000
CVTSYST  EQU   CVTATER                                                  04451000
CVTVOLT2 EQU   CVTTAT                                                   04452000
CVTVOLI2 EQU   CVTVOLF2                                                 04453000
CVTAQAVB EQU   CVTAQAVT+1                                               04454000
CVTRSV34 EQU   CVTTCMFG                                                 04455000
CVTRSV33 EQU   CVTTCMFG                                                 04456000
CVTRSV32 EQU   CVTTCMFG                                                 04457000
CVTRSV31 EQU   CVTTCMFG                                                 04458000
CVTRSV30 EQU   CVTTCMFG                                                 04459000
CVTRSV29 EQU   CVTTCMFG                                                 04460000
CVTLDEV  EQU   CVTTCMFG                                                 04461000
CVTTCRDY EQU   CVTTCMFG                                                 04462000
CVTGTFA  EQU   CVTGTF+1                                                 04463000
CVTRSV27 EQU   CVTGTFST                                                 04464000
CVTRNIO  EQU   CVTGTFST                                                 04465000
CVTUSR   EQU   CVTGTFST                                                 04466000
CVTRV318 EQU   CVTFORM                                                  04467000
CVTRV317 EQU   CVTTMODE                                                 04468000
CVTRV316 EQU   CVTSTATE                                                 04469000
CVTRV315 EQU   CVTGTFS                                                  04470000
CVTGTFAV EQU   CVTGTFS                                                  04471000
CVT0SCR1 EQU   CVTMAP+232                                               04472000
CVTRV515 EQU   CVTMAP+228                                               04473000
CVTRMS   EQU   CVTMAP+224                                               04474000
CVTPATCH EQU   CVTMAP+220                                               04475000
CVTTSCE  EQU   CVTMAP+216                                               04476000
CVTLNKSC EQU   CVTMAP+214                                               04477000
CVTQABST EQU   CVTMAP+212                                               04478000
CVTMDLDS EQU   CVTMAP+208                                               04479000
CVTUSER  EQU   CVTMAP+204                                               04480000
CVTABEND EQU   CVTMAP+200                                               04481000
CVTSMCA  EQU   CVTMAP+196                                               04482000
CVTRSV18 EQU   CVTMAP+192                                               04483000
CVTQLPAQ EQU   CVTMAP+188                                               04484000
CVTQCDSR EQU   CVTMAP+184                                               04485000
CVTVS1B  EQU   CVTOPTB                                                  04486000
CVTVS1A  EQU   CVTOPTB                                                  04487000
CVTFP    EQU   CVTOPTB                                                  04488000
CVTAPTHR EQU   CVTOPTB                                                  04489000
CVTNLOG  EQU   CVTOPTB                                                  04490000
CVTTOD   EQU   CVTOPTB                                                  04491000
CVTCTIMS EQU   CVTOPTB                                                  04492000
CVTPROT  EQU   CVTOPTB                                                  04493000
CVTXPFP  EQU   CVTOPTA                                                  04494000
CVTASCII EQU   CVTOPTA                                                  04495000
CVTRSV13 EQU   CVTOPTA                                                  04496000
CVTRSV12 EQU   CVTOPTA                                                  04497000
CVTNIP   EQU   CVTOPTA                                                  04498000
CVTDDR   EQU   CVTOPTA                                                  04499000
CVTAPR   EQU   CVTOPTA                                                  04500000
CVTCCH   EQU   CVTOPTA                                                  04501000
CVTSNCTR EQU   CVTMAP+180                                               04502000
CVTQMWR  EQU   CVTMAP+176                                               04503000
CVTQOCR  EQU   CVTMAP+172                                               04504000
CVT1EF00 EQU   CVTMAP+168                                               04505000
CVTMZ00  EQU   CVTMAP+164                                               04506000
CVTSV76Q EQU   CVTSV76C                                                 04507000
CVTRSV11 EQU   CVTMAP+156                                               04508000
CVT0PT01 EQU   CVTMAP+152                                               04509000
CVTMSER  EQU   CVTMAP+148                                               04510000
CVTRV516 EQU   CVTIERLC                                                 04511000
CVTILCH  EQU   CVTMAP+140                                               04512000
CVT0DS   EQU   CVTMAP+136                                               04513000
CVTFBOSV EQU   CVTMAP+132                                               04514000
CVTNUCB  EQU   CVTMAP+128                                               04515000
CVTIXAVL EQU   CVTMAP+124                                               04516000
CVTSV76M EQU   CVTIOQET                                                 04517000
CVTDCBA  EQU   CVTMAP+117                                               04518000
CVTMVS2  EQU   CVTDCB                                                   04519000
CVT6DAT  EQU   CVTDCB                                                   04520000
CVT4MPS  EQU   CVTDCB                                                   04521000
CVTRSV09 EQU   CVTDCB                                                   04522000
CVT4MS1  EQU   CVTDCB                                                   04523000
CVT2SPS  EQU   CVTDCB                                                   04524000
CVT1SSS  EQU   CVTDCB                                                   04525000
CVTRSV08 EQU   CVTDCB                                                   04526000
CVTSTB   EQU   CVTMAP+112                                               04527000
CVTQTD00 EQU   CVTMAP+108                                               04528000
CVTQTE00 EQU   CVTMAP+104                                               04529000
CVTCUCB  EQU   CVTMAP+100                                               04530000
CVTSJQ   EQU   CVTMAP+96                                                04531000
CVTPBLDL EQU   CVTMAP+92                                                04532000
CVTTPC   EQU   CVTMAP+88                                                04533000
CVTSVDCB EQU   CVTMAP+84                                                04534000
CVTBRET  EQU   CVTMAP+82                                                04535000
CVTEXIT  EQU   CVTMAP+80                                                04536000
CVT0FN00 EQU   CVTMAP+76                                                04537000
CVTDARA  EQU   CVTDAR+1                                                 04538000
CVTRSV07 EQU   CVTFLGS1                                                 04539000
CVTRSV06 EQU   CVTFLGS1                                                 04540000
CVTRSV05 EQU   CVTFLGS1                                                 04541000
CVTRSV04 EQU   CVTFLGS1                                                 04542000
CVTRSV03 EQU   CVTFLGS1                                                 04543000
CVTRSV02 EQU   CVTFLGS1                                                 04544000
CVTRSV01 EQU   CVTFLGS1                                                 04545000
CVTDMPLK EQU   CVTFLGS1                                                 04546000
CVTXITP  EQU   CVTMAP+68                                                04547000
CVTZDTAB EQU   CVTMAP+64                                                04548000
CVTMSLT  EQU   CVTMAP+60                                                04549000
CVTDATE  EQU   CVTMAP+56                                                04550000
CVTBTERM EQU   CVTMAP+52                                                04551000
CVTSYSAD EQU   CVTMAP+48                                                04552000
CVTXTLER EQU   CVTMAP+44                                                04553000
CVTILK2  EQU   CVTMAP+40                                                04554000
CVTILK1  EQU   CVTMAP+36                                                04555000
CVTPRLTV EQU   CVTMAP+32                                                04556000
CVTPCNVT EQU   CVTMAP+28                                                04557000
CVT0VL00 EQU   CVTMAP+24                                                04558000
CVTXAPG  EQU   CVTMAP+20                                                04559000
CVTBUF   EQU   CVTMAP+16                                                04560000
CVTJOB   EQU   CVTMAP+12                                                04561000
CVTLINK  EQU   CVTMAP+8                                                 04562000
CVT0EF00 EQU   CVTMAP+4                                                 04563000
CVTTCBP  EQU   CVTMAP                                                   04564000
CVT      EQU   CVTMAP                                                   04565000
UCBERADR EQU   UCBUCS+12                                                04566000
UCBFCBID EQU   UCBUCS+8                                                 04567000
UCBERCNT EQU   UCBUCS+7                                                 04568000
UCBRSV51 EQU   UCBUCS+6                                                 04569000
UCBFCBPE EQU   UCBFCBOP                                                 04570000
UCBRSV49 EQU   UCBFCBOP                                                 04571000
UCBRSV48 EQU   UCBFCBOP                                                 04572000
UCBRSV47 EQU   UCBFCBOP                                                 04573000
UCBRSV46 EQU   UCBFCBOP                                                 04574000
UCBRSV45 EQU   UCBFCBOP                                                 04575000
UCBRSV44 EQU   UCBFCBOP                                                 04576000
UCBFCBO1 EQU   UCBFCBOP                                                 04577000
UCBUCSPE EQU   UCBUCSOP                                                 04578000
UCBRSV43 EQU   UCBUCSOP                                                 04579000
UCBRSV42 EQU   UCBUCSOP                                                 04580000
UCBRSV41 EQU   UCBUCSOP                                                 04581000
UCBRSV40 EQU   UCBUCSOP                                                 04582000
UCBRSV39 EQU   UCBUCSOP                                                 04583000
UCBUCSO2 EQU   UCBUCSOP                                                 04584000
UCBUCSO1 EQU   UCBUCSOP                                                 04585000
UCBUCSID EQU   UCBUCS                                                   04586000
UCBMDRBA EQU   UCBMDRBF+1                                               04587000
UCBRV075 EQU   UCBMDRBF                                                 04588000
UCBRV074 EQU   UCB3800X+32                                              04589000
UCBIMAGE EQU   UCB3800X+28                                              04590000
UCBFCBNM EQU   UCB3800X+24                                              04591000
UCBCHAR4 EQU   UCB3800X+20                                              04592000
UCBCHAR3 EQU   UCB3800X+16                                              04593000
UCBCHAR2 EQU   UCB3800X+12                                              04594000
UCBCHAR1 EQU   UCB3800X+8                                               04595000
UCBCGMID EQU   UCB3800X+4                                               04596000
UCBBRSTA EQU   UCBACTIV                                                 04597000
UCBRV063 EQU   UCBACTIV                                                 04598000
UCBRV062 EQU   UCBACTIV                                                 04599000
UCBRV061 EQU   UCBACTIV                                                 04600000
UCBRV060 EQU   UCBACTIV                                                 04601000
UCBRV059 EQU   UCBACTIV                                                 04602000
UCBRV058 EQU   UCBACTIV                                                 04603000
UCBRV057 EQU   UCBACTIV                                                 04604000
UCBRV050 EQU   UCB3800X+2                                               04605000
UCBCGMNO EQU   UCB3800X+1                                               04606000
UCBRV083 EQU   UCBOPTNS                                                 04607000
UCBBRSTR EQU   UCBOPTNS                                                 04608000
UCBRV056 EQU   UCBOPTNS                                                 04609000
UCBRV055 EQU   UCBOPTNS                                                 04610000
UCBRV054 EQU   UCBOPTNS                                                 04611000
UCBRV053 EQU   UCBOPTNS                                                 04612000
UCBRV052 EQU   UCBOPTNS                                                 04613000
UCBRV051 EQU   UCBOPTNS                                                 04614000
UCBRV073 EQU   UCB3540X+7                                               04615000
UCBRV072 EQU   UCBDKBYT                                                 04616000
UCBRV071 EQU   UCBDKBYT                                                 04617000
UCBRV070 EQU   UCBDKBYT                                                 04618000
UCBRV069 EQU   UCBDKBYT                                                 04619000
UCBRV068 EQU   UCBDKBYT                                                 04620000
UCBRV067 EQU   UCBDKBYT                                                 04621000
UCBVLVER EQU   UCBDKBYT                                                 04622000
UCBDKAMX EQU   UCBDKBYT                                                 04623000
UCBVLSER EQU   UCB3540X                                                 04624000
UCBRDATA EQU   UCBOCR+4                                                 04625000
UCBFRID  EQU   UCBOCR                                                   04626000
UCBCLN   EQU   UCBMT+14                                                 04627000
UCBERG   EQU   UCBMT+12                                                 04628000
UCBMS    EQU   UCBMT+11                                                 04629000
UCBNB    EQU   UCBMT+10                                                 04630000
UCBPW    EQU   UCBMT+9                                                  04631000
UCBPR    EQU   UCBMT+8                                                  04632000
UCBSIO   EQU   UCBMT+6                                                  04633000
UCBTW    EQU   UCBMT+5                                                  04634000
UCBTR    EQU   UCBMT+4                                                  04635000
UCBTWT   EQU   UCBMT+3                                                  04636000
UCBTRT   EQU   UCBMT+2                                                  04637000
UCBCTD   EQU   UCBMT                                                    04638000
UCBWTOID EQU   UCBCMEXT+17                                              04639000
UCBMIHET EQU   UCBMIHTI                                                 04640000
UCBMIHT2 EQU   UCBMIHTI                                                 04641000
UCBMIHT1 EQU   UCBMIHTI                                                 04642000
UCBMIHPB EQU   UCBMIHTI                                                 04643000
UCBMIHSF EQU   UCBMIHTI                                                 04644000
UCBASID  EQU   UCBCMEXT+14                                              04645000
UCBMFCNT EQU   UCBCMEXT+12                                              04646000
UCBPMSK  EQU   UCBCMEXT+10                                              04647000
UCBCCWOF EQU   UCBCMEXT+8                                               04648000
UCBRV041 EQU   UCBCMEXT+6                                               04649000
UCBRV036 EQU   UCBFLP1                                                  04650000
UCBRV035 EQU   UCBFLP1                                                  04651000
UCBERLOG EQU   UCBFLP1                                                  04652000
UCBSWAPF EQU   UCBFLP1                                                  04653000
UCBINHIO EQU   UCBFLP1                                                  04654000
UCBNSWAP EQU   UCBFLP1                                                  04655000
UCBSHRUP EQU   UCBFLP1                                                  04656000
UCBNSRCH EQU   UCBFLP1                                                  04657000
UCBSNSCT EQU   UCBCMEXT+4                                               04658000
UCBHPDV  EQU   @NM00041                                                 04659000
UCBHALI  EQU   @NM00041                                                 04660000
UCBRSV09 EQU   @NM00041                                                 04661000
UCBRSV08 EQU   @NM00041                                                 04662000
UCBRSV07 EQU   @NM00041                                                 04663000
UCBRSV06 EQU   @NM00041                                                 04664000
UCBRSV05 EQU   @NM00041                                                 04665000
UCBRSV04 EQU   @NM00041                                                 04666000
UCBDTI   EQU   UCBCMEXT+2                                               04667000
UCBSTI   EQU   UCBCMEXT+1                                               04668000
UCBETI   EQU   UCBCMEXT                                                 04669000
UCBEXTP  EQU   UCBEXTPT+1                                               04670000
UCBDDRSW EQU   UCBFLC                                                   04671000
UCBTICBT EQU   UCBFLC                                                   04672000
UCBIVRR  EQU   UCBFLC                                                   04673000
UCBIVRS  EQU   UCBFLC                                                   04674000
UCBITF   EQU   UCBFLC                                                   04675000
UCBUDE   EQU   UCBFLC                                                   04676000
UCBWAA   EQU   UCBFLC                                                   04677000
UCBATTP  EQU   UCBFLC                                                   04678000
UCBUNTYP EQU   UCBTBYT4                                                 04679000
UCBRSV11 EQU   UCBDVCLS                                                 04680000
UCBRSV10 EQU   UCBDVCLS                                                 04681000
UCB3CHAR EQU   UCBDVCLS                                                 04682000
UCB3UREC EQU   UCBDVCLS                                                 04683000
UCB3DISP EQU   UCBDVCLS                                                 04684000
UCB3DACC EQU   UCBDVCLS                                                 04685000
UCB3COMM EQU   UCBDVCLS                                                 04686000
UCB3TAPE EQU   UCBDVCLS                                                 04687000
UCBDVPWR EQU   UCB2OPT7                                                 04688000
UCBVLPWR EQU   UCB2OPT6                                                 04689000
UCB2OPT5 EQU   UCBTBYT2                                                 04690000
UCBRVDEV EQU   UCBRWTAU                                                 04691000
UCBRPS   EQU   UCBDUDN2                                                 04692000
UCBRR    EQU   UCBDUDN1                                                 04693000
UCB2OPT1 EQU   UCBTBYT2                                                 04694000
UCB2OPT0 EQU   UCBTBYT2                                                 04695000
UCB1FEA7 EQU   UCBTBYT1                                                 04696000
UCBD6250 EQU   UCB1FEA6                                                 04697000
UCBD1600 EQU   UCB1FEA5                                                 04698000
UCB1FEA4 EQU   UCBTBYT1                                                 04699000
UCB1FEA3 EQU   UCBTBYT1                                                 04700000
UCB1FEA2 EQU   UCBTBYT1                                                 04701000
UCB1FEA1 EQU   UCBTBYT1                                                 04702000
UCB1FEA0 EQU   UCBTBYT1                                                 04703000
UCBNAME  EQU   UCBOB+13                                                 04704000
UCBRV029 EQU   UCBWGT                                                   04705000
UCBVHRSN EQU   UCBWGT                                                   04706000
UCBVORSN EQU   UCBWGT                                                   04707000
UCBMTPXP EQU   UCBWGT                                                   04708000
UCBREW   EQU   UCBWGT                                                   04709000
UCBPUB   EQU   UCBWGT                                                   04710000
UCBOUT   EQU   UCBWGT                                                   04711000
UCBIN    EQU   UCBWGT                                                   04712000
UCBCPU   EQU   UCBOB+11                                                 04713000
UCBLCI   EQU   UCBOB+10                                                 04714000
UCBCNT   EQU   UCBOB+9                                                  04715000
UCBRV017 EQU   UCBCHM1                                                  04716000
UCBRV016 EQU   UCBCHM1                                                  04717000
UCBRV015 EQU   UCBCHM1                                                  04718000
UCBRV014 EQU   UCBCHM1                                                  04719000
UCBSPB   EQU   UCBPTH1                                                  04720000
UCBPPB   EQU   UCBPTH1                                                  04721000
UCBSPA   EQU   UCBPTH0                                                  04722000
UCBPPA   EQU   UCBPTH0                                                  04723000
UCBSIGP  EQU   UCBFLB                                                   04724000
UCBVALPH EQU   UCBFLB                                                   04725000
UCBCRHSN EQU   UCBFLB                                                   04726000
UCBCRHRV EQU   UCBFLB                                                   04727000
UCBRESVH EQU   UCBFLB                                                   04728000
UCBSPST  EQU   UCBFLB                                                   04729000
UCBASNS  EQU   UCBFLB                                                   04730000
UCBIORST EQU   UCBFLB                                                   04731000
UCBQISCE EQU   UCBFL1                                                   04732000
UCBACTV  EQU   UCBFL1                                                   04733000
UCBSAP   EQU   UCBFL1                                                   04734000
UCBNOTRC EQU   UCBCUB                                                   04735000
UCBPSNS  EQU   UCBFL1                                                   04736000
UCBUSING EQU   UCBPST                                                   04737000
UCBNOTRD EQU   UCBNRY                                                   04738000
UCBBUSYD EQU   UCBBSY                                                   04739000
UCBDADI  EQU   UCBSTAT                                                  04740000
UCBSYSR  EQU   UCBSTAT                                                  04741000
UCBPRES  EQU   UCBSTAT                                                  04742000
UCBALOC  EQU   UCBSTAT                                                  04743000
UCBUNLD  EQU   UCBSTAT                                                  04744000
UCBRESV  EQU   UCBSTAT                                                  04745000
UCBCHGS  EQU   UCBSTAT                                                  04746000
UCBONLI  EQU   UCBSTAT                                                  04747000
UCBID    EQU   UCBOB+2                                                  04748000
UCBALTPH EQU   UCBFL5                                                   04749000
UCBALTCU EQU   UCBFL5                                                   04750000
UCBNALOC EQU   UCBFL5                                                   04751000
UCBENVRD EQU   UCBFL5                                                   04752000
UCBVSDR  EQU   UCBFL5                                                   04753000
UCBSASK  EQU   UCBFL5                                                   04754000
UCBAMV   EQU   UCBAF                                                    04755000
UCBDCC   EQU   UCBFL5                                                   04756000
UCBMONT  EQU   UCBJBNR                                                  04757000
UCBURINP EQU   UCBJBNR                                                  04758000
UCBMMSGP EQU   UCBJBNR                                                  04759000
UCBOLDSM EQU   UCBJBNR                                                  04760000
UCBBOX   EQU   UCBJBNR                                                  04761000
UCBDUC   EQU   UCBJBNR                                                  04762000
UCBJES3  EQU   UCBJBNR                                                  04763000
UCBVRDEV EQU   UCBJBNR                                                  04764000
UCBCMSEG EQU   UCBOB                                                    04765000
UCBPFXND EQU   UCB+512                                                  04766000
UCBIOQ   EQU   UCB+508                                                  04767000
UCBLOCK  EQU   UCB+504                                                  04768000
UCBPXST  EQU   UCB+504                                                  04769000
@NM00038 EQU   UCB                                                      04770000
DEBXSAMB EQU   DEBXTN+28                                                04771000
DEBXOPNJ EQU   DEBXTN+24                                                04772000
DEBXXARG EQU   DEBXTN+20                                                04773000
DEBXMCF2 EQU   DEBXTN+19                                                04774000
DEBXMCF1 EQU   DEBXTN+18                                                04775000
DEBXDSO2 EQU   DEBXTN+17                                                04776000
DEBXDSO1 EQU   DEBXTN+16                                                04777000
DEBXDBPR EQU   DEBXTN+12                                                04778000
DEBXDCBM EQU   DEBXTN+8                                                 04779000
DEBXDSAB EQU   DEBXTN+4                                                 04780000
DEBXRV48 EQU   DEBXTN+3                                                 04781000
DEBXRV47 EQU   DEBXFLG1                                                 04782000
DEBXRV46 EQU   DEBXFLG1                                                 04783000
DEBXRV45 EQU   DEBXFLG1                                                 04784000
DEBXRV44 EQU   DEBXFLG1                                                 04785000
DEBXRV43 EQU   DEBXFLG1                                                 04786000
DEBXDSSI EQU   DEBXFLG1                                                 04787000
DEBXTSKC EQU   DEBXFLG1                                                 04788000
DEBXCDCB EQU   DEBXFLG1                                                 04789000
DEBXLNGH EQU   DEBXTN                                                   04790000
DEBTBLOF EQU   DEBPREFX+14                                              04791000
DEBAMTYP EQU   DEBPREFX+13                                              04792000
DEBLNGTH EQU   DEBPREFX+12                                              04793000
DEBDCBMK EQU   DEBXTNP                                                  04794000
DEBDSCBA EQU   DEBPREFX+1                                               04795000
DEBWKARA EQU   DEBPREFX                                                 04796000
DEBXCEAD EQU   DEBXCEA+1                                                04797000
DEBXCENP EQU   DEBXCEAB                                                 04798000
DEBRSV35 EQU   DEBXCEAB                                                 04799000
DEBRSV34 EQU   DEBXCEAB                                                 04800000
DEBRSV33 EQU   DEBXCEAB                                                 04801000
DEBRSV32 EQU   DEBXCEAB                                                 04802000
DEBCEAD  EQU   DEBCEA+1                                                 04803000
DEBCENP  EQU   DEBCEAB                                                  04804000
DEBRSV31 EQU   DEBCEAB                                                  04805000
DEBRSV30 EQU   DEBCEAB                                                  04806000
DEBRSV29 EQU   DEBCEAB                                                  04807000
DEBESMVR EQU   DEBCEAB                                                  04808000
DEBPCIAD EQU   DEBPCIA+1                                                04809000
DEBPCINP EQU   DEBPCIAB                                                 04810000
DEBRSV27 EQU   DEBPCIAB                                                 04811000
DEBRSV26 EQU   DEBPCIAB                                                 04812000
DEBRSV25 EQU   DEBPCIAB                                                 04813000
DEBRSV24 EQU   DEBPCIAB                                                 04814000
DEBSIOAD EQU   DEBSIOA+1                                                04815000
DEBSIONP EQU   DEBSIOAB                                                 04816000
DEBFIX   EQU   DEBSIOAB                                                 04817000
DEBIOVR  EQU   DEBSIOAB                                                 04818000
DEBSIOX  EQU   DEBSIOAB                                                 04819000
DEBPGFX  EQU   DEBSIOAB                                                 04820000
DEBEOEAD EQU   DEBEOEA+1                                                04821000
DEBEOENP EQU   DEBEOEAB                                                 04822000
DEBTCAMQ EQU   DEBEOEAB                                                 04823000
DEBSUBID EQU   DEBSUBNM                                                 04824000
DEBSIOA2 EQU   DEBACS08+24                                              04825000
DEBRPSIO EQU   DEBACS08+20                                              04826000
DEBFREED EQU   DEBACS08+16                                              04827000
@NM00037 EQU   DEBACS08+12                                              04828000
@NM00036 EQU   DEBACS08+8                                               04829000
DEBDISAD EQU   DEBACS08+4                                               04830000
@NM00035 EQU   DEBACS08                                                 04831000
DEBRPSST EQU   DEBACS07+64                                              04832000
DEBARECK EQU   DEBACS07+60                                              04833000
DEBAREWT EQU   DEBACS07+56                                              04834000
DEBACHK  EQU   DEBACS07+52                                              04835000
DEBAWRIT EQU   DEBACS07+48                                              04836000
DEBASETL EQU   DEBACS07+44                                              04837000
DEBAREAD EQU   DEBACS07+40                                              04838000
DEBCRECK EQU   DEBACS07+36                                              04839000
DEBCREWT EQU   DEBACS07+32                                              04840000
DEBCCHK  EQU   DEBACS07+28                                              04841000
DEBCWRIT EQU   DEBACS07+24                                              04842000
DEBCSETL EQU   DEBACS07+20                                              04843000
DEBCREAD EQU   DEBACS07+16                                              04844000
DEBWKPT5 EQU   DEBACS07+12                                              04845000
DEBWKPT4 EQU   DEBACS07+8                                               04846000
DEBGET   EQU   DEBACS07+4                                               04847000
@NM00034 EQU   DEBACS07                                                 04848000
DEBPUT   EQU   DEBACS06+4                                               04849000
DEBDCBFA EQU   DEBACS06                                                 04850000
DEBLUCBB EQU   DEBLUCBA+1                                               04851000
DEBRSV18 EQU   DEBLUCBA                                                 04852000
DEBFUCBB EQU   DEBFUCBA+1                                               04853000
DEBRSV17 EQU   DEBFUCBA                                                 04854000
DEBTCCWB EQU   DEBTCCWA+1                                               04855000
DEBRSV16 EQU   DEBTCCWA                                                 04856000
DEBTBFRB EQU   DEBTBFRA+1                                               04857000
DEBRSV15 EQU   DEBTBFRA                                                 04858000
DEBDBPEF EQU   DEBACS03+8                                               04859000
DEBDBPP  EQU   DEBACS03+4                                               04860000
DEBDTPP  EQU   DEBACS03                                                 04861000
DEBDBPE  EQU   DEBDBLK+1                                                04862000
DEBDBPT  EQU   DEBDBLK                                                  04863000
DEBEXTNM EQU   DEBDSNAM                                                 04864000
DEBLRECL EQU   DEBACSMD+14                                              04865000
DEBBLKSI EQU   DEBACSMD+12                                              04866000
DEBRSV14 EQU   DEBDSNM+4                                                04867000
DEBUTSAB EQU   DEBUTSAA+1                                               04868000
DEBRSV13 EQU   DEBUTSAA                                                 04869000
DEBVOLNM EQU   DEBACSMD+2                                               04870000
DEBVLSEQ EQU   DEBVOLSQ+1                                               04871000
DEBRSV42 EQU   DEBVOLBT                                                 04872000
DEBRSV41 EQU   DEBVOLBT                                                 04873000
DEBRSV40 EQU   DEBVOLBT                                                 04874000
DEBRSV39 EQU   DEBVOLBT                                                 04875000
DEBRSV38 EQU   DEBVOLBT                                                 04876000
DEBRSV37 EQU   DEBVOLBT                                                 04877000
DEBRSV36 EQU   DEBVOLBT                                                 04878000
DEBEXFUL EQU   DEBVOLBT                                                 04879000
DEBNMTRK EQU   DEBDASD+14                                               04880000
DEBENDHH EQU   DEBDASD+12                                               04881000
DEBENDCC EQU   DEBDASD+10                                               04882000
DEBSTRHH EQU   DEBDASD+8                                                04883000
DEBSTRCC EQU   DEBDASD+6                                                04884000
DEBBINUM EQU   DEBDASD+4                                                04885000
DEBUCBA  EQU   DEBUCBAD+1                                               04886000
DEBDVMOD EQU   DEBUCBAD                                                 04887000
DEBAPPB  EQU   DEBAPPAD+1                                               04888000
DEBEXSCL EQU   DEBAPPAD                                                 04889000
DEBDCBB  EQU   DEBDCBAD+1                                               04890000
DEBDEBID EQU   DEBPROTG                                                 04891000
DEBECBB  EQU   DEBECBAD+1                                               04892000
DEBPRIOR EQU   DEBECBAD                                                 04893000
DEBUSRPB EQU   DEBUSRPG+1                                               04894000
DEBNMEXT EQU   DEBUSRPG                                                 04895000
DEBRSV05 EQU   DEBBASIC+15                                              04896000
DEBXTNIN EQU   DEBFLGS1                                                 04897000
DEBAPFIN EQU   DEBFLGS1                                                 04898000
DEBF1CEV EQU   DEBFLGS1                                                 04899000
DEBCINDI EQU   DEBFLGS1                                                 04900000
DEBRSV02 EQU   DEBFLGS1                                                 04901000
DEBRSIOA EQU   DEBFLGS1                                                 04902000
DEBEOFDF EQU   DEBFLGS1                                                 04903000
DEBPWCKD EQU   DEBFLGS1                                                 04904000
DEBQSCNT EQU   DEBBASIC+13                                              04905000
DEBACCS  EQU   DEBOPATB                                                 04906000
DEBPOSIT EQU   DEBOPATB                                                 04907000
DEBZERO  EQU   DEBOPATB                                                 04908000
DEBABEND EQU   DEBOPATB                                                 04909000
DEBIRBB  EQU   DEBIRBAD+1                                               04910000
DEBRERR  EQU   DEBOFLGS                                                 04911000
DEBLABEL EQU   DEBOFLGS                                                 04912000
DEBSPLIT EQU   DEBOFLGS                                                 04913000
DEBDCB   EQU   DEBOFLGS                                                 04914000
DEBRLSE  EQU   DEBOFLGS                                                 04915000
DEBEOF   EQU   DEBOFLGS                                                 04916000
DEBDISP  EQU   DEBOFLGS                                                 04917000
DEBDEBB  EQU   DEBDEBAD+1                                               04918000
DEBAMLNG EQU   DEBDEBAD                                                 04919000
DEBTCBB  EQU   DEBTCBAD+1                                               04920000
DEBNMSUB EQU   DEBTCBAD                                                 04921000
DCBEOB   EQU   IHADCS40+20                                              04922000
DCBPRECL EQU   IHADCS40+18                                              04923000
@NM00033 EQU   IHADCS40+16                                              04924000
@NM00032 EQU   @NM00030+1                                               04925000
@NM00031 EQU   DCBEROPT                                                 04926000
DCBERABE EQU   DCBEROPT                                                 04927000
DCBERSKP EQU   DCBEROPT                                                 04928000
DCBERACC EQU   DCBEROPT                                                 04929000
@NM00029 EQU   IHADCS40+10                                              04930000
@NM00028 EQU   IHADCS40+9                                               04931000
@NM00027 EQU   IHADCS40+8                                               04932000
DCBRECA  EQU   DCBRECAD+1                                               04933000
@NM00026 EQU   DCBRECBT                                                 04934000
DCBRCFGT EQU   DCBRCREL                                                 04935000
DCBRCTRU EQU   DCBRCREL                                                 04936000
DCBLCCW  EQU   DCBEOBAD                                                 04937000
DCBNOTE  EQU   DCBCNTRL                                                 04938000
DCBLRECL EQU   IHADCS38+10                                              04939000
@NM00025 EQU   IHADCS38+8                                               04940000
DCBEOBW  EQU   IHADCS38+4                                               04941000
DCBEOBRA EQU   DCBEOBR+1                                                04942000
DCBNCP   EQU   DCBEOBR                                                  04943000
@NM00024 EQU   DCBFLAG1                                                 04944000
DCBSTFLS EQU   DCBFLAG1                                                 04945000
DCBSTQCK EQU   DCBFLAG1                                                 04946000
DCBDIRCQ EQU   DCBBUFOF                                                 04947000
DCBQSTRU EQU   DCBUSASI                                                 04948000
@NM00023 EQU   DCBUSASI                                                 04949000
DCBQADF3 EQU   DCBQADFS                                                 04950000
DCBQADF2 EQU   DCBQADFS                                                 04951000
DCBQADF1 EQU   DCBQADFS                                                 04952000
DCBBLBP  EQU   DCBUSASI                                                 04953000
@NM00022 EQU   DCBUSASI                                                 04954000
DCBCICBA EQU   DCBCICB+1                                                04955000
@NM00021 EQU   DCBCICB                                                  04956000
DCBOFFSW EQU   IHADCS36+15                                              04957000
DCBOFFSR EQU   IHADCS36+14                                              04958000
DCBWCPL  EQU   IHADCS36+13                                              04959000
DCBWCPO  EQU   IHADCS36+12                                              04960000
DCBBLKSI EQU   IHADCS36+10                                              04961000
DCBCNQSM EQU   DCBCIND2                                                 04962000
DCBCNFEO EQU   DCBCIND2                                                 04963000
DCBCNCHS EQU   DCBCIND2                                                 04964000
DCBCNBFP EQU   DCBCIND2                                                 04965000
DCBCNIOE EQU   DCBCIND2                                                 04966000
DCBCNCLO EQU   DCBCIND2                                                 04967000
DCBCNWRO EQU   DCBCIND2                                                 04968000
DCBCNSTO EQU   DCBCIND2                                                 04969000
DCBCNEXB EQU   DCBCIND1                                                 04970000
@NM00020 EQU   DCBCIND1                                                 04971000
DCBCNBRM EQU   DCBCIND1                                                 04972000
@NM00019 EQU   DCBCIND1                                                 04973000
DCBCNEVA EQU   DCBCIND1                                                 04974000
DCBCNEVB EQU   DCBCIND1                                                 04975000
DCBCNSRD EQU   DCBCIND1                                                 04976000
DCBCNTOV EQU   DCBCIND1                                                 04977000
DCBSYNA  EQU   DCBSYNAD+1                                               04978000
DCBIOBL  EQU   DCBSYNAD                                                 04979000
DCBCHCKA EQU   DCBPERRA                                                 04980000
DCBOPTJ  EQU   DCBOPTCD                                                 04981000
DCBOPTT  EQU   DCBOPTCD                                                 04982000
DCBSRCHD EQU   DCBOPTZ                                                  04983000
DCBOPTQ  EQU   DCBOPTCD                                                 04984000
DCBBCKPT EQU   DCBOPTO                                                  04985000
DCBOPTC  EQU   DCBOPTCD                                                 04986000
DCBOPTU  EQU   DCBOPTCD                                                 04987000
DCBOPTW  EQU   DCBOPTCD                                                 04988000
DCBPUTA  EQU   DCBGETA                                                  04989000
@NM00018 EQU   DCBPUT                                                   04990000
DCBREADA EQU   DCBWRITA                                                 04991000
@NM00017 EQU   DCBREAD                                                  04992000
DCBDEBA  EQU   DCBDEBAD+1                                               04993000
@NM00016 EQU   DCBIFLGS                                                 04994000
DCBIFIOE EQU   DCBIFLGS                                                 04995000
DCBCH12  EQU   DCBIFPCT                                                 04996000
DCBCH9   EQU   DCBIFPCT                                                 04997000
DCBIFEC  EQU   DCBIFLGS                                                 04998000
DCBMFSTI EQU   DCBMFDMD                                                 04999000
DCBMFAWR EQU   DCBMFSTK                                                 05000000
DCBMFUIP EQU   DCBMFTMD                                                 05001000
DCBMFIDW EQU   DCBMFLCP                                                 05002000
DCBMFWRK EQU   DCBMFMVP                                                 05003000
DCBMFRDQ EQU   DCBMFWRT                                                 05004000
DCBMFGTQ EQU   DCBMFPUT                                                 05005000
DCBMFSTL EQU   DCBMACF2                                                 05006000
DCBMFCK  EQU   DCBMFDMG                                                 05007000
DCBMFRDX EQU   DCBMFCHK                                                 05008000
DCBMFDBF EQU   DCBMFSBG                                                 05009000
DCBMFRDI EQU   DCBMFLCG                                                 05010000
DCBMFRDK EQU   DCBMFMVG                                                 05011000
DCBMFWRQ EQU   DCBMFRD                                                  05012000
DCBMFPTQ EQU   DCBMFGET                                                 05013000
DCBMFECP EQU   DCBMACF1                                                 05014000
DCBTIOT  EQU   IHADCS25                                                 05015000
DCBMRSTI EQU   DCBMRDMD                                                 05016000
DCBMRAWR EQU   DCBMRSTK                                                 05017000
DCBMRUIP EQU   DCBMRTMD                                                 05018000
DCBMRIDW EQU   DCBMRLCP                                                 05019000
DCBMRWRK EQU   DCBMRMVP                                                 05020000
DCBMRRDQ EQU   DCBMRWRT                                                 05021000
DCBMRGTQ EQU   DCBMRPUT                                                 05022000
DCBMRSTL EQU   DCBMACR2                                                 05023000
DCBMRCK  EQU   DCBMRDMG                                                 05024000
DCBPGFXA EQU   DCBMRRDX                                                 05025000
DCBMRDBF EQU   DCBMRSBG                                                 05026000
DCBMRRDI EQU   DCBMRLCG                                                 05027000
DCBMRRDK EQU   DCBMRMVG                                                 05028000
DCBMRWRQ EQU   DCBMRRD                                                  05029000
DCBMRPTQ EQU   DCBMRGET                                                 05030000
DCBMRECP EQU   DCBMACR1                                                 05031000
@NM00015 EQU   DCBIFLG                                                  05032000
DCBIBIOE EQU   DCBIFLG                                                  05033000
DCBICH12 EQU   DCBIBPCT                                                 05034000
DCBICH9  EQU   DCBIBPCT                                                 05035000
DCBIBEC  EQU   DCBIFLG                                                  05036000
DCBOFIOF EQU   DCBOFLGS                                                 05037000
DCBOFUEX EQU   DCBOFLGS                                                 05038000
DCBOFTM  EQU   DCBOFLGS                                                 05039000
DCBOFPPC EQU   DCBOFLGS                                                 05040000
DCBOFEOV EQU   DCBOFLGS                                                 05041000
DCBOFLRB EQU   DCBOFLGS                                                 05042000
DCBOFIOD EQU   DCBOFLWR                                                 05043000
DCBDDNAM EQU   IHADCS24                                                 05044000
DCBEXLSA EQU   DCBEXLST+1                                               05045000
DCBRECKL EQU   DCBRECFM                                                 05046000
DCBRECCC EQU   DCBRECFM                                                 05047000
DCBRECSB EQU   DCBRECFM                                                 05048000
DCBRECBR EQU   DCBRECFM                                                 05049000
DCBRECTO EQU   DCBRECLA                                                 05050000
DCBRECL  EQU   DCBRECLA                                                 05051000
DCBEODA  EQU   DCBEODAD+1                                               05052000
DCBBFA   EQU   DCBBFTEK                                                 05053000
DCBH0    EQU   DCBBFTEK                                                 05054000
DCBBFTKD EQU   DCBBFTEK                                                 05055000
DCBBFTE  EQU   DCBBFT                                                   05056000
DCBBFTKR EQU   DCBBFT                                                   05057000
DCBBFTS  EQU   DCBBFT                                                   05058000
DCBH1    EQU   DCBBFTEK                                                 05059000
DCBSVCXA EQU   DCBSVCXL+1                                               05060000
@NM00014 EQU   DCBSVCXL                                                 05061000
DCBODEBA EQU   DCBIOBAA                                                 05062000
@NM00013 EQU   DCBQSLM                                                  05063000
DCBUPDBT EQU   DCBQSLM                                                  05064000
DCBUPDCM EQU   DCBQSLM                                                  05065000
DCB1DVDS EQU   DCBQSLM                                                  05066000
@NM00012 EQU   DCBDSRG2                                                 05067000
DCBDSGTR EQU   DCBDSRG2                                                 05068000
DCBACBM  EQU   DCBDSRG2                                                 05069000
@NM00011 EQU   DCBDSRG2                                                 05070000
DCBDSGTQ EQU   DCBDSRG2                                                 05071000
DCBDSGTX EQU   DCBDSRG2                                                 05072000
DCBDSGGS EQU   DCBDSRG2                                                 05073000
DCBDSGU  EQU   DCBDSRG1                                                 05074000
DCBDSGPO EQU   DCBDSRG1                                                 05075000
@NM00010 EQU   DCBDSRG1                                                 05076000
@NM00009 EQU   DCBDSRG1                                                 05077000
DCBDSGCX EQU   DCBDSRG1                                                 05078000
DCBDSGDA EQU   DCBDSRG1                                                 05079000
DCBDSGPS EQU   DCBDSRG1                                                 05080000
DCBDSGIS EQU   DCBDSRG1                                                 05081000
DCBBUFL  EQU   IHADCS11+8                                               05082000
DCBBUFCA EQU   DCBBUFCB+1                                               05083000
DCBBUFNO EQU   DCBBUFCB                                                 05084000
DCBDEVT  EQU   DCBREL                                                   05085000
DCBKEYLE EQU   DCBRELB                                                  05086000
DCBTRBAL EQU   IHADCS01+6                                               05087000
@NM00008 EQU   IHADCS01+5                                               05088000
@NM00007 EQU   IHADCS01+4                                               05089000
DCBDVTBA EQU   DCBDVTBL+1                                               05090000
@NM00006 EQU   DCBDVTBL                                                 05091000
DCBKEYCN EQU   IHADCS00+4                                               05092000
DCBRELAD EQU   IHADCS00                                                 05093000
@NM00005 EQU   IHADCB                                                   05094000
@NM00075 EQU   PSA+3668                                                 05095000
PSASTAK  EQU   PSA+3072                                                 05096000
@NM00074 EQU   PSA+1048                                                 05097000
PSAUSEND EQU   PSA+1048                                                 05098000
PSARV062 EQU   PSA+1044                                                 05099000
PSACDAL  EQU   PSA+1040                                                 05100000
PSAWTCOD EQU   PSA+1036                                                 05101000
PSAATCVT EQU   PSA+1032                                                 05102000
PSAPCPSW EQU   PSA+1024                                                 05103000
PSAPIR2  EQU   PSA+1020                                                 05104000
PSARV059 EQU   PSA+1018                                                 05105000
PSASVC13 EQU   PSA+1016                                                 05106000
PSALSFCC EQU   PSA+1012                                                 05107000
PSASFACC EQU   PSA+1008                                                 05108000
PSASTOP  EQU   PSA+992                                                  05109000
PSASTART EQU   PSA+976                                                  05110000
PSARSPSW EQU   PSA+968                                                  05111000
PSASRPSW EQU   PSA+960                                                  05112000
PSARV045 EQU   PSA+892                                                  05113000
PSARV044 EQU   PSA+888                                                  05114000
PSARV043 EQU   PSA+884                                                  05115000
PSARV042 EQU   PSA+880                                                  05116000
PSARV041 EQU   PSA+876                                                  05117000
PSARV040 EQU   PSA+872                                                  05118000
PSARV025 EQU   PSA+868                                                  05119000
PSADSSED EQU   PSA+868                                                  05120000
PSADSSPR EQU   PSA+864                                                  05121000
PSADSSFW EQU   PSA+860                                                  05122000
PSADSS14 EQU   PSA+856                                                  05123000
PSADSSPP EQU   PSA+848                                                  05124000
PSADSSRP EQU   PSA+840                                                  05125000
PSADSS05 EQU   PSADSSF4                                                 05126000
PSADSS10 EQU   PSADSSF4                                                 05127000
PSADSSVE EQU   PSADSSF4                                                 05128000
PSADSSDE EQU   PSADSSF4                                                 05129000
PSADSSC0 EQU   PSADSSF4                                                 05130000
PSADSSIE EQU   PSADSSF4                                                 05131000
PSADSS12 EQU   PSADSSF4                                                 05132000
PSADSSRC EQU   PSADSSF4                                                 05133000
PSARV057 EQU   PSADSSF3                                                 05134000
PSARV056 EQU   PSADSSF3                                                 05135000
PSARV055 EQU   PSADSSF3                                                 05136000
PSADSSMC EQU   PSADSSF3                                                 05137000
PSADSSRW EQU   PSADSSF3                                                 05138000
PSADSSNM EQU   PSADSSF3                                                 05139000
PSADSSES EQU   PSADSSF3                                                 05140000
PSADSSGP EQU   PSADSSF3                                                 05141000
PSADSSF2 EQU   PSADSSFL+1                                               05142000
PSADSSPI EQU   PSADSSF1                                                 05143000
PSADSSOI EQU   PSADSSF1                                                 05144000
PSADSSSP EQU   PSADSSF1                                                 05145000
PSADSSTP EQU   PSADSSF1                                                 05146000
PSADSSDW EQU   PSADSSF1                                                 05147000
PSADSSDD EQU   PSADSSF1                                                 05148000
PSADSSDM EQU   PSADSSF1                                                 05149000
PSADSSMV EQU   PSADSSF1                                                 05150000
PSADSSTS EQU   PSA+816                                                  05151000
PSADSSWK EQU   PSA+812                                                  05152000
PSADSSR3 EQU   PSA+808                                                  05153000
PSADSSR2 EQU   PSA+804                                                  05154000
PSADSSRS EQU   PSA+800                                                  05155000
PSASTOR  EQU   PSA+796                                                  05156000
PSACPUSA EQU   PSA+794                                                  05157000
PSAVSTAP EQU   PSA+792                                                  05158000
PSAWKVAP EQU   PSA+788                                                  05159000
PSAWKRAP EQU   PSA+784                                                  05160000
PSAMCHIC EQU   PSA+783                                                  05161000
PSAACTCD EQU   PSA+782                                                  05162000
PSASYMSK EQU   PSA+781                                                  05163000
PSAMCHFL EQU   PSA+780                                                  05164000
PSACR0   EQU   PSA+776                                                  05165000
PSAPSWSV EQU   PSA+768                                                  05166000
PSALITA  EQU   PSA+764                                                  05167000
PSACLHS  EQU   PSAHLHI                                                  05168000
PSALKR15 EQU   PSALKSA+60                                               05169000
PSALKR14 EQU   PSALKSA+56                                               05170000
PSALKR13 EQU   PSALKSA+52                                               05171000
PSALKR12 EQU   PSALKSA+48                                               05172000
PSALKR11 EQU   PSALKSA+44                                               05173000
PSALKR10 EQU   PSALKSA+40                                               05174000
PSALKR9  EQU   PSALKSA+36                                               05175000
PSALKR8  EQU   PSALKSA+32                                               05176000
PSALKR7  EQU   PSALKSA+28                                               05177000
PSALKR6  EQU   PSALKSA+24                                               05178000
PSALKR5  EQU   PSALKSA+20                                               05179000
PSALKR4  EQU   PSALKSA+16                                               05180000
PSALKR3  EQU   PSALKSA+12                                               05181000
PSALKR2  EQU   PSALKSA+8                                                05182000
PSALKR1  EQU   PSALKSA+4                                                05183000
PSALKR0  EQU   PSALKSA                                                  05184000
PSARV023 EQU   PSACLHT+52                                               05185000
PSALOCAL EQU   PSACLHT+48                                               05186000
PSACMSL  EQU   PSACLHT+44                                               05187000
PSAOPTL  EQU   PSACLHT+40                                               05188000
PSATPACL EQU   PSACLHT+36                                               05189000
PSATPDNL EQU   PSACLHT+32                                               05190000
PSATPNCL EQU   PSACLHT+28                                               05191000
PSAIOSLL EQU   PSACLHT+24                                               05192000
PSAIOSUL EQU   PSACLHT+20                                               05193000
PSAIOSCL EQU   PSACLHT+16                                               05194000
PSAIOSSL EQU   PSACLHT+12                                               05195000
PSASALCL EQU   PSACLHT+8                                                05196000
PSAASML  EQU   PSACLHT+4                                                05197000
PSADISPL EQU   PSACLHT                                                  05198000
PSASRSA  EQU   PSA+636                                                  05199000
PSARV050 EQU   PSA+634                                                  05200000
PSADSSGO EQU   PSA+633                                                  05201000
PSARECUR EQU   PSA+632                                                  05202000
PSAHLHIS EQU   PSA+628                                                  05203000
PSAIPCSA EQU   PSA+624                                                  05204000
@NM00073 EQU   PSA+621                                                  05205000
PSAIPCDM EQU   PSA+620                                                  05206000
PSAIPCD  EQU   PSA+616                                                  05207000
@NM00072 EQU   PSA+613                                                  05208000
PSAIPCRM EQU   PSA+612                                                  05209000
PSAIPCR  EQU   PSA+608                                                  05210000
PSAMCHEX EQU   PSA+600                                                  05211000
PSAMPSW  EQU   PSA+592                                                  05212000
PSAEXPS2 EQU   PSA+584                                                  05213000
PSAEXPS1 EQU   PSA+576                                                  05214000
PSAPIREG EQU   PSA+572                                                  05215000
PSARSREG EQU   PSA+568                                                  05216000
PSAGPREG EQU   PSA+556                                                  05217000
PSARV022 EQU   PSASUP4                                                  05218000
PSARV021 EQU   PSASUP4                                                  05219000
PSARV020 EQU   PSASUP4                                                  05220000
PSARV019 EQU   PSASUP4                                                  05221000
PSARV018 EQU   PSASUP4                                                  05222000
PSARV017 EQU   PSASUP4                                                  05223000
PSARV016 EQU   PSASUP4                                                  05224000
PSARV015 EQU   PSASUP4                                                  05225000
PSARV014 EQU   PSASUP3                                                  05226000
PSAULCMS EQU   PSASUP3                                                  05227000
PSARV012 EQU   PSASUP3                                                  05228000
PSAESTA  EQU   PSASUP3                                                  05229000
PSASPR   EQU   PSASUP3                                                  05230000
PSAPSREG EQU   PSASUP3                                                  05231000
PSAPI2   EQU   PSASUP3                                                  05232000
PSAIOSUP EQU   PSASUP3                                                  05233000
PSALCR   EQU   PSASUP2                                                  05234000
PSARTM   EQU   PSASUP2                                                  05235000
PSAACR   EQU   PSASUP2                                                  05236000
PSAIPCE2 EQU   PSASUP2                                                  05237000
PSAIPCES EQU   PSASUP2                                                  05238000
PSAIPCEC EQU   PSASUP2                                                  05239000
PSAGTF   EQU   PSASUP2                                                  05240000
PSAIPCRI EQU   PSASUP2                                                  05241000
PSATYPE6 EQU   PSASUP1                                                  05242000
PSATCTL  EQU   PSASUP1                                                  05243000
PSADISP  EQU   PSASUP1                                                  05244000
PSALOCK  EQU   PSASUP1                                                  05245000
PSAPI    EQU   PSASUP1                                                  05246000
PSAEXT   EQU   PSASUP1                                                  05247000
PSASVC   EQU   PSASUP1                                                  05248000
PSAIO    EQU   PSASUP1                                                  05249000
PSAANEW  EQU   PSA+544                                                  05250000
PSATNEW  EQU   PSA+536                                                  05251000
PSALCCAR EQU   PSA+532                                                  05252000
PSALCCAV EQU   PSA+528                                                  05253000
PSAPCCAR EQU   PSA+524                                                  05254000
PSAPCCAV EQU   PSA+520                                                  05255000
PSACPULA EQU   PSA+518                                                  05256000
PSACPUPA EQU   PSA+516                                                  05257000
PSAPSA   EQU   PSA+512                                                  05258000
FLCHDEND EQU   PSA+512                                                  05259000
FLCCRSAV EQU   FLCMCLA+280                                              05260000
FLCGRSAV EQU   FLCMCLA+216                                              05261000
FLCFPSAV EQU   FLCMCLA+184                                              05262000
FLCFLA   EQU   FLCMCLA+88                                               05263000
FLCRGNCD EQU   FLCMCLA+84                                               05264000
FLCFSAA  EQU   FLCFSA+1                                                 05265000
@NM00071 EQU   FLCFSA                                                   05266000
@NM00070 EQU   FLCMCLA+77                                               05267000
PSAMDISC EQU   PSAMEDC                                                  05268000
PSAMINTR EQU   PSAMEDC                                                  05269000
PSAMINST EQU   PSAMEDC                                                  05270000
PSAMCCF  EQU   PSAMEDC                                                  05271000
PSAMCNOP EQU   PSAMEDC                                                  05272000
PSAMEXSR EQU   PSAMEDC                                                  05273000
PSAMCOPR EQU   PSAMEDC                                                  05274000
@NM00069 EQU   PSAMEDC                                                  05275000
@NM00068 EQU   FLCMCLA+72                                               05276000
FLCMCIC  EQU   FLCMCLA+64                                               05277000
@NM00067 EQU   FLCMCLA+20                                               05278000
FLCIOAA  EQU   FLCIOA+1                                                 05279000
@NM00066 EQU   FLCIOA                                                   05280000
@NM00065 EQU   FLCMCLA+15                                               05281000
@NM00064 EQU   FLCMCLA+14                                               05282000
@NM00063 EQU   FLCMCLA+12                                               05283000
FLCLCL   EQU   FLCMCLA+8                                                05284000
FLCIOELA EQU   FLCIOEL+1                                                05285000
@NM00062 EQU   FLCIOEL                                                  05286000
FLCCHIL  EQU   FLCCHNID+2                                               05287000
FLCCHMOD EQU   FLCCHTM                                                  05288000
FLCCHTYP EQU   FLCCHTM                                                  05289000
@NM00061 EQU   PSA+160                                                  05290000
FLCMTRCD EQU   PSA+157                                                  05291000
@NM00060 EQU   PSA+156                                                  05292000
FLCPERA  EQU   FLCPER+1                                                 05293000
@NM00059 EQU   FLCPER                                                   05294000
@NM00058 EQU   PSA+151                                                  05295000
FLCPERCD EQU   PSA+150                                                  05296000
FLCMCNUM EQU   PSA+149                                                  05297000
@NM00057 EQU   PSA+148                                                  05298000
FLCTEAA  EQU   FLCTEA+1                                                 05299000
@NM00056 EQU   FLCTEA                                                   05300000
PSAPIPC  EQU   PSAPICOD                                                 05301000
PSAPIMC  EQU   PSAPICOD                                                 05302000
PSAPIPER EQU   PSAPICOD                                                 05303000
PSARV049 EQU   FLCPICOD                                                 05304000
FLCPILCB EQU   FLCPIILC                                                 05305000
@NM00055 EQU   FLCPIILC                                                 05306000
@NM00054 EQU   PSAEPPSW                                                 05307000
FLCSVCN  EQU   PSAESPSW+2                                               05308000
FLCSILCB EQU   FLCSVILC                                                 05309000
@NM00053 EQU   FLCSVILC                                                 05310000
@NM00052 EQU   PSAESPSW                                                 05311000
FLCEICOD EQU   PSAEEPSW+2                                               05312000
PSASPAD  EQU   PSAEEPSW                                                 05313000
@NM00051 EQU   PSA+128                                                  05314000
FLCINPSW EQU   PSA+120                                                  05315000
FLCMNPSW EQU   PSA+112                                                  05316000
FLCPNPSW EQU   PSA+104                                                  05317000
FLCSNPSW EQU   PSA+96                                                   05318000
FLCENPSW EQU   PSA+88                                                   05319000
FLCTRACE EQU   PSA+84                                                   05320000
FLCTIMER EQU   PSA+80                                                   05321000
FLCCVT2  EQU   PSA+76                                                   05322000
FLCCAW   EQU   PSA+72                                                   05323000
FLCCSW   EQU   PSA+64                                                   05324000
FLCIOPSW EQU   PSA+56                                                   05325000
FLCMOPSW EQU   PSA+48                                                   05326000
FLCPOPSW EQU   PSA+40                                                   05327000
FLCSOPSW EQU   PSA+32                                                   05328000
FLCEOPSW EQU   PSA+24                                                   05329000
@NM00050 EQU   FLCICCW2+4                                               05330000
FLCCVT   EQU   FLCICCW2                                                 05331000
FLCICCW1 EQU   FLCROPSW                                                 05332000
FLCIPPSW EQU   FLCRNPSW                                                 05333000
*                                      END UNREFERENCED COMPONENTS      05334000
@RF00118 EQU   @RC00113                                                 05335000
@RC00116 EQU   @RC00113                                                 05336000
@RC00221 EQU   @RC00217                                                 05337000
@RT00304 EQU   ABNEXIT                                                  05338000
@RC00213 EQU   MAINLOOP                                                 05339000
@RC00350 EQU   @EL00002                                                 05340000
@RC00396 EQU   @RC00395                                                 05341000
@PB00007 EQU   @EL00001                                                 05342000
@RC00268 EQU   @RC00213                                                 05343000
@RC00242 EQU   @RC00213                                                 05344000
@RC00215 EQU   @RC00213                                                 05345000
@RC00397 EQU   @RC00396                                                 05346000
@PB00006 EQU   @PB00007                                                 05347000
@RC00233 EQU   @RC00215                                                 05348000
@PB00005 EQU   @PB00006                                                 05349000
@PB00004 EQU   @PB00005                                                 05350000
@PB00003 EQU   @PB00004                                                 05351000
@PB00002 EQU   @PB00003                                                 05352000
@ENDDATA EQU   *                                                        05353000
         END   DMKMSS                                                   05354000