VRSIZE   TITLE 'VRSIZE                 VM/370 - RELEASE 6'              00001000
VRSIZE   CSECT                                                          00002000
         BALR  R12,0                                                    00003000
         USING *,R12,R10,R11                                            00004000
BASEREG  LM    R10,R11,BASEADR                                          00005000
         B     BEGIN                                                    00006000
BASEADR  DC    A(BASEREG+4096,BASEREG+8192)                             00007000
BEGIN    EQU   *                                                        00008000
         FSERASE FSCB=OLDSLC                                            00009000
CLEARSW  MVC   WORKAREA,SPACES                                          00010000
         MVC   SWSTG,SPACES                                             00011000
         MVC   STGPERM,SPACES                                           00012000
         MVC   CONSOUT,=C'VIRTUAL=REAL OPTION REQUIRED (YES,NO):'       00013000
         MVI   PROLEN,38      LENGHT OF MESSAGE                         00014000
         LA    R1,PROMPT                                                00015000
         BAL   R5,WRITEMSG    OUTPUT IT                                 00016000
         RDTERM CONSINPT,EDIT=YES                                       00017000
         CLC   CONSINPT(4),NO                                           00018000
         BE    GOBACK                                                   00019000
         CLC   CONSINPT(4),YES                                          00020000
         BNE   BEGIN                                                    00021000
STGSIZE  MVC   CONSOUT,=C'STORAGE SIZE OF VIRT=REAL  <MINIMUM IS 32K>:' 00022000
         MVI   PROLEN,44                                                00023000
         LA    R1,PROMPT                                                00024000
         BAL   R5,WRITEMSG                                              00025000
         RDTERM CONSINPT,EDIT=YES                                       00026000
         LA    R3,CONSINPT                                              00027000
         LA    R6,5                                                     00028000
SZELOOP  CLI   0(R3),X'D2'                                              00029000
         BE    MVSTG                                                    00030000
         TM    0(R3),X'F0'                                              00031000
         BNO   STGSIZE                                                  00032000
         LA    R3,1(,R3)                                                00033000
         BCT   R6,SZELOOP                                               00034000
         B     STGSIZE                                                  00035000
         SPACE 1                                                        00036000
MVSTG    S     R3,=A(CONSINPT)                                          00037000
         LR    R0,R3                                                    00038000
         LA    R1,CONSINPT                                              00039000
         BAL   R5,CVTHB                                                 00040000
         BNZ   STGSIZE                                                  00041000
         C     R1,=X'00008192'     MAX. OF 8 MEG.              @VMH0030 00042100
         BH    STGSIZE                                                  00043000
         SLL   R1,4                                                     00044000
         O     R1,=F'15'                                                00045000
         SR    R0,R0                                                    00046000
         STM   R0,R1,STGTEMP                                            00047000
         SR    R0,R0                                                    00048000
         CVB   R1,STGTEMP                                               00049000
         C     R1,=F'32'                                                00050000
         BL    STGSIZE                                                  00051000
         D     R0,=F'4'                                                 00052000
         LTR   R0,R0                                                    00053000
         BZ    EVEN                                                     00054000
         AH    R1,=H'1'                                                 00055000
         STM   R0,R1,BALRSAVE                                           00056000
         WRTERM '** SIZE ROUNDED TO NEXT HIGHER 4K BOUNDARY **'         00057000
         LM    R0,R1,BALRSAVE                                           00058000
         SPACE 1                                                        00059000
EVEN     LR    R2,R1                                                    00060000
         AH    R1,=H'1'                                                 00061000
         MH    R2,=H'4'                                                 00062000
         ST    R2,SWSTG                                                 00063000
         MH    R1,=H'4096'                                              00064000
         BAL   R5,CVTBH                                                 00065000
         STM   R0,R1,STGPERM                                            00066000
         L     R1,SWSTG                                                 00067000
         CVD   R1,STGTEMP                                               00068000
         L     R1,STGTEMP+4                                             00069000
         SRL   R1,4                                                     00070000
         BAL   R5,CVTBH                                                 00071000
         ST    R1,SWSTG                                                 00072000
TRYPREF  MVC   CONSOUT(4),SWSTG                                         00073000
         MVI   CONSOUT+4,C'K'                                           00074000
         MVC   CONSOUT+6(80),=C'STORAGE SIZE FOR VIRTUAL=REAL'          00075000
         MVI   MSGLEN,35                                                00076000
         LA    R1,TERMLIST                                              00077000
         BAL   R5,WRITEMSG                                              00078000
LASTTRY  MVC   CONSOUT,=C'IS THE ABOVE ENTRY CORRECT (YES,NO):'         00079000
         MVI   PROLEN,36                                                00080000
         LA    R1,PROMPT                                                00081000
         BAL   R5,WRITEMSG                                              00082000
         RDTERM CONSINPT,EDIT=YES                                       00083000
         CLC   CONSINPT(4),YES                                          00084000
         BE    STRTBLD                                                  00085000
         CLC   CONSINPT(4),NO                                           00086000
         BE    BEGIN                                                    00087000
         B     LASTTRY                                                  00088000
*                                                                       00089000
*                                                                       00090000
STRTBLD  MVC   SLCLOC,STGPERM+2                                         00091000
         FSWRITE FSCB=OLDSLC,ERROR=SLCERR                               00092000
         MVC   BLDSLC,SLCESD                                            00093000
         FSWRITE FSCB=OLDSLC,ERROR=SLCERR                               00094000
         MVC   BLDSLC,SLCEND                                            00095000
         FSWRITE FSCB=OLDSLC,ERROR=SLCERR                               00096000
         FSCLOSE FSCB=OLDSLC                                            00097000
GOBACK   SR    R15,R15                                                  00098000
         BR    R14                                                      00099000
         SPACE 3                                                        00100000
WRITEMSG SVC   X'CA'                                                    00101000
         DC    AL4(*+4)                                                 00102000
         MVC   CONSOUT,SPACES                                           00103000
         BR    R5                                                       00104000
         SPACE 2                                                        00105000
CVTHB    DS    0H                                                       00106000
         STM   R0,R3,BALRSAVE          SAVE REG'S                       00107000
         LR    R3,R0          SAVE FIELD LEN.                           00108000
         SR    R2,R2                                                    00109000
         LR    R0,R2                                                    00110000
L1       IC    R2,0(,R1)      GET DIDIT                                 00111000
         CLI   0(R1),C'0'     GREATER THAN ZERO ?                       00112000
         BL    L3             NO -- TRY A-F                             00113000
         CLI   0(R1),C'9'     GREATER THAN NINE ?                       00114000
         BH    ERR2           YES --ERROR                               00115000
         SH    R2,=AL2(C'0')  CHANGE DIGIT TO HEX.                      00116000
         B     L2             CONTINUE                                  00117000
L3       CLI   0(R1),C'A'     LESS THAN "A" ?                           00118000
         BL    ERR2           YES -- ERROR                              00119000
         CLI   0(R1),C'F'     GREATER THAN "F" ?                        00120000
         BH    ERR2           YES -- ERROR.                             00121000
         SH    R2,=AL2(C'A'-10)    MAKE IT A CHAR                       00122000
L2       SLL   R0,4           ASSEMBLE NEXT DIGIT.                      00123000
         AR    R0,R2                                                    00124000
         LA    R1,1(,R1)      BUMP POINTER                              00125000
         BCT   R3,L1          LOOP THROUGH ENTIRE FIELD                 00126000
         ST    R0,BALRSAVE+R1*4    RETURN RESULT IN R1                  00127000
         SR    R0,R0          SET CC=0                                  00128000
         LM    R0,R3,BALRSAVE  RESTORE REG'S                            00129000
         BR    R5             RETURN                                    00130000
*                                                                       00131000
ERR2     DS    0H                                                       00132000
         LM    R0,R3,BALRSAVE      RESTORE REG'S                        00133000
         LA    R1,0           RETURN ZERO W/OUT CHANGING CC             00134000
         BR    R5                                                       00135000
*                                                                       00136000
         SPACE 1                                                        00137000
CVTBH    DS    0H                                                       00138000
         ST    R1,BALRSAVE    SAVE BINARY FIELD                         00139000
         UNPK  BALRSAVE+8(9),BALRSAVE(5)                                00140000
         TR    BALRSAVE+8(8),HEXTAB-240      TRANSLATE                  00141000
         LM    R0,R1,BALRSAVE+8    RETURN VALUE IN R0-R1                00142000
         BR    R5             RETURN                                    00143000
SLCERR   WRTERM 'ERROR WHILE WRITING "DMKSLC TEXT" FILE'                00144000
         LA    R15,4                                                    00145000
         BR    R14                                                      00146000
OLDSLC   FSCB  'DMKSLC TEXT',BUFFER=BLDSLC,BSIZE=80,RECFM=F             00147000
TERMLIST DS    0F                                                       00148000
         DC    CL8'TYPLIN'                                              00149000
         DC    AL1(1)                                                   00150000
         DC    AL3(CONSOUT)                                             00151000
         DC    C'B'                                                     00152000
         DC    AL3(0)                                                   00153000
         ORG   *-1                                                      00154000
MSGLEN   DC    X'00'                                                    00155000
PROMPT   DS    0F                                                       00156000
         DC    CL8'TYPLIN'                                              00157000
         DC    AL1(1)                                                   00158000
         DC    AL3(CONSOUT)                                             00159000
         DC    C'B'                                                     00160000
         DC    AL3(0)                                                   00161000
         ORG   *-1                                                      00162000
PROLEN   DC    X'00'                                                    00163000
CONSINPT DC    CL132' '       INPUT AREA FOR CONSOLE                    00164000
YES      DC    CL4'YES'                                                 00165000
NO       DC    CL4'NO'                                                  00166000
STGTEMP  DS    0D                                                       00167000
         DC    2F'0'                                                    00168000
STGPERM  DC    2F'0'                                                    00169000
         DS    0F                                                       00170000
SWSTG    DC    CL8' '                                                   00171000
WORKAREA DC    CL12' '                                                  00172000
CONSOUT  DC    CL132' '                                                 00173000
SPACES   DC    CL80' '                                                  00174000
BLDSLC   DC    CL80' '                                                  00175000
         ORG   BLDSLC                                                   00176000
         DC    X'02'                                                    00177000
         DC    C'SLC'                                                   00178000
         DC    CL2' '                                                   00179000
SLCLOC   DC    CL6' '                                                   00180000
         ORG                                                            00181000
SLCESD   DC    CL80' '                                                  00182000
         ORG   SLCESD                                                   00183000
         DC    X'02C5E2C4404040404040001040400001C4D4D2E2D3C34040'      00184000
         DC    X'0000000040000000'                                      00185000
         ORG                                                            00186000
SLCEND   DC    CL80' '                                                  00187000
         ORG   SLCEND                                                   00188000
         DC    X'02C5D5C4'                                              00189000
         ORG                                                            00190000
HEXTAB   DC    C'0123456789ABCDEF'      TRANSLATE TABLE                 00191000
         DS    0F                                                       00192000
BALRSAVE DC    8F'0'                                                    00193000
SLCARD   DC    2F'0'                                                    00194000
R0       EQU   0                                                        00195000
R1       EQU   1                                                        00196000
R2       EQU   2                                                        00197000
R3       EQU   3                                                        00198000
R4       EQU   4                                                        00199000
R5       EQU   5                                                        00200000
R6       EQU   6                                                        00201000
R7       EQU   7                                                        00202000
R8       EQU   8                                                        00203000
R9       EQU   9                                                        00204000
R10      EQU   10                                                       00205000
R11      EQU   11                                                       00206000
R12      EQU   12                                                       00207000
R13      EQU   13                                                       00208000
R14      EQU   14                                                       00209000
R15      EQU   15                                                       00210000
         LTORG                                                          00211000
         END                                                            00212000